/*
Navicat MySQL Data Transfer

Source Server         : hw
Source Server Version : 50729
Source Host           : 139.9.155.149:3306
Source Database       : caifeng

Target Server Type    : MYSQL
Target Server Version : 50729
File Encoding         : 65001

Date: 2020-07-06 14:46:46
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `cf_account`
-- ----------------------------
DROP TABLE IF EXISTS `cf_account`;
CREATE TABLE `cf_account` (
  `id` varchar(64) NOT NULL,
  `uid` varchar(64) NOT NULL COMMENT '用户id',
  `score_type` varchar(32) NOT NULL COMMENT '积分类型',
  `balance` decimal(10,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '余额',
  `freeze` bigint(19) unsigned NOT NULL DEFAULT '0' COMMENT '冻结解封时间',
  `type` tinyint(3) NOT NULL DEFAULT '0' COMMENT '账号类型(0-个人/1-商户/2-企业机构)',
  `create_time` bigint(19) unsigned NOT NULL COMMENT '开户时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='账户表';

-- ----------------------------
-- Records of cf_account
-- ----------------------------

-- ----------------------------
-- Table structure for `cf_account_log`
-- ----------------------------
DROP TABLE IF EXISTS `cf_account_log`;
CREATE TABLE `cf_account_log` (
  `id` varchar(64) NOT NULL,
  `account_id` varchar(64) NOT NULL COMMENT '账号',
  `value` decimal(10,2) NOT NULL COMMENT '变化值',
  `source_id` varchar(64) NOT NULL COMMENT '变动来源id',
  `create_time` bigint(19) unsigned NOT NULL COMMENT '创建时间',
  `score_type` varchar(32) NOT NULL COMMENT '积分类型',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='积分变动记录表';

-- ----------------------------
-- Records of cf_account_log
-- ----------------------------

-- ----------------------------
-- Table structure for `cf_app_version_log`
-- ----------------------------
DROP TABLE IF EXISTS `cf_app_version_log`;
CREATE TABLE `cf_app_version_log` (
  `id` varchar(64) NOT NULL,
  `platform` varchar(32) NOT NULL COMMENT '应用平台，例如android,ios等',
  `version_number` varchar(16) NOT NULL COMMENT '版本号',
  `level` tinyint(3) unsigned NOT NULL COMMENT '级别(0-普通更新/1-推荐更新/2-强制更新)',
  `note` varchar(128) NOT NULL DEFAULT '' COMMENT '版本描述',
  `publish_time` bigint(19) unsigned NOT NULL COMMENT '发布时间',
  `url` varchar(128) NOT NULL DEFAULT '' COMMENT 'app安装包下载地址',
  PRIMARY KEY (`id`),
  KEY `platform` (`platform`,`version_number`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='app版本发行记录表';

-- ----------------------------
-- Records of cf_app_version_log
-- ----------------------------
INSERT INTO `cf_app_version_log` VALUES ('1261313219163220126', 'android', '1.0.1', '1', '优化了寻找附近停车场数据列表', '1592637533000', 'http://139.9.155.149/A==UVekhhuhdfdjmfjd.apk');

-- ----------------------------
-- Table structure for `cf_areas`
-- ----------------------------
DROP TABLE IF EXISTS `cf_areas`;
CREATE TABLE `cf_areas` (
  `id` varchar(64) NOT NULL,
  `name` varchar(32) NOT NULL,
  `parent_id` varchar(64) NOT NULL,
  `short_name` varchar(16) NOT NULL,
  `level_type` int(11) unsigned NOT NULL,
  `city_code` varchar(16) NOT NULL DEFAULT '',
  `zip_code` varchar(16) NOT NULL DEFAULT '',
  `merger_name` varchar(64) NOT NULL,
  `position_x` decimal(16,12) NOT NULL,
  `position_y` decimal(16,12) NOT NULL,
  `pin_yin` varchar(64) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `parent_id` (`parent_id`,`level_type`),
  KEY `position_x` (`position_x`,`position_y`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='地区表';

-- ----------------------------
-- Records of cf_areas
-- ----------------------------
INSERT INTO `cf_areas` VALUES ('100000', '中国', '0', '中国', '0', '', '', '中国', '116.368324400000', '39.915085000000', 'China');
INSERT INTO `cf_areas` VALUES ('110000', '北京', '100000', '北京', '1', '', '', '中国,北京', '116.405285000000', '39.904989000000', 'Beijing');
INSERT INTO `cf_areas` VALUES ('110100', '北京市', '110000', '北京', '2', '010', '100000', '中国,北京,北京市', '116.405285000000', '39.904989000000', 'Beijing');
INSERT INTO `cf_areas` VALUES ('110101', '东城区', '110100', '东城', '3', '010', '100010', '中国,北京,北京市,东城区', '116.410050000000', '39.931570000000', 'Dongcheng');
INSERT INTO `cf_areas` VALUES ('110102', '西城区', '110100', '西城', '3', '010', '100032', '中国,北京,北京市,西城区', '116.360030000000', '39.930500000000', 'Xicheng');
INSERT INTO `cf_areas` VALUES ('110105', '朝阳区', '110100', '朝阳', '3', '010', '100020', '中国,北京,北京市,朝阳区', '116.485480000000', '39.948400000000', 'Chaoyang');
INSERT INTO `cf_areas` VALUES ('110106', '丰台区', '110100', '丰台', '3', '010', '100071', '中国,北京,北京市,丰台区', '116.286250000000', '39.858500000000', 'Fengtai');
INSERT INTO `cf_areas` VALUES ('110107', '石景山区', '110100', '石景山', '3', '010', '100043', '中国,北京,北京市,石景山区', '116.222900000000', '39.905640000000', 'Shijingshan');
INSERT INTO `cf_areas` VALUES ('110108', '海淀区', '110100', '海淀', '3', '010', '100089', '中国,北京,北京市,海淀区', '116.298120000000', '39.959310000000', 'Haidian');
INSERT INTO `cf_areas` VALUES ('110109', '门头沟区', '110100', '门头沟', '3', '010', '102300', '中国,北京,北京市,门头沟区', '116.101370000000', '39.940430000000', 'Mentougou');
INSERT INTO `cf_areas` VALUES ('110111', '房山区', '110100', '房山', '3', '010', '102488', '中国,北京,北京市,房山区', '116.142570000000', '39.747860000000', 'Fangshan');
INSERT INTO `cf_areas` VALUES ('110112', '通州区', '110100', '通州', '3', '010', '101149', '中国,北京,北京市,通州区', '116.657160000000', '39.909660000000', 'Tongzhou');
INSERT INTO `cf_areas` VALUES ('110113', '顺义区', '110100', '顺义', '3', '010', '101300', '中国,北京,北京市,顺义区', '116.654170000000', '40.130200000000', 'Shunyi');
INSERT INTO `cf_areas` VALUES ('110114', '昌平区', '110100', '昌平', '3', '010', '102200', '中国,北京,北京市,昌平区', '116.231200000000', '40.220720000000', 'Changping');
INSERT INTO `cf_areas` VALUES ('110115', '大兴区', '110100', '大兴', '3', '010', '102600', '中国,北京,北京市,大兴区', '116.341490000000', '39.726680000000', 'Daxing');
INSERT INTO `cf_areas` VALUES ('110116', '怀柔区', '110100', '怀柔', '3', '010', '101400', '中国,北京,北京市,怀柔区', '116.631680000000', '40.316020000000', 'Huairou');
INSERT INTO `cf_areas` VALUES ('110117', '平谷区', '110100', '平谷', '3', '010', '101200', '中国,北京,北京市,平谷区', '117.121330000000', '40.140560000000', 'Pinggu');
INSERT INTO `cf_areas` VALUES ('110228', '密云县', '110100', '密云', '3', '010', '101500', '中国,北京,北京市,密云县', '116.842950000000', '40.376180000000', 'Miyun');
INSERT INTO `cf_areas` VALUES ('110229', '延庆县', '110100', '延庆', '3', '010', '102100', '中国,北京,北京市,延庆县', '115.974940000000', '40.456720000000', 'Yanqing');
INSERT INTO `cf_areas` VALUES ('120000', '天津', '100000', '天津', '1', '', '', '中国,天津', '117.190182000000', '39.125596000000', 'Tianjin');
INSERT INTO `cf_areas` VALUES ('120100', '天津市', '120000', '天津', '2', '022', '300000', '中国,天津,天津市', '117.190182000000', '39.125596000000', 'Tianjin');
INSERT INTO `cf_areas` VALUES ('120101', '和平区', '120100', '和平', '3', '022', '300041', '中国,天津,天津市,和平区', '117.214560000000', '39.117180000000', 'Heping');
INSERT INTO `cf_areas` VALUES ('120102', '河东区', '120100', '河东', '3', '022', '300171', '中国,天津,天津市,河东区', '117.225620000000', '39.123180000000', 'Hedong');
INSERT INTO `cf_areas` VALUES ('120103', '河西区', '120100', '河西', '3', '022', '300202', '中国,天津,天津市,河西区', '117.223270000000', '39.109590000000', 'Hexi');
INSERT INTO `cf_areas` VALUES ('120104', '南开区', '120100', '南开', '3', '022', '300110', '中国,天津,天津市,南开区', '117.150740000000', '39.138210000000', 'Nankai');
INSERT INTO `cf_areas` VALUES ('120105', '河北区', '120100', '河北', '3', '022', '300143', '中国,天津,天津市,河北区', '117.196970000000', '39.148160000000', 'Hebei');
INSERT INTO `cf_areas` VALUES ('120106', '红桥区', '120100', '红桥', '3', '022', '300131', '中国,天津,天津市,红桥区', '117.151450000000', '39.167150000000', 'Hongqiao');
INSERT INTO `cf_areas` VALUES ('120110', '东丽区', '120100', '东丽', '3', '022', '300300', '中国,天津,天津市,东丽区', '117.314360000000', '39.086300000000', 'Dongli');
INSERT INTO `cf_areas` VALUES ('120111', '西青区', '120100', '西青', '3', '022', '300380', '中国,天津,天津市,西青区', '117.009270000000', '39.141230000000', 'Xiqing');
INSERT INTO `cf_areas` VALUES ('120112', '津南区', '120100', '津南', '3', '022', '300350', '中国,天津,天津市,津南区', '117.385370000000', '38.991390000000', 'Jinnan');
INSERT INTO `cf_areas` VALUES ('120113', '北辰区', '120100', '北辰', '3', '022', '300400', '中国,天津,天津市,北辰区', '117.132170000000', '39.221310000000', 'Beichen');
INSERT INTO `cf_areas` VALUES ('120114', '武清区', '120100', '武清', '3', '022', '301700', '中国,天津,天津市,武清区', '117.044430000000', '39.384150000000', 'Wuqing');
INSERT INTO `cf_areas` VALUES ('120115', '宝坻区', '120100', '宝坻', '3', '022', '301800', '中国,天津,天津市,宝坻区', '117.310300000000', '39.717610000000', 'Baodi');
INSERT INTO `cf_areas` VALUES ('120116', '滨海新区', '120100', '滨海新区', '3', '022', '300451', '中国,天津,天津市,滨海新区', '117.701620000000', '39.026680000000', 'Binhaixinqu');
INSERT INTO `cf_areas` VALUES ('120221', '宁河县', '120100', '宁河', '3', '022', '301500', '中国,天津,天津市,宁河县', '117.825500000000', '39.330480000000', 'Ninghe');
INSERT INTO `cf_areas` VALUES ('120223', '静海县', '120100', '静海', '3', '022', '301600', '中国,天津,天津市,静海县', '116.974360000000', '38.945820000000', 'Jinghai');
INSERT INTO `cf_areas` VALUES ('120225', '蓟县', '120100', '蓟县', '3', '022', '301900', '中国,天津,天津市,蓟县', '117.407990000000', '40.045670000000', 'Jixian');
INSERT INTO `cf_areas` VALUES ('130000', '河北省', '100000', '河北', '1', '', '', '中国,河北省', '114.502461000000', '38.045474000000', 'Hebei');
INSERT INTO `cf_areas` VALUES ('130100', '石家庄市', '130000', '石家庄', '2', '0311', '050011', '中国,河北省,石家庄市', '114.502461000000', '38.045474000000', 'Shijiazhuang');
INSERT INTO `cf_areas` VALUES ('130102', '长安区', '130100', '长安', '3', '0311', '050011', '中国,河北省,石家庄市,长安区', '114.539060000000', '38.036650000000', 'Chang\'an');
INSERT INTO `cf_areas` VALUES ('130104', '桥西区', '130100', '桥西', '3', '0311', '050091', '中国,河北省,石家庄市,桥西区', '114.469770000000', '38.032210000000', 'Qiaoxi');
INSERT INTO `cf_areas` VALUES ('130105', '新华区', '130100', '新华', '3', '0311', '050051', '中国,河北省,石家庄市,新华区', '114.463260000000', '38.050880000000', 'Xinhua');
INSERT INTO `cf_areas` VALUES ('130107', '井陉矿区', '130100', '井陉矿区', '3', '0311', '050100', '中国,河北省,石家庄市,井陉矿区', '114.065180000000', '38.067050000000', 'Jingxingkuangqu');
INSERT INTO `cf_areas` VALUES ('130108', '裕华区', '130100', '裕华', '3', '0311', '050031', '中国,河北省,石家庄市,裕华区', '114.531150000000', '38.006040000000', 'Yuhua');
INSERT INTO `cf_areas` VALUES ('130109', '藁城区', '130100', '藁城', '3', '0311', '052160', '中国,河北省,石家庄市,藁城区', '114.846710000000', '38.021620000000', 'Gaocheng');
INSERT INTO `cf_areas` VALUES ('130110', '鹿泉区', '130100', '鹿泉', '3', '0311', '050200', '中国,河北省,石家庄市,鹿泉区', '114.313470000000', '38.087820000000', 'Luquan');
INSERT INTO `cf_areas` VALUES ('130111', '栾城区', '130100', '栾城', '3', '0311', '051430', '中国,河北省,石家庄市,栾城区', '114.648340000000', '37.900220000000', 'Luancheng');
INSERT INTO `cf_areas` VALUES ('130121', '井陉县', '130100', '井陉', '3', '0311', '050300', '中国,河北省,石家庄市,井陉县', '114.142570000000', '38.036880000000', 'Jingxing');
INSERT INTO `cf_areas` VALUES ('130123', '正定县', '130100', '正定', '3', '0311', '050800', '中国,河北省,石家庄市,正定县', '114.572960000000', '38.144450000000', 'Zhengding');
INSERT INTO `cf_areas` VALUES ('130125', '行唐县', '130100', '行唐', '3', '0311', '050600', '中国,河北省,石家庄市,行唐县', '114.553160000000', '38.436540000000', 'Xingtang');
INSERT INTO `cf_areas` VALUES ('130126', '灵寿县', '130100', '灵寿', '3', '0311', '050500', '中国,河北省,石家庄市,灵寿县', '114.382590000000', '38.308450000000', 'Lingshou');
INSERT INTO `cf_areas` VALUES ('130127', '高邑县', '130100', '高邑', '3', '0311', '051330', '中国,河北省,石家庄市,高邑县', '114.611420000000', '37.615560000000', 'Gaoyi');
INSERT INTO `cf_areas` VALUES ('130128', '深泽县', '130100', '深泽', '3', '0311', '052560', '中国,河北省,石家庄市,深泽县', '115.203580000000', '38.183530000000', 'Shenze');
INSERT INTO `cf_areas` VALUES ('130129', '赞皇县', '130100', '赞皇', '3', '0311', '051230', '中国,河北省,石家庄市,赞皇县', '114.387750000000', '37.661350000000', 'Zanhuang');
INSERT INTO `cf_areas` VALUES ('130130', '无极县', '130100', '无极', '3', '0311', '052460', '中国,河北省,石家庄市,无极县', '114.975090000000', '38.176530000000', 'Wuji');
INSERT INTO `cf_areas` VALUES ('130131', '平山县', '130100', '平山', '3', '0311', '050400', '中国,河北省,石家庄市,平山县', '114.186000000000', '38.259940000000', 'Pingshan');
INSERT INTO `cf_areas` VALUES ('130132', '元氏县', '130100', '元氏', '3', '0311', '051130', '中国,河北省,石家庄市,元氏县', '114.525390000000', '37.766680000000', 'Yuanshi');
INSERT INTO `cf_areas` VALUES ('130133', '赵县', '130100', '赵县', '3', '0311', '051530', '中国,河北省,石家庄市,赵县', '114.776120000000', '37.756280000000', 'Zhaoxian');
INSERT INTO `cf_areas` VALUES ('130181', '辛集市', '130100', '辛集', '3', '0311', '052360', '中国,河北省,石家庄市,辛集市', '115.206260000000', '37.940790000000', 'Xinji');
INSERT INTO `cf_areas` VALUES ('130183', '晋州市', '130100', '晋州', '3', '0311', '052260', '中国,河北省,石家庄市,晋州市', '115.043480000000', '38.031350000000', 'Jinzhou');
INSERT INTO `cf_areas` VALUES ('130184', '新乐市', '130100', '新乐', '3', '0311', '050700', '中国,河北省,石家庄市,新乐市', '114.689850000000', '38.344170000000', 'Xinle');
INSERT INTO `cf_areas` VALUES ('130200', '唐山市', '130000', '唐山', '2', '0315', '063000', '中国,河北省,唐山市', '118.175393000000', '39.635113000000', 'Tangshan');
INSERT INTO `cf_areas` VALUES ('130202', '路南区', '130200', '路南', '3', '0315', '063000', '中国,河北省,唐山市,路南区', '118.154310000000', '39.625050000000', 'Lunan');
INSERT INTO `cf_areas` VALUES ('130203', '路北区', '130200', '路北', '3', '0315', '063000', '中国,河北省,唐山市,路北区', '118.200790000000', '39.624360000000', 'Lubei');
INSERT INTO `cf_areas` VALUES ('130204', '古冶区', '130200', '古冶', '3', '0315', '063100', '中国,河北省,唐山市,古冶区', '118.458030000000', '39.719930000000', 'Guye');
INSERT INTO `cf_areas` VALUES ('130205', '开平区', '130200', '开平', '3', '0315', '063021', '中国,河北省,唐山市,开平区', '118.261710000000', '39.671280000000', 'Kaiping');
INSERT INTO `cf_areas` VALUES ('130207', '丰南区', '130200', '丰南', '3', '0315', '063300', '中国,河北省,唐山市,丰南区', '118.112820000000', '39.564830000000', 'Fengnan');
INSERT INTO `cf_areas` VALUES ('130208', '丰润区', '130200', '丰润', '3', '0315', '064000', '中国,河北省,唐山市,丰润区', '118.129760000000', '39.824400000000', 'Fengrun');
INSERT INTO `cf_areas` VALUES ('130209', '曹妃甸区', '130200', '曹妃甸', '3', '0315', '063200', '中国,河北省,唐山市,曹妃甸区', '118.460379000000', '39.273070000000', 'Caofeidian');
INSERT INTO `cf_areas` VALUES ('130223', '滦县', '130200', '滦县', '3', '0315', '063700', '中国,河北省,唐山市,滦县', '118.703460000000', '39.740560000000', 'Luanxian');
INSERT INTO `cf_areas` VALUES ('130224', '滦南县', '130200', '滦南', '3', '0315', '063500', '中国,河北省,唐山市,滦南县', '118.674100000000', '39.503900000000', 'Luannan');
INSERT INTO `cf_areas` VALUES ('130225', '乐亭县', '130200', '乐亭', '3', '0315', '063600', '中国,河北省,唐山市,乐亭县', '118.912500000000', '39.425610000000', 'Laoting');
INSERT INTO `cf_areas` VALUES ('130227', '迁西县', '130200', '迁西', '3', '0315', '064300', '中国,河北省,唐山市,迁西县', '118.316160000000', '40.145870000000', 'Qianxi');
INSERT INTO `cf_areas` VALUES ('130229', '玉田县', '130200', '玉田', '3', '0315', '064100', '中国,河北省,唐山市,玉田县', '117.738800000000', '39.900490000000', 'Yutian');
INSERT INTO `cf_areas` VALUES ('130281', '遵化市', '130200', '遵化', '3', '0315', '064200', '中国,河北省,唐山市,遵化市', '117.964440000000', '40.187410000000', 'Zunhua');
INSERT INTO `cf_areas` VALUES ('130283', '迁安市', '130200', '迁安', '3', '0315', '064400', '中国,河北省,唐山市,迁安市', '118.700680000000', '39.998330000000', 'Qian\'an');
INSERT INTO `cf_areas` VALUES ('130300', '秦皇岛市', '130000', '秦皇岛', '2', '0335', '066000', '中国,河北省,秦皇岛市', '119.586579000000', '39.942531000000', 'Qinhuangdao');
INSERT INTO `cf_areas` VALUES ('130302', '海港区', '130300', '海港', '3', '0335', '066000', '中国,河北省,秦皇岛市,海港区', '119.610460000000', '39.934500000000', 'Haigang');
INSERT INTO `cf_areas` VALUES ('130303', '山海关区', '130300', '山海关', '3', '0335', '066200', '中国,河北省,秦皇岛市,山海关区', '119.775630000000', '39.978690000000', 'Shanhaiguan');
INSERT INTO `cf_areas` VALUES ('130304', '北戴河区', '130300', '北戴河', '3', '0335', '066100', '中国,河北省,秦皇岛市,北戴河区', '119.483880000000', '39.834080000000', 'Beidaihe');
INSERT INTO `cf_areas` VALUES ('130321', '青龙满族自治县', '130300', '青龙', '3', '0335', '066500', '中国,河北省,秦皇岛市,青龙满族自治县', '118.952420000000', '40.407430000000', 'Qinglong');
INSERT INTO `cf_areas` VALUES ('130322', '昌黎县', '130300', '昌黎', '3', '0335', '066600', '中国,河北省,秦皇岛市,昌黎县', '119.165950000000', '39.708840000000', 'Changli');
INSERT INTO `cf_areas` VALUES ('130323', '抚宁县', '130300', '抚宁', '3', '0335', '066300', '中国,河北省,秦皇岛市,抚宁县', '119.244870000000', '39.875380000000', 'Funing');
INSERT INTO `cf_areas` VALUES ('130324', '卢龙县', '130300', '卢龙', '3', '0335', '066400', '中国,河北省,秦皇岛市,卢龙县', '118.892880000000', '39.891760000000', 'Lulong');
INSERT INTO `cf_areas` VALUES ('130400', '邯郸市', '130000', '邯郸', '2', '0310', '056002', '中国,河北省,邯郸市', '114.490686000000', '36.612273000000', 'Handan');
INSERT INTO `cf_areas` VALUES ('130402', '邯山区', '130400', '邯山', '3', '0310', '056001', '中国,河北省,邯郸市,邯山区', '114.483750000000', '36.600060000000', 'Hanshan');
INSERT INTO `cf_areas` VALUES ('130403', '丛台区', '130400', '丛台', '3', '0310', '056002', '中国,河北省,邯郸市,丛台区', '114.493430000000', '36.618470000000', 'Congtai');
INSERT INTO `cf_areas` VALUES ('130404', '复兴区', '130400', '复兴', '3', '0310', '056003', '中国,河北省,邯郸市,复兴区', '114.459280000000', '36.611340000000', 'Fuxing');
INSERT INTO `cf_areas` VALUES ('130406', '峰峰矿区', '130400', '峰峰矿区', '3', '0310', '056200', '中国,河北省,邯郸市,峰峰矿区', '114.211480000000', '36.419370000000', 'Fengfengkuangqu');
INSERT INTO `cf_areas` VALUES ('130421', '邯郸县', '130400', '邯郸', '3', '0310', '056101', '中国,河北省,邯郸市,邯郸县', '114.531030000000', '36.593850000000', 'Handan');
INSERT INTO `cf_areas` VALUES ('130423', '临漳县', '130400', '临漳', '3', '0310', '056600', '中国,河北省,邯郸市,临漳县', '114.619500000000', '36.334610000000', 'Linzhang');
INSERT INTO `cf_areas` VALUES ('130424', '成安县', '130400', '成安', '3', '0310', '056700', '中国,河北省,邯郸市,成安县', '114.669950000000', '36.444110000000', 'Cheng\'an');
INSERT INTO `cf_areas` VALUES ('130425', '大名县', '130400', '大名', '3', '0310', '056900', '中国,河北省,邯郸市,大名县', '115.153620000000', '36.279940000000', 'Daming');
INSERT INTO `cf_areas` VALUES ('130426', '涉县', '130400', '涉县', '3', '0310', '056400', '中国,河北省,邯郸市,涉县', '113.691830000000', '36.580720000000', 'Shexian');
INSERT INTO `cf_areas` VALUES ('130427', '磁县', '130400', '磁县', '3', '0310', '056500', '中国,河北省,邯郸市,磁县', '114.373870000000', '36.373920000000', 'Cixian');
INSERT INTO `cf_areas` VALUES ('130428', '肥乡县', '130400', '肥乡', '3', '0310', '057550', '中国,河北省,邯郸市,肥乡县', '114.799980000000', '36.548070000000', 'Feixiang');
INSERT INTO `cf_areas` VALUES ('130429', '永年县', '130400', '永年', '3', '0310', '057150', '中国,河北省,邯郸市,永年县', '114.489250000000', '36.783560000000', 'Yongnian');
INSERT INTO `cf_areas` VALUES ('130430', '邱县', '130400', '邱县', '3', '0310', '057450', '中国,河北省,邯郸市,邱县', '115.174070000000', '36.820820000000', 'Qiuxian');
INSERT INTO `cf_areas` VALUES ('130431', '鸡泽县', '130400', '鸡泽', '3', '0310', '057350', '中国,河北省,邯郸市,鸡泽县', '114.874200000000', '36.923740000000', 'Jize');
INSERT INTO `cf_areas` VALUES ('130432', '广平县', '130400', '广平', '3', '0310', '057650', '中国,河北省,邯郸市,广平县', '114.946530000000', '36.480460000000', 'Guangping');
INSERT INTO `cf_areas` VALUES ('130433', '馆陶县', '130400', '馆陶', '3', '0310', '057750', '中国,河北省,邯郸市,馆陶县', '115.299130000000', '36.537190000000', 'Guantao');
INSERT INTO `cf_areas` VALUES ('130434', '魏县', '130400', '魏县', '3', '0310', '056800', '中国,河北省,邯郸市,魏县', '114.935180000000', '36.361710000000', 'Weixian');
INSERT INTO `cf_areas` VALUES ('130435', '曲周县', '130400', '曲周', '3', '0310', '057250', '中国,河北省,邯郸市,曲周县', '114.951960000000', '36.776710000000', 'Quzhou');
INSERT INTO `cf_areas` VALUES ('130481', '武安市', '130400', '武安', '3', '0310', '056300', '中国,河北省,邯郸市,武安市', '114.201530000000', '36.692810000000', 'Wu\'an');
INSERT INTO `cf_areas` VALUES ('130500', '邢台市', '130000', '邢台', '2', '0319', '054001', '中国,河北省,邢台市', '114.508851000000', '37.068200000000', 'Xingtai');
INSERT INTO `cf_areas` VALUES ('130502', '桥东区', '130500', '桥东', '3', '0319', '054001', '中国,河北省,邢台市,桥东区', '114.507250000000', '37.068010000000', 'Qiaodong');
INSERT INTO `cf_areas` VALUES ('130503', '桥西区', '130500', '桥西', '3', '0319', '054000', '中国,河北省,邢台市,桥西区', '114.468030000000', '37.059840000000', 'Qiaoxi');
INSERT INTO `cf_areas` VALUES ('130521', '邢台县', '130500', '邢台', '3', '0319', '054001', '中国,河北省,邢台市,邢台县', '114.565750000000', '37.045600000000', 'Xingtai');
INSERT INTO `cf_areas` VALUES ('130522', '临城县', '130500', '临城', '3', '0319', '054300', '中国,河北省,邢台市,临城县', '114.503870000000', '37.439770000000', 'Lincheng');
INSERT INTO `cf_areas` VALUES ('130523', '内丘县', '130500', '内丘', '3', '0319', '054200', '中国,河北省,邢台市,内丘县', '114.512120000000', '37.286710000000', 'Neiqiu');
INSERT INTO `cf_areas` VALUES ('130524', '柏乡县', '130500', '柏乡', '3', '0319', '055450', '中国,河北省,邢台市,柏乡县', '114.693320000000', '37.482420000000', 'Baixiang');
INSERT INTO `cf_areas` VALUES ('130525', '隆尧县', '130500', '隆尧', '3', '0319', '055350', '中国,河北省,邢台市,隆尧县', '114.776150000000', '37.353510000000', 'Longyao');
INSERT INTO `cf_areas` VALUES ('130526', '任县', '130500', '任县', '3', '0319', '055150', '中国,河北省,邢台市,任县', '114.684200000000', '37.125750000000', 'Renxian');
INSERT INTO `cf_areas` VALUES ('130527', '南和县', '130500', '南和', '3', '0319', '054400', '中国,河北省,邢台市,南和县', '114.683710000000', '37.004880000000', 'Nanhe');
INSERT INTO `cf_areas` VALUES ('130528', '宁晋县', '130500', '宁晋', '3', '0319', '055550', '中国,河北省,邢台市,宁晋县', '114.921170000000', '37.616960000000', 'Ningjin');
INSERT INTO `cf_areas` VALUES ('130529', '巨鹿县', '130500', '巨鹿', '3', '0319', '055250', '中国,河北省,邢台市,巨鹿县', '115.035240000000', '37.218010000000', 'Julu');
INSERT INTO `cf_areas` VALUES ('130530', '新河县', '130500', '新河', '3', '0319', '055650', '中国,河北省,邢台市,新河县', '115.249870000000', '37.527180000000', 'Xinhe');
INSERT INTO `cf_areas` VALUES ('130531', '广宗县', '130500', '广宗', '3', '0319', '054600', '中国,河北省,邢台市,广宗县', '115.142540000000', '37.074600000000', 'Guangzong');
INSERT INTO `cf_areas` VALUES ('130532', '平乡县', '130500', '平乡', '3', '0319', '054500', '中国,河北省,邢台市,平乡县', '115.030020000000', '37.063170000000', 'Pingxiang');
INSERT INTO `cf_areas` VALUES ('130533', '威县', '130500', '威县', '3', '0319', '054700', '中国,河北省,邢台市,威县', '115.263700000000', '36.976800000000', 'Weixian');
INSERT INTO `cf_areas` VALUES ('130534', '清河县', '130500', '清河', '3', '0319', '054800', '中国,河北省,邢台市,清河县', '115.664790000000', '37.071220000000', 'Qinghe');
INSERT INTO `cf_areas` VALUES ('130535', '临西县', '130500', '临西', '3', '0319', '054900', '中国,河北省,邢台市,临西县', '115.500970000000', '36.870780000000', 'Linxi');
INSERT INTO `cf_areas` VALUES ('130581', '南宫市', '130500', '南宫', '3', '0319', '055750', '中国,河北省,邢台市,南宫市', '115.390680000000', '37.357990000000', 'Nangong');
INSERT INTO `cf_areas` VALUES ('130582', '沙河市', '130500', '沙河', '3', '0319', '054100', '中国,河北省,邢台市,沙河市', '114.498100000000', '36.857700000000', 'Shahe');
INSERT INTO `cf_areas` VALUES ('130600', '保定市', '130000', '保定', '2', '0312', '071052', '中国,河北省,保定市', '115.482331000000', '38.867657000000', 'Baoding');
INSERT INTO `cf_areas` VALUES ('130602', '新市区', '130600', '新市', '3', '0312', '071051', '中国,河北省,保定市,新市区', '115.458700000000', '38.877510000000', 'Xinshi');
INSERT INTO `cf_areas` VALUES ('130603', '北市区', '130600', '北市', '3', '0312', '071000', '中国,河北省,保定市,北市区', '115.497150000000', '38.883220000000', 'Beishi');
INSERT INTO `cf_areas` VALUES ('130604', '南市区', '130600', '南市', '3', '0312', '071001', '中国,河北省,保定市,南市区', '115.528590000000', '38.854550000000', 'Nanshi');
INSERT INTO `cf_areas` VALUES ('130621', '满城县', '130600', '满城', '3', '0312', '072150', '中国,河北省,保定市,满城县', '115.322960000000', '38.949720000000', 'Mancheng');
INSERT INTO `cf_areas` VALUES ('130622', '清苑县', '130600', '清苑', '3', '0312', '071100', '中国,河北省,保定市,清苑县', '115.492670000000', '38.767090000000', 'Qingyuan');
INSERT INTO `cf_areas` VALUES ('130623', '涞水县', '130600', '涞水', '3', '0312', '074100', '中国,河北省,保定市,涞水县', '115.715170000000', '39.394040000000', 'Laishui');
INSERT INTO `cf_areas` VALUES ('130624', '阜平县', '130600', '阜平', '3', '0312', '073200', '中国,河北省,保定市,阜平县', '114.196830000000', '38.847630000000', 'Fuping');
INSERT INTO `cf_areas` VALUES ('130625', '徐水县', '130600', '徐水', '3', '0312', '072550', '中国,河北省,保定市,徐水县', '115.658290000000', '39.020990000000', 'Xushui');
INSERT INTO `cf_areas` VALUES ('130626', '定兴县', '130600', '定兴', '3', '0312', '072650', '中国,河北省,保定市,定兴县', '115.807860000000', '39.263120000000', 'Dingxing');
INSERT INTO `cf_areas` VALUES ('130627', '唐县', '130600', '唐县', '3', '0312', '072350', '中国,河北省,保定市,唐县', '114.985160000000', '38.745130000000', 'Tangxian');
INSERT INTO `cf_areas` VALUES ('130628', '高阳县', '130600', '高阳', '3', '0312', '071500', '中国,河北省,保定市,高阳县', '115.778800000000', '38.700030000000', 'Gaoyang');
INSERT INTO `cf_areas` VALUES ('130629', '容城县', '130600', '容城', '3', '0312', '071700', '中国,河北省,保定市,容城县', '115.871580000000', '39.053500000000', 'Rongcheng');
INSERT INTO `cf_areas` VALUES ('130630', '涞源县', '130600', '涞源', '3', '0312', '074300', '中国,河北省,保定市,涞源县', '114.691280000000', '39.353880000000', 'Laiyuan');
INSERT INTO `cf_areas` VALUES ('130631', '望都县', '130600', '望都', '3', '0312', '072450', '中国,河北省,保定市,望都县', '115.156700000000', '38.709960000000', 'Wangdu');
INSERT INTO `cf_areas` VALUES ('130632', '安新县', '130600', '安新', '3', '0312', '071600', '中国,河北省,保定市,安新县', '115.935570000000', '38.935320000000', 'Anxin');
INSERT INTO `cf_areas` VALUES ('130633', '易县', '130600', '易县', '3', '0312', '074200', '中国,河北省,保定市,易县', '115.498100000000', '39.348850000000', 'Yixian');
INSERT INTO `cf_areas` VALUES ('130634', '曲阳县', '130600', '曲阳', '3', '0312', '073100', '中国,河北省,保定市,曲阳县', '114.701230000000', '38.621540000000', 'Quyang');
INSERT INTO `cf_areas` VALUES ('130635', '蠡县', '130600', '蠡县', '3', '0312', '071400', '中国,河北省,保定市,蠡县', '115.577170000000', '38.489740000000', 'Lixian');
INSERT INTO `cf_areas` VALUES ('130636', '顺平县', '130600', '顺平', '3', '0312', '072250', '中国,河北省,保定市,顺平县', '115.134700000000', '38.838540000000', 'Shunping');
INSERT INTO `cf_areas` VALUES ('130637', '博野县', '130600', '博野', '3', '0312', '071300', '中国,河北省,保定市,博野县', '115.470330000000', '38.456400000000', 'Boye');
INSERT INTO `cf_areas` VALUES ('130638', '雄县', '130600', '雄县', '3', '0312', '071800', '中国,河北省,保定市,雄县', '116.108730000000', '38.994420000000', 'Xiongxian');
INSERT INTO `cf_areas` VALUES ('130681', '涿州市', '130600', '涿州', '3', '0312', '072750', '中国,河北省,保定市,涿州市', '115.980620000000', '39.486220000000', 'Zhuozhou');
INSERT INTO `cf_areas` VALUES ('130682', '定州市', '130600', '定州', '3', '0312', '073000', '中国,河北省,保定市,定州市', '114.990200000000', '38.516230000000', 'Dingzhou');
INSERT INTO `cf_areas` VALUES ('130683', '安国市', '130600', '安国', '3', '0312', '071200', '中国,河北省,保定市,安国市', '115.323210000000', '38.413910000000', 'Anguo');
INSERT INTO `cf_areas` VALUES ('130684', '高碑店市', '130600', '高碑店', '3', '0312', '074000', '中国,河北省,保定市,高碑店市', '115.873680000000', '39.326550000000', 'Gaobeidian');
INSERT INTO `cf_areas` VALUES ('130700', '张家口市', '130000', '张家口', '2', '0313', '075000', '中国,河北省,张家口市', '114.884091000000', '40.811901000000', 'Zhangjiakou');
INSERT INTO `cf_areas` VALUES ('130702', '桥东区', '130700', '桥东', '3', '0313', '075000', '中国,河北省,张家口市,桥东区', '114.894300000000', '40.788440000000', 'Qiaodong');
INSERT INTO `cf_areas` VALUES ('130703', '桥西区', '130700', '桥西', '3', '0313', '075061', '中国,河北省,张家口市,桥西区', '114.869620000000', '40.819450000000', 'Qiaoxi');
INSERT INTO `cf_areas` VALUES ('130705', '宣化区', '130700', '宣化', '3', '0313', '075100', '中国,河北省,张家口市,宣化区', '115.065430000000', '40.609570000000', 'Xuanhua');
INSERT INTO `cf_areas` VALUES ('130706', '下花园区', '130700', '下花园', '3', '0313', '075300', '中国,河北省,张家口市,下花园区', '115.287440000000', '40.502360000000', 'Xiahuayuan');
INSERT INTO `cf_areas` VALUES ('130721', '宣化县', '130700', '宣化', '3', '0313', '075100', '中国,河北省,张家口市,宣化县', '115.154970000000', '40.566180000000', 'Xuanhua');
INSERT INTO `cf_areas` VALUES ('130722', '张北县', '130700', '张北', '3', '0313', '076450', '中国,河北省,张家口市,张北县', '114.714320000000', '41.159770000000', 'Zhangbei');
INSERT INTO `cf_areas` VALUES ('130723', '康保县', '130700', '康保', '3', '0313', '076650', '中国,河北省,张家口市,康保县', '114.600310000000', '41.852250000000', 'Kangbao');
INSERT INTO `cf_areas` VALUES ('130724', '沽源县', '130700', '沽源', '3', '0313', '076550', '中国,河北省,张家口市,沽源县', '115.688590000000', '41.669590000000', 'Guyuan');
INSERT INTO `cf_areas` VALUES ('130725', '尚义县', '130700', '尚义', '3', '0313', '076750', '中国,河北省,张家口市,尚义县', '113.971340000000', '41.077820000000', 'Shangyi');
INSERT INTO `cf_areas` VALUES ('130726', '蔚县', '130700', '蔚县', '3', '0313', '075700', '中国,河北省,张家口市,蔚县', '114.588920000000', '39.840670000000', 'Yuxian');
INSERT INTO `cf_areas` VALUES ('130727', '阳原县', '130700', '阳原', '3', '0313', '075800', '中国,河北省,张家口市,阳原县', '114.150510000000', '40.103610000000', 'Yangyuan');
INSERT INTO `cf_areas` VALUES ('130728', '怀安县', '130700', '怀安', '3', '0313', '076150', '中国,河北省,张家口市,怀安县', '114.385590000000', '40.674250000000', 'Huai\'an');
INSERT INTO `cf_areas` VALUES ('130729', '万全县', '130700', '万全', '3', '0313', '076250', '中国,河北省,张家口市,万全县', '114.740500000000', '40.766940000000', 'Wanquan');
INSERT INTO `cf_areas` VALUES ('130730', '怀来县', '130700', '怀来', '3', '0313', '075400', '中国,河北省,张家口市,怀来县', '115.517730000000', '40.415360000000', 'Huailai');
INSERT INTO `cf_areas` VALUES ('130731', '涿鹿县', '130700', '涿鹿', '3', '0313', '075600', '中国,河北省,张家口市,涿鹿县', '115.224030000000', '40.376360000000', 'Zhuolu');
INSERT INTO `cf_areas` VALUES ('130732', '赤城县', '130700', '赤城', '3', '0313', '075500', '中国,河北省,张家口市,赤城县', '115.831870000000', '40.914380000000', 'Chicheng');
INSERT INTO `cf_areas` VALUES ('130733', '崇礼县', '130700', '崇礼', '3', '0313', '076350', '中国,河北省,张家口市,崇礼县', '115.279930000000', '40.975190000000', 'Chongli');
INSERT INTO `cf_areas` VALUES ('130800', '承德市', '130000', '承德', '2', '0314', '067000', '中国,河北省,承德市', '117.939152000000', '40.976204000000', 'Chengde');
INSERT INTO `cf_areas` VALUES ('130802', '双桥区', '130800', '双桥', '3', '0314', '067000', '中国,河北省,承德市,双桥区', '117.943200000000', '40.974660000000', 'Shuangqiao');
INSERT INTO `cf_areas` VALUES ('130803', '双滦区', '130800', '双滦', '3', '0314', '067001', '中国,河北省,承德市,双滦区', '117.744870000000', '40.953750000000', 'Shuangluan');
INSERT INTO `cf_areas` VALUES ('130804', '鹰手营子矿区', '130800', '鹰手营子矿区', '3', '0314', '067200', '中国,河北省,承德市,鹰手营子矿区', '117.659850000000', '40.547440000000', 'Yingshouyingzikuangqu');
INSERT INTO `cf_areas` VALUES ('130821', '承德县', '130800', '承德', '3', '0314', '067400', '中国,河北省,承德市,承德县', '118.176390000000', '40.769850000000', 'Chengde');
INSERT INTO `cf_areas` VALUES ('130822', '兴隆县', '130800', '兴隆', '3', '0314', '067300', '中国,河北省,承德市,兴隆县', '117.500730000000', '40.417090000000', 'Xinglong');
INSERT INTO `cf_areas` VALUES ('130823', '平泉县', '130800', '平泉', '3', '0314', '067500', '中国,河北省,承德市,平泉县', '118.701960000000', '41.018390000000', 'Pingquan');
INSERT INTO `cf_areas` VALUES ('130824', '滦平县', '130800', '滦平', '3', '0314', '068250', '中国,河北省,承德市,滦平县', '117.332760000000', '40.941480000000', 'Luanping');
INSERT INTO `cf_areas` VALUES ('130825', '隆化县', '130800', '隆化', '3', '0314', '068150', '中国,河北省,承德市,隆化县', '117.729700000000', '41.314120000000', 'Longhua');
INSERT INTO `cf_areas` VALUES ('130826', '丰宁满族自治县', '130800', '丰宁', '3', '0314', '068350', '中国,河北省,承德市,丰宁满族自治县', '116.649200000000', '41.204810000000', 'Fengning');
INSERT INTO `cf_areas` VALUES ('130827', '宽城满族自治县', '130800', '宽城', '3', '0314', '067600', '中国,河北省,承德市,宽城满族自治县', '118.491760000000', '40.608290000000', 'Kuancheng');
INSERT INTO `cf_areas` VALUES ('130828', '围场满族蒙古族自治县', '130800', '围场', '3', '0314', '068450', '中国,河北省,承德市,围场满族蒙古族自治县', '117.760100000000', '41.943680000000', 'Weichang');
INSERT INTO `cf_areas` VALUES ('130900', '沧州市', '130000', '沧州', '2', '0317', '061001', '中国,河北省,沧州市', '116.857461000000', '38.310582000000', 'Cangzhou');
INSERT INTO `cf_areas` VALUES ('130902', '新华区', '130900', '新华', '3', '0317', '061000', '中国,河北省,沧州市,新华区', '116.866430000000', '38.314380000000', 'Xinhua');
INSERT INTO `cf_areas` VALUES ('130903', '运河区', '130900', '运河', '3', '0317', '061001', '中国,河北省,沧州市,运河区', '116.857060000000', '38.313520000000', 'Yunhe');
INSERT INTO `cf_areas` VALUES ('130921', '沧县', '130900', '沧县', '3', '0317', '061000', '中国,河北省,沧州市,沧县', '116.878170000000', '38.293610000000', 'Cangxian');
INSERT INTO `cf_areas` VALUES ('130922', '青县', '130900', '青县', '3', '0317', '062650', '中国,河北省,沧州市,青县', '116.803160000000', '38.583450000000', 'Qingxian');
INSERT INTO `cf_areas` VALUES ('130923', '东光县', '130900', '东光', '3', '0317', '061600', '中国,河北省,沧州市,东光县', '116.536680000000', '37.885700000000', 'Dongguang');
INSERT INTO `cf_areas` VALUES ('130924', '海兴县', '130900', '海兴', '3', '0317', '061200', '中国,河北省,沧州市,海兴县', '117.497580000000', '38.139580000000', 'Haixing');
INSERT INTO `cf_areas` VALUES ('130925', '盐山县', '130900', '盐山', '3', '0317', '061300', '中国,河北省,沧州市,盐山县', '117.230920000000', '38.056470000000', 'Yanshan');
INSERT INTO `cf_areas` VALUES ('130926', '肃宁县', '130900', '肃宁', '3', '0317', '062350', '中国,河北省,沧州市,肃宁县', '115.829710000000', '38.422720000000', 'Suning');
INSERT INTO `cf_areas` VALUES ('130927', '南皮县', '130900', '南皮', '3', '0317', '061500', '中国,河北省,沧州市,南皮县', '116.702240000000', '38.041090000000', 'Nanpi');
INSERT INTO `cf_areas` VALUES ('130928', '吴桥县', '130900', '吴桥', '3', '0317', '061800', '中国,河北省,沧州市,吴桥县', '116.384700000000', '37.625460000000', 'Wuqiao');
INSERT INTO `cf_areas` VALUES ('130929', '献县', '130900', '献县', '3', '0317', '062250', '中国,河北省,沧州市,献县', '116.126950000000', '38.192280000000', 'Xianxian');
INSERT INTO `cf_areas` VALUES ('130930', '孟村回族自治县', '130900', '孟村', '3', '0317', '061400', '中国,河北省,沧州市,孟村回族自治县', '117.104120000000', '38.053380000000', 'Mengcun');
INSERT INTO `cf_areas` VALUES ('130981', '泊头市', '130900', '泊头', '3', '0317', '062150', '中国,河北省,沧州市,泊头市', '116.578240000000', '38.083590000000', 'Botou');
INSERT INTO `cf_areas` VALUES ('130982', '任丘市', '130900', '任丘', '3', '0317', '062550', '中国,河北省,沧州市,任丘市', '116.103300000000', '38.711240000000', 'Renqiu');
INSERT INTO `cf_areas` VALUES ('130983', '黄骅市', '130900', '黄骅', '3', '0317', '061100', '中国,河北省,沧州市,黄骅市', '117.338830000000', '38.370600000000', 'Huanghua');
INSERT INTO `cf_areas` VALUES ('130984', '河间市', '130900', '河间', '3', '0317', '062450', '中国,河北省,沧州市,河间市', '116.099300000000', '38.445490000000', 'Hejian');
INSERT INTO `cf_areas` VALUES ('131000', '廊坊市', '130000', '廊坊', '2', '0316', '065000', '中国,河北省,廊坊市', '116.713873000000', '39.529244000000', 'Langfang');
INSERT INTO `cf_areas` VALUES ('131002', '安次区', '131000', '安次', '3', '0316', '065000', '中国,河北省,廊坊市,安次区', '116.703080000000', '39.520570000000', 'Anci');
INSERT INTO `cf_areas` VALUES ('131003', '广阳区', '131000', '广阳', '3', '0316', '065000', '中国,河北省,廊坊市,广阳区', '116.710690000000', '39.522780000000', 'Guangyang');
INSERT INTO `cf_areas` VALUES ('131022', '固安县', '131000', '固安', '3', '0316', '065500', '中国,河北省,廊坊市,固安县', '116.299160000000', '39.438330000000', 'Gu\'an');
INSERT INTO `cf_areas` VALUES ('131023', '永清县', '131000', '永清', '3', '0316', '065600', '中国,河北省,廊坊市,永清县', '116.500910000000', '39.320690000000', 'Yongqing');
INSERT INTO `cf_areas` VALUES ('131024', '香河县', '131000', '香河', '3', '0316', '065400', '中国,河北省,廊坊市,香河县', '117.006340000000', '39.761330000000', 'Xianghe');
INSERT INTO `cf_areas` VALUES ('131025', '大城县', '131000', '大城', '3', '0316', '065900', '中国,河北省,廊坊市,大城县', '116.653530000000', '38.705340000000', 'Daicheng');
INSERT INTO `cf_areas` VALUES ('131026', '文安县', '131000', '文安', '3', '0316', '065800', '中国,河北省,廊坊市,文安县', '116.458460000000', '38.873250000000', 'Wen\'an');
INSERT INTO `cf_areas` VALUES ('131028', '大厂回族自治县', '131000', '大厂', '3', '0316', '065300', '中国,河北省,廊坊市,大厂回族自治县', '116.989160000000', '39.886490000000', 'Dachang');
INSERT INTO `cf_areas` VALUES ('131081', '霸州市', '131000', '霸州', '3', '0316', '065700', '中国,河北省,廊坊市,霸州市', '116.391540000000', '39.125690000000', 'Bazhou');
INSERT INTO `cf_areas` VALUES ('131082', '三河市', '131000', '三河', '3', '0316', '065200', '中国,河北省,廊坊市,三河市', '117.072290000000', '39.983580000000', 'Sanhe');
INSERT INTO `cf_areas` VALUES ('131100', '衡水市', '130000', '衡水', '2', '0318', '053000', '中国,河北省,衡水市', '115.665993000000', '37.735097000000', 'Hengshui');
INSERT INTO `cf_areas` VALUES ('131102', '桃城区', '131100', '桃城', '3', '0318', '053000', '中国,河北省,衡水市,桃城区', '115.675290000000', '37.734990000000', 'Taocheng');
INSERT INTO `cf_areas` VALUES ('131121', '枣强县', '131100', '枣强', '3', '0318', '053100', '中国,河北省,衡水市,枣强县', '115.725760000000', '37.510270000000', 'Zaoqiang');
INSERT INTO `cf_areas` VALUES ('131122', '武邑县', '131100', '武邑', '3', '0318', '053400', '中国,河北省,衡水市,武邑县', '115.887480000000', '37.801810000000', 'Wuyi');
INSERT INTO `cf_areas` VALUES ('131123', '武强县', '131100', '武强', '3', '0318', '053300', '中国,河北省,衡水市,武强县', '115.982260000000', '38.041380000000', 'Wuqiang');
INSERT INTO `cf_areas` VALUES ('131124', '饶阳县', '131100', '饶阳', '3', '0318', '053900', '中国,河北省,衡水市,饶阳县', '115.725580000000', '38.235290000000', 'Raoyang');
INSERT INTO `cf_areas` VALUES ('131125', '安平县', '131100', '安平', '3', '0318', '053600', '中国,河北省,衡水市,安平县', '115.518760000000', '38.233880000000', 'Anping');
INSERT INTO `cf_areas` VALUES ('131126', '故城县', '131100', '故城', '3', '0318', '053800', '中国,河北省,衡水市,故城县', '115.970760000000', '37.347730000000', 'Gucheng');
INSERT INTO `cf_areas` VALUES ('131127', '景县', '131100', '景县', '3', '0318', '053500', '中国,河北省,衡水市,景县', '116.269040000000', '37.692600000000', 'Jingxian');
INSERT INTO `cf_areas` VALUES ('131128', '阜城县', '131100', '阜城', '3', '0318', '053700', '中国,河北省,衡水市,阜城县', '116.144310000000', '37.868810000000', 'Fucheng');
INSERT INTO `cf_areas` VALUES ('131181', '冀州市', '131100', '冀州', '3', '0318', '053200', '中国,河北省,衡水市,冀州市', '115.579340000000', '37.550820000000', 'Jizhou');
INSERT INTO `cf_areas` VALUES ('131182', '深州市', '131100', '深州', '3', '0318', '053800', '中国,河北省,衡水市,深州市', '115.559930000000', '38.001090000000', 'Shenzhou');
INSERT INTO `cf_areas` VALUES ('140000', '山西省', '100000', '山西', '1', '', '', '中国,山西省', '112.549248000000', '37.857014000000', 'Shanxi');
INSERT INTO `cf_areas` VALUES ('140100', '太原市', '140000', '太原', '2', '0351', '030082', '中国,山西省,太原市', '112.549248000000', '37.857014000000', 'Taiyuan');
INSERT INTO `cf_areas` VALUES ('140105', '小店区', '140100', '小店', '3', '0351', '030032', '中国,山西省,太原市,小店区', '112.568780000000', '37.735650000000', 'Xiaodian');
INSERT INTO `cf_areas` VALUES ('140106', '迎泽区', '140100', '迎泽', '3', '0351', '030002', '中国,山西省,太原市,迎泽区', '112.563380000000', '37.863260000000', 'Yingze');
INSERT INTO `cf_areas` VALUES ('140107', '杏花岭区', '140100', '杏花岭', '3', '0351', '030009', '中国,山西省,太原市,杏花岭区', '112.562370000000', '37.884290000000', 'Xinghualing');
INSERT INTO `cf_areas` VALUES ('140108', '尖草坪区', '140100', '尖草坪', '3', '0351', '030023', '中国,山西省,太原市,尖草坪区', '112.487090000000', '37.941930000000', 'Jiancaoping');
INSERT INTO `cf_areas` VALUES ('140109', '万柏林区', '140100', '万柏林', '3', '0351', '030024', '中国,山西省,太原市,万柏林区', '112.515530000000', '37.859230000000', 'Wanbailin');
INSERT INTO `cf_areas` VALUES ('140110', '晋源区', '140100', '晋源', '3', '0351', '030025', '中国,山西省,太原市,晋源区', '112.479850000000', '37.724790000000', 'Jinyuan');
INSERT INTO `cf_areas` VALUES ('140121', '清徐县', '140100', '清徐', '3', '0351', '030400', '中国,山西省,太原市,清徐县', '112.358880000000', '37.607580000000', 'Qingxu');
INSERT INTO `cf_areas` VALUES ('140122', '阳曲县', '140100', '阳曲', '3', '0351', '030100', '中国,山西省,太原市,阳曲县', '112.678610000000', '38.059890000000', 'Yangqu');
INSERT INTO `cf_areas` VALUES ('140123', '娄烦县', '140100', '娄烦', '3', '0351', '030300', '中国,山西省,太原市,娄烦县', '111.794730000000', '38.066890000000', 'Loufan');
INSERT INTO `cf_areas` VALUES ('140181', '古交市', '140100', '古交', '3', '0351', '030200', '中国,山西省,太原市,古交市', '112.169180000000', '37.909830000000', 'Gujiao');
INSERT INTO `cf_areas` VALUES ('140200', '大同市', '140000', '大同', '2', '0352', '037008', '中国,山西省,大同市', '113.295259000000', '40.090310000000', 'Datong');
INSERT INTO `cf_areas` VALUES ('140202', '城区', '140200', '城区', '3', '0352', '037008', '中国,山西省,大同市,城区', '113.298000000000', '40.075660000000', 'Chengqu');
INSERT INTO `cf_areas` VALUES ('140203', '矿区', '140200', '矿区', '3', '0352', '037003', '中国,山西省,大同市,矿区', '113.177200000000', '40.036850000000', 'Kuangqu');
INSERT INTO `cf_areas` VALUES ('140211', '南郊区', '140200', '南郊', '3', '0352', '037001', '中国,山西省,大同市,南郊区', '113.149470000000', '40.005390000000', 'Nanjiao');
INSERT INTO `cf_areas` VALUES ('140212', '新荣区', '140200', '新荣', '3', '0352', '037002', '中国,山西省,大同市,新荣区', '113.135040000000', '40.256180000000', 'Xinrong');
INSERT INTO `cf_areas` VALUES ('140221', '阳高县', '140200', '阳高', '3', '0352', '038100', '中国,山西省,大同市,阳高县', '113.750120000000', '40.362560000000', 'Yanggao');
INSERT INTO `cf_areas` VALUES ('140222', '天镇县', '140200', '天镇', '3', '0352', '038200', '中国,山西省,大同市,天镇县', '114.093100000000', '40.422990000000', 'Tianzhen');
INSERT INTO `cf_areas` VALUES ('140223', '广灵县', '140200', '广灵', '3', '0352', '037500', '中国,山西省,大同市,广灵县', '114.282040000000', '39.760820000000', 'Guangling');
INSERT INTO `cf_areas` VALUES ('140224', '灵丘县', '140200', '灵丘', '3', '0352', '034400', '中国,山西省,大同市,灵丘县', '114.236720000000', '39.440430000000', 'Lingqiu');
INSERT INTO `cf_areas` VALUES ('140225', '浑源县', '140200', '浑源', '3', '0352', '037400', '中国,山西省,大同市,浑源县', '113.695520000000', '39.699620000000', 'Hunyuan');
INSERT INTO `cf_areas` VALUES ('140226', '左云县', '140200', '左云', '3', '0352', '037100', '中国,山西省,大同市,左云县', '112.702660000000', '40.013360000000', 'Zuoyun');
INSERT INTO `cf_areas` VALUES ('140227', '大同县', '140200', '大同', '3', '0352', '037300', '中国,山西省,大同市,大同县', '113.612120000000', '40.040120000000', 'Datong');
INSERT INTO `cf_areas` VALUES ('140300', '阳泉市', '140000', '阳泉', '2', '0353', '045000', '中国,山西省,阳泉市', '113.583285000000', '37.861188000000', 'Yangquan');
INSERT INTO `cf_areas` VALUES ('140302', '城区', '140300', '城区', '3', '0353', '045000', '中国,山西省,阳泉市,城区', '113.600690000000', '37.847400000000', 'Chengqu');
INSERT INTO `cf_areas` VALUES ('140303', '矿区', '140300', '矿区', '3', '0353', '045000', '中国,山西省,阳泉市,矿区', '113.556770000000', '37.868950000000', 'Kuangqu');
INSERT INTO `cf_areas` VALUES ('140311', '郊区', '140300', '郊区', '3', '0353', '045011', '中国,山西省,阳泉市,郊区', '113.585390000000', '37.941390000000', 'Jiaoqu');
INSERT INTO `cf_areas` VALUES ('140321', '平定县', '140300', '平定', '3', '0353', '045200', '中国,山西省,阳泉市,平定县', '113.657890000000', '37.786010000000', 'Pingding');
INSERT INTO `cf_areas` VALUES ('140322', '盂县', '140300', '盂县', '3', '0353', '045100', '中国,山西省,阳泉市,盂县', '113.412350000000', '38.085790000000', 'Yuxian');
INSERT INTO `cf_areas` VALUES ('140400', '长治市', '140000', '长治', '2', '0355', '046000', '中国,山西省,长治市', '113.113556000000', '36.191112000000', 'Changzhi');
INSERT INTO `cf_areas` VALUES ('140402', '城区', '140400', '城区', '3', '0355', '046011', '中国,山西省,长治市,城区', '113.123080000000', '36.203510000000', 'Chengqu');
INSERT INTO `cf_areas` VALUES ('140411', '郊区', '140400', '郊区', '3', '0355', '046011', '中国,山西省,长治市,郊区', '113.126530000000', '36.199180000000', 'Jiaoqu');
INSERT INTO `cf_areas` VALUES ('140421', '长治县', '140400', '长治', '3', '0355', '047100', '中国,山西省,长治市,长治县', '113.047910000000', '36.047220000000', 'Changzhi');
INSERT INTO `cf_areas` VALUES ('140423', '襄垣县', '140400', '襄垣', '3', '0355', '046200', '中国,山西省,长治市,襄垣县', '113.051570000000', '36.535270000000', 'Xiangyuan');
INSERT INTO `cf_areas` VALUES ('140424', '屯留县', '140400', '屯留', '3', '0355', '046100', '中国,山西省,长治市,屯留县', '112.891960000000', '36.315790000000', 'Tunliu');
INSERT INTO `cf_areas` VALUES ('140425', '平顺县', '140400', '平顺', '3', '0355', '047400', '中国,山西省,长治市,平顺县', '113.436030000000', '36.200050000000', 'Pingshun');
INSERT INTO `cf_areas` VALUES ('140426', '黎城县', '140400', '黎城', '3', '0355', '047600', '中国,山西省,长治市,黎城县', '113.387660000000', '36.503010000000', 'Licheng');
INSERT INTO `cf_areas` VALUES ('140427', '壶关县', '140400', '壶关', '3', '0355', '047300', '中国,山西省,长治市,壶关县', '113.207000000000', '36.113010000000', 'Huguan');
INSERT INTO `cf_areas` VALUES ('140428', '长子县', '140400', '长子', '3', '0355', '046600', '中国,山西省,长治市,长子县', '112.877310000000', '36.121250000000', 'Zhangzi');
INSERT INTO `cf_areas` VALUES ('140429', '武乡县', '140400', '武乡', '3', '0355', '046300', '中国,山西省,长治市,武乡县', '112.863430000000', '36.836870000000', 'Wuxiang');
INSERT INTO `cf_areas` VALUES ('140430', '沁县', '140400', '沁县', '3', '0355', '046400', '中国,山西省,长治市,沁县', '112.698630000000', '36.756280000000', 'Qinxian');
INSERT INTO `cf_areas` VALUES ('140431', '沁源县', '140400', '沁源', '3', '0355', '046500', '中国,山西省,长治市,沁源县', '112.337580000000', '36.500080000000', 'Qinyuan');
INSERT INTO `cf_areas` VALUES ('140481', '潞城市', '140400', '潞城', '3', '0355', '047500', '中国,山西省,长治市,潞城市', '113.228880000000', '36.334140000000', 'Lucheng');
INSERT INTO `cf_areas` VALUES ('140500', '晋城市', '140000', '晋城', '2', '0356', '048000', '中国,山西省,晋城市', '112.851274000000', '35.497553000000', 'Jincheng');
INSERT INTO `cf_areas` VALUES ('140502', '城区', '140500', '城区', '3', '0356', '048000', '中国,山西省,晋城市,城区', '112.853190000000', '35.501750000000', 'Chengqu');
INSERT INTO `cf_areas` VALUES ('140521', '沁水县', '140500', '沁水', '3', '0356', '048200', '中国,山西省,晋城市,沁水县', '112.187100000000', '35.691020000000', 'Qinshui');
INSERT INTO `cf_areas` VALUES ('140522', '阳城县', '140500', '阳城', '3', '0356', '048100', '中国,山西省,晋城市,阳城县', '112.414850000000', '35.486140000000', 'Yangcheng');
INSERT INTO `cf_areas` VALUES ('140524', '陵川县', '140500', '陵川', '3', '0356', '048300', '中国,山西省,晋城市,陵川县', '113.280600000000', '35.775320000000', 'Lingchuan');
INSERT INTO `cf_areas` VALUES ('140525', '泽州县', '140500', '泽州', '3', '0356', '048012', '中国,山西省,晋城市,泽州县', '112.839470000000', '35.507890000000', 'Zezhou');
INSERT INTO `cf_areas` VALUES ('140581', '高平市', '140500', '高平', '3', '0356', '048400', '中国,山西省,晋城市,高平市', '112.922880000000', '35.797050000000', 'Gaoping');
INSERT INTO `cf_areas` VALUES ('140600', '朔州市', '140000', '朔州', '2', '0349', '038500', '中国,山西省,朔州市', '112.433387000000', '39.331261000000', 'Shuozhou');
INSERT INTO `cf_areas` VALUES ('140602', '朔城区', '140600', '朔城', '3', '0349', '036000', '中国,山西省,朔州市,朔城区', '112.431890000000', '39.319820000000', 'Shuocheng');
INSERT INTO `cf_areas` VALUES ('140603', '平鲁区', '140600', '平鲁', '3', '0349', '038600', '中国,山西省,朔州市,平鲁区', '112.288330000000', '39.511550000000', 'Pinglu');
INSERT INTO `cf_areas` VALUES ('140621', '山阴县', '140600', '山阴', '3', '0349', '036900', '中国,山西省,朔州市,山阴县', '112.816620000000', '39.526970000000', 'Shanyin');
INSERT INTO `cf_areas` VALUES ('140622', '应县', '140600', '应县', '3', '0349', '037600', '中国,山西省,朔州市,应县', '113.190520000000', '39.552790000000', 'Yingxian');
INSERT INTO `cf_areas` VALUES ('140623', '右玉县', '140600', '右玉', '3', '0349', '037200', '中国,山西省,朔州市,右玉县', '112.469020000000', '39.990110000000', 'Youyu');
INSERT INTO `cf_areas` VALUES ('140624', '怀仁县', '140600', '怀仁', '3', '0349', '038300', '中国,山西省,朔州市,怀仁县', '113.100090000000', '39.828060000000', 'Huairen');
INSERT INTO `cf_areas` VALUES ('140700', '晋中市', '140000', '晋中', '2', '0354', '030600', '中国,山西省,晋中市', '112.736465000000', '37.696495000000', 'Jinzhong');
INSERT INTO `cf_areas` VALUES ('140702', '榆次区', '140700', '榆次', '3', '0354', '030600', '中国,山西省,晋中市,榆次区', '112.707880000000', '37.697800000000', 'Yuci');
INSERT INTO `cf_areas` VALUES ('140721', '榆社县', '140700', '榆社', '3', '0354', '031800', '中国,山西省,晋中市,榆社县', '112.975580000000', '37.072100000000', 'Yushe');
INSERT INTO `cf_areas` VALUES ('140722', '左权县', '140700', '左权', '3', '0354', '032600', '中国,山西省,晋中市,左权县', '113.379180000000', '37.082350000000', 'Zuoquan');
INSERT INTO `cf_areas` VALUES ('140723', '和顺县', '140700', '和顺', '3', '0354', '032700', '中国,山西省,晋中市,和顺县', '113.569880000000', '37.329630000000', 'Heshun');
INSERT INTO `cf_areas` VALUES ('140724', '昔阳县', '140700', '昔阳', '3', '0354', '045300', '中国,山西省,晋中市,昔阳县', '113.705170000000', '37.618630000000', 'Xiyang');
INSERT INTO `cf_areas` VALUES ('140725', '寿阳县', '140700', '寿阳', '3', '0354', '045400', '中国,山西省,晋中市,寿阳县', '113.174950000000', '37.888990000000', 'Shouyang');
INSERT INTO `cf_areas` VALUES ('140726', '太谷县', '140700', '太谷', '3', '0354', '030800', '中国,山西省,晋中市,太谷县', '112.552460000000', '37.421610000000', 'Taigu');
INSERT INTO `cf_areas` VALUES ('140727', '祁县', '140700', '祁县', '3', '0354', '030900', '中国,山西省,晋中市,祁县', '112.333580000000', '37.357900000000', 'Qixian');
INSERT INTO `cf_areas` VALUES ('140728', '平遥县', '140700', '平遥', '3', '0354', '031100', '中国,山西省,晋中市,平遥县', '112.175530000000', '37.189200000000', 'Pingyao');
INSERT INTO `cf_areas` VALUES ('140729', '灵石县', '140700', '灵石', '3', '0354', '031300', '中国,山西省,晋中市,灵石县', '111.777400000000', '36.848140000000', 'Lingshi');
INSERT INTO `cf_areas` VALUES ('140781', '介休市', '140700', '介休', '3', '0354', '032000', '中国,山西省,晋中市,介休市', '111.918240000000', '37.027710000000', 'Jiexiu');
INSERT INTO `cf_areas` VALUES ('140800', '运城市', '140000', '运城', '2', '0359', '044000', '中国,山西省,运城市', '111.003957000000', '35.022778000000', 'Yuncheng');
INSERT INTO `cf_areas` VALUES ('140802', '盐湖区', '140800', '盐湖', '3', '0359', '044000', '中国,山西省,运城市,盐湖区', '110.998270000000', '35.015100000000', 'Yanhu');
INSERT INTO `cf_areas` VALUES ('140821', '临猗县', '140800', '临猗', '3', '0359', '044100', '中国,山西省,运城市,临猗县', '110.774320000000', '35.144550000000', 'Linyi');
INSERT INTO `cf_areas` VALUES ('140822', '万荣县', '140800', '万荣', '3', '0359', '044200', '中国,山西省,运城市,万荣县', '110.836570000000', '35.415560000000', 'Wanrong');
INSERT INTO `cf_areas` VALUES ('140823', '闻喜县', '140800', '闻喜', '3', '0359', '043800', '中国,山西省,运城市,闻喜县', '111.222650000000', '35.355530000000', 'Wenxi');
INSERT INTO `cf_areas` VALUES ('140824', '稷山县', '140800', '稷山', '3', '0359', '043200', '中国,山西省,运城市,稷山县', '110.979240000000', '35.599930000000', 'Jishan');
INSERT INTO `cf_areas` VALUES ('140825', '新绛县', '140800', '新绛', '3', '0359', '043100', '中国,山西省,运城市,新绛县', '111.225090000000', '35.615660000000', 'Xinjiang');
INSERT INTO `cf_areas` VALUES ('140826', '绛县', '140800', '绛县', '3', '0359', '043600', '中国,山西省,运城市,绛县', '111.566680000000', '35.490960000000', 'Jiangxian');
INSERT INTO `cf_areas` VALUES ('140827', '垣曲县', '140800', '垣曲', '3', '0359', '043700', '中国,山西省,运城市,垣曲县', '111.671660000000', '35.299230000000', 'Yuanqu');
INSERT INTO `cf_areas` VALUES ('140828', '夏县', '140800', '夏县', '3', '0359', '044400', '中国,山西省,运城市,夏县', '111.219660000000', '35.141210000000', 'Xiaxian');
INSERT INTO `cf_areas` VALUES ('140829', '平陆县', '140800', '平陆', '3', '0359', '044300', '中国,山西省,运城市,平陆县', '111.217040000000', '34.837720000000', 'Pinglu');
INSERT INTO `cf_areas` VALUES ('140830', '芮城县', '140800', '芮城', '3', '0359', '044600', '中国,山西省,运城市,芮城县', '110.694550000000', '34.693840000000', 'Ruicheng');
INSERT INTO `cf_areas` VALUES ('140881', '永济市', '140800', '永济', '3', '0359', '044500', '中国,山西省,运城市,永济市', '110.445370000000', '34.865560000000', 'Yongji');
INSERT INTO `cf_areas` VALUES ('140882', '河津市', '140800', '河津', '3', '0359', '043300', '中国,山西省,运城市,河津市', '110.711600000000', '35.594780000000', 'Hejin');
INSERT INTO `cf_areas` VALUES ('140900', '忻州市', '140000', '忻州', '2', '0350', '034000', '中国,山西省,忻州市', '112.733538000000', '38.417690000000', 'Xinzhou');
INSERT INTO `cf_areas` VALUES ('140902', '忻府区', '140900', '忻府', '3', '0350', '034000', '中国,山西省,忻州市,忻府区', '112.746030000000', '38.404140000000', 'Xinfu');
INSERT INTO `cf_areas` VALUES ('140921', '定襄县', '140900', '定襄', '3', '0350', '035400', '中国,山西省,忻州市,定襄县', '112.957330000000', '38.473870000000', 'Dingxiang');
INSERT INTO `cf_areas` VALUES ('140922', '五台县', '140900', '五台', '3', '0350', '035500', '中国,山西省,忻州市,五台县', '113.252560000000', '38.727740000000', 'Wutai');
INSERT INTO `cf_areas` VALUES ('140923', '代县', '140900', '代县', '3', '0350', '034200', '中国,山西省,忻州市,代县', '112.959130000000', '39.067170000000', 'Daixian');
INSERT INTO `cf_areas` VALUES ('140924', '繁峙县', '140900', '繁峙', '3', '0350', '034300', '中国,山西省,忻州市,繁峙县', '113.263030000000', '39.188860000000', 'Fanshi');
INSERT INTO `cf_areas` VALUES ('140925', '宁武县', '140900', '宁武', '3', '0350', '036700', '中国,山西省,忻州市,宁武县', '112.304230000000', '39.002110000000', 'Ningwu');
INSERT INTO `cf_areas` VALUES ('140926', '静乐县', '140900', '静乐', '3', '0350', '035100', '中国,山西省,忻州市,静乐县', '111.941580000000', '38.360200000000', 'Jingle');
INSERT INTO `cf_areas` VALUES ('140927', '神池县', '140900', '神池', '3', '0350', '036100', '中国,山西省,忻州市,神池县', '112.205410000000', '39.090000000000', 'Shenchi');
INSERT INTO `cf_areas` VALUES ('140928', '五寨县', '140900', '五寨', '3', '0350', '036200', '中国,山西省,忻州市,五寨县', '111.848900000000', '38.907570000000', 'Wuzhai');
INSERT INTO `cf_areas` VALUES ('140929', '岢岚县', '140900', '岢岚', '3', '0350', '036300', '中国,山西省,忻州市,岢岚县', '111.573880000000', '38.704520000000', 'Kelan');
INSERT INTO `cf_areas` VALUES ('140930', '河曲县', '140900', '河曲', '3', '0350', '036500', '中国,山西省,忻州市,河曲县', '111.138210000000', '39.384390000000', 'Hequ');
INSERT INTO `cf_areas` VALUES ('140931', '保德县', '140900', '保德', '3', '0350', '036600', '中国,山西省,忻州市,保德县', '111.086560000000', '39.022480000000', 'Baode');
INSERT INTO `cf_areas` VALUES ('140932', '偏关县', '140900', '偏关', '3', '0350', '036400', '中国,山西省,忻州市,偏关县', '111.508630000000', '39.436090000000', 'Pianguan');
INSERT INTO `cf_areas` VALUES ('140981', '原平市', '140900', '原平', '3', '0350', '034100', '中国,山西省,忻州市,原平市', '112.705840000000', '38.731810000000', 'Yuanping');
INSERT INTO `cf_areas` VALUES ('141000', '临汾市', '140000', '临汾', '2', '0357', '041000', '中国,山西省,临汾市', '111.517973000000', '36.084150000000', 'Linfen');
INSERT INTO `cf_areas` VALUES ('141002', '尧都区', '141000', '尧都', '3', '0357', '041000', '中国,山西省,临汾市,尧都区', '111.578700000000', '36.082980000000', 'Yaodu');
INSERT INTO `cf_areas` VALUES ('141021', '曲沃县', '141000', '曲沃', '3', '0357', '043400', '中国,山西省,临汾市,曲沃县', '111.475250000000', '35.641190000000', 'Quwo');
INSERT INTO `cf_areas` VALUES ('141022', '翼城县', '141000', '翼城', '3', '0357', '043500', '中国,山西省,临汾市,翼城县', '111.718100000000', '35.738810000000', 'Yicheng');
INSERT INTO `cf_areas` VALUES ('141023', '襄汾县', '141000', '襄汾', '3', '0357', '041500', '中国,山西省,临汾市,襄汾县', '111.442040000000', '35.877110000000', 'Xiangfen');
INSERT INTO `cf_areas` VALUES ('141024', '洪洞县', '141000', '洪洞', '3', '0357', '041600', '中国,山西省,临汾市,洪洞县', '111.675010000000', '36.254250000000', 'Hongtong');
INSERT INTO `cf_areas` VALUES ('141025', '古县', '141000', '古县', '3', '0357', '042400', '中国,山西省,临汾市,古县', '111.920410000000', '36.266880000000', 'Guxian');
INSERT INTO `cf_areas` VALUES ('141026', '安泽县', '141000', '安泽', '3', '0357', '042500', '中国,山西省,临汾市,安泽县', '112.249810000000', '36.148030000000', 'Anze');
INSERT INTO `cf_areas` VALUES ('141027', '浮山县', '141000', '浮山', '3', '0357', '042600', '中国,山西省,临汾市,浮山县', '111.847440000000', '35.968540000000', 'Fushan');
INSERT INTO `cf_areas` VALUES ('141028', '吉县', '141000', '吉县', '3', '0357', '042200', '中国,山西省,临汾市,吉县', '110.681480000000', '36.098730000000', 'Jixian');
INSERT INTO `cf_areas` VALUES ('141029', '乡宁县', '141000', '乡宁', '3', '0357', '042100', '中国,山西省,临汾市,乡宁县', '110.846520000000', '35.970720000000', 'Xiangning');
INSERT INTO `cf_areas` VALUES ('141030', '大宁县', '141000', '大宁', '3', '0357', '042300', '中国,山西省,临汾市,大宁县', '110.752160000000', '36.466240000000', 'Daning');
INSERT INTO `cf_areas` VALUES ('141031', '隰县', '141000', '隰县', '3', '0357', '041300', '中国,山西省,临汾市,隰县', '110.938810000000', '36.692580000000', 'Xixian');
INSERT INTO `cf_areas` VALUES ('141032', '永和县', '141000', '永和', '3', '0357', '041400', '中国,山西省,临汾市,永和县', '110.631680000000', '36.758400000000', 'Yonghe');
INSERT INTO `cf_areas` VALUES ('141033', '蒲县', '141000', '蒲县', '3', '0357', '041200', '中国,山西省,临汾市,蒲县', '111.096740000000', '36.412430000000', 'Puxian');
INSERT INTO `cf_areas` VALUES ('141034', '汾西县', '141000', '汾西', '3', '0357', '031500', '中国,山西省,临汾市,汾西县', '111.568110000000', '36.650630000000', 'Fenxi');
INSERT INTO `cf_areas` VALUES ('141081', '侯马市', '141000', '侯马', '3', '0357', '043000', '中国,山西省,临汾市,侯马市', '111.372070000000', '35.619030000000', 'Houma');
INSERT INTO `cf_areas` VALUES ('141082', '霍州市', '141000', '霍州', '3', '0357', '031400', '中国,山西省,临汾市,霍州市', '111.755000000000', '36.563800000000', 'Huozhou');
INSERT INTO `cf_areas` VALUES ('141100', '吕梁市', '140000', '吕梁', '2', '0358', '033000', '中国,山西省,吕梁市', '111.134335000000', '37.524366000000', 'Lvliang');
INSERT INTO `cf_areas` VALUES ('141102', '离石区', '141100', '离石', '3', '0358', '033000', '中国,山西省,吕梁市,离石区', '111.150590000000', '37.517700000000', 'Lishi');
INSERT INTO `cf_areas` VALUES ('141121', '文水县', '141100', '文水', '3', '0358', '032100', '中国,山西省,吕梁市,文水县', '112.028290000000', '37.438410000000', 'Wenshui');
INSERT INTO `cf_areas` VALUES ('141122', '交城县', '141100', '交城', '3', '0358', '030500', '中国,山西省,吕梁市,交城县', '112.158500000000', '37.551200000000', 'Jiaocheng');
INSERT INTO `cf_areas` VALUES ('141123', '兴县', '141100', '兴县', '3', '0358', '033600', '中国,山西省,吕梁市,兴县', '111.126920000000', '38.463210000000', 'Xingxian');
INSERT INTO `cf_areas` VALUES ('141124', '临县', '141100', '临县', '3', '0358', '033200', '中国,山西省,吕梁市,临县', '110.992820000000', '37.952710000000', 'Linxian');
INSERT INTO `cf_areas` VALUES ('141125', '柳林县', '141100', '柳林', '3', '0358', '033300', '中国,山西省,吕梁市,柳林县', '110.889220000000', '37.429320000000', 'Liulin');
INSERT INTO `cf_areas` VALUES ('141126', '石楼县', '141100', '石楼', '3', '0358', '032500', '中国,山西省,吕梁市,石楼县', '110.835200000000', '36.997310000000', 'Shilou');
INSERT INTO `cf_areas` VALUES ('141127', '岚县', '141100', '岚县', '3', '0358', '033500', '中国,山西省,吕梁市,岚县', '111.676270000000', '38.278740000000', 'Lanxian');
INSERT INTO `cf_areas` VALUES ('141128', '方山县', '141100', '方山', '3', '0358', '033100', '中国,山西省,吕梁市,方山县', '111.240110000000', '37.889790000000', 'Fangshan');
INSERT INTO `cf_areas` VALUES ('141129', '中阳县', '141100', '中阳', '3', '0358', '033400', '中国,山西省,吕梁市,中阳县', '111.179500000000', '37.357150000000', 'Zhongyang');
INSERT INTO `cf_areas` VALUES ('141130', '交口县', '141100', '交口', '3', '0358', '032400', '中国,山西省,吕梁市,交口县', '111.181030000000', '36.982130000000', 'Jiaokou');
INSERT INTO `cf_areas` VALUES ('141181', '孝义市', '141100', '孝义', '3', '0358', '032300', '中国,山西省,吕梁市,孝义市', '111.773620000000', '37.144140000000', 'Xiaoyi');
INSERT INTO `cf_areas` VALUES ('141182', '汾阳市', '141100', '汾阳', '3', '0358', '032200', '中国,山西省,吕梁市,汾阳市', '111.788200000000', '37.266050000000', 'Fenyang');
INSERT INTO `cf_areas` VALUES ('150000', '内蒙古自治区', '100000', '内蒙古', '1', '', '', '中国,内蒙古自治区', '111.670801000000', '40.818311000000', 'Inner Mongolia');
INSERT INTO `cf_areas` VALUES ('150100', '呼和浩特市', '150000', '呼和浩特', '2', '0471', '010000', '中国,内蒙古自治区,呼和浩特市', '111.670801000000', '40.818311000000', 'Hohhot');
INSERT INTO `cf_areas` VALUES ('150102', '新城区', '150100', '新城', '3', '0471', '010050', '中国,内蒙古自治区,呼和浩特市,新城区', '111.665540000000', '40.858280000000', 'Xincheng');
INSERT INTO `cf_areas` VALUES ('150103', '回民区', '150100', '回民', '3', '0471', '010030', '中国,内蒙古自治区,呼和浩特市,回民区', '111.624020000000', '40.808270000000', 'Huimin');
INSERT INTO `cf_areas` VALUES ('150104', '玉泉区', '150100', '玉泉', '3', '0471', '010020', '中国,内蒙古自治区,呼和浩特市,玉泉区', '111.674560000000', '40.752270000000', 'Yuquan');
INSERT INTO `cf_areas` VALUES ('150105', '赛罕区', '150100', '赛罕', '3', '0471', '010020', '中国,内蒙古自治区,呼和浩特市,赛罕区', '111.702240000000', '40.792070000000', 'Saihan');
INSERT INTO `cf_areas` VALUES ('150121', '土默特左旗', '150100', '土默特左旗', '3', '0471', '010100', '中国,内蒙古自治区,呼和浩特市,土默特左旗', '111.148980000000', '40.722290000000', 'Tumotezuoqi');
INSERT INTO `cf_areas` VALUES ('150122', '托克托县', '150100', '托克托', '3', '0471', '010200', '中国,内蒙古自治区,呼和浩特市,托克托县', '111.191010000000', '40.274920000000', 'Tuoketuo');
INSERT INTO `cf_areas` VALUES ('150123', '和林格尔县', '150100', '和林格尔', '3', '0471', '011500', '中国,内蒙古自治区,呼和浩特市,和林格尔县', '111.822050000000', '40.378920000000', 'Helingeer');
INSERT INTO `cf_areas` VALUES ('150124', '清水河县', '150100', '清水河', '3', '0471', '011600', '中国,内蒙古自治区,呼和浩特市,清水河县', '111.683160000000', '39.909700000000', 'Qingshuihe');
INSERT INTO `cf_areas` VALUES ('150125', '武川县', '150100', '武川', '3', '0471', '011700', '中国,内蒙古自治区,呼和浩特市,武川县', '111.457850000000', '41.092890000000', 'Wuchuan');
INSERT INTO `cf_areas` VALUES ('150200', '包头市', '150000', '包头', '2', '0472', '014025', '中国,内蒙古自治区,包头市', '109.840405000000', '40.658168000000', 'Baotou');
INSERT INTO `cf_areas` VALUES ('150202', '东河区', '150200', '东河', '3', '0472', '014040', '中国,内蒙古自治区,包头市,东河区', '110.046200000000', '40.582370000000', 'Donghe');
INSERT INTO `cf_areas` VALUES ('150203', '昆都仑区', '150200', '昆都仑', '3', '0472', '014010', '中国,内蒙古自治区,包头市,昆都仑区', '109.838620000000', '40.641750000000', 'Kundulun');
INSERT INTO `cf_areas` VALUES ('150204', '青山区', '150200', '青山', '3', '0472', '014030', '中国,内蒙古自治区,包头市,青山区', '109.901310000000', '40.643290000000', 'Qingshan');
INSERT INTO `cf_areas` VALUES ('150205', '石拐区', '150200', '石拐', '3', '0472', '014070', '中国,内蒙古自治区,包头市,石拐区', '110.273220000000', '40.672970000000', 'Shiguai');
INSERT INTO `cf_areas` VALUES ('150206', '白云鄂博矿区', '150200', '白云鄂博矿区', '3', '0472', '014080', '中国,内蒙古自治区,包头市,白云鄂博矿区', '109.973670000000', '41.769680000000', 'Baiyunebokuangqu');
INSERT INTO `cf_areas` VALUES ('150207', '九原区', '150200', '九原', '3', '0472', '014060', '中国,内蒙古自治区,包头市,九原区', '109.964960000000', '40.605540000000', 'Jiuyuan');
INSERT INTO `cf_areas` VALUES ('150221', '土默特右旗', '150200', '土默特右旗', '3', '0472', '014100', '中国,内蒙古自治区,包头市,土默特右旗', '110.524170000000', '40.568800000000', 'Tumoteyouqi');
INSERT INTO `cf_areas` VALUES ('150222', '固阳县', '150200', '固阳', '3', '0472', '014200', '中国,内蒙古自治区,包头市,固阳县', '110.063720000000', '41.018510000000', 'Guyang');
INSERT INTO `cf_areas` VALUES ('150223', '达尔罕茂明安联合旗', '150200', '达茂旗', '3', '0472', '014500', '中国,内蒙古自治区,包头市,达尔罕茂明安联合旗', '110.432580000000', '41.698750000000', 'Damaoqi');
INSERT INTO `cf_areas` VALUES ('150300', '乌海市', '150000', '乌海', '2', '0473', '016000', '中国,内蒙古自治区,乌海市', '106.825563000000', '39.673734000000', 'Wuhai');
INSERT INTO `cf_areas` VALUES ('150302', '海勃湾区', '150300', '海勃湾', '3', '0473', '016000', '中国,内蒙古自治区,乌海市,海勃湾区', '106.822200000000', '39.669550000000', 'Haibowan');
INSERT INTO `cf_areas` VALUES ('150303', '海南区', '150300', '海南', '3', '0473', '016030', '中国,内蒙古自治区,乌海市,海南区', '106.886560000000', '39.441280000000', 'Hainan');
INSERT INTO `cf_areas` VALUES ('150304', '乌达区', '150300', '乌达', '3', '0473', '016040', '中国,内蒙古自治区,乌海市,乌达区', '106.727230000000', '39.505000000000', 'Wuda');
INSERT INTO `cf_areas` VALUES ('150400', '赤峰市', '150000', '赤峰', '2', '0476', '024000', '中国,内蒙古自治区,赤峰市', '118.956806000000', '42.275317000000', 'Chifeng');
INSERT INTO `cf_areas` VALUES ('150402', '红山区', '150400', '红山', '3', '0476', '024020', '中国,内蒙古自治区,赤峰市,红山区', '118.957550000000', '42.243120000000', 'Hongshan');
INSERT INTO `cf_areas` VALUES ('150403', '元宝山区', '150400', '元宝山', '3', '0476', '024076', '中国,内蒙古自治区,赤峰市,元宝山区', '119.289210000000', '42.040050000000', 'Yuanbaoshan');
INSERT INTO `cf_areas` VALUES ('150404', '松山区', '150400', '松山', '3', '0476', '024005', '中国,内蒙古自治区,赤峰市,松山区', '118.932800000000', '42.286130000000', 'Songshan');
INSERT INTO `cf_areas` VALUES ('150421', '阿鲁科尔沁旗', '150400', '阿鲁科尔沁旗', '3', '0476', '025550', '中国,内蒙古自治区,赤峰市,阿鲁科尔沁旗', '120.065270000000', '43.879880000000', 'Alukeerqinqi');
INSERT INTO `cf_areas` VALUES ('150422', '巴林左旗', '150400', '巴林左旗', '3', '0476', '025450', '中国,内蒙古自治区,赤峰市,巴林左旗', '119.380120000000', '43.970310000000', 'Balinzuoqi');
INSERT INTO `cf_areas` VALUES ('150423', '巴林右旗', '150400', '巴林右旗', '3', '0476', '025150', '中国,内蒙古自治区,赤峰市,巴林右旗', '118.664610000000', '43.533870000000', 'Balinyouqi');
INSERT INTO `cf_areas` VALUES ('150424', '林西县', '150400', '林西', '3', '0476', '025250', '中国,内蒙古自治区,赤峰市,林西县', '118.047330000000', '43.611650000000', 'Linxi');
INSERT INTO `cf_areas` VALUES ('150425', '克什克腾旗', '150400', '克什克腾旗', '3', '0476', '025350', '中国,内蒙古自治区,赤峰市,克什克腾旗', '117.545620000000', '43.265010000000', 'Keshiketengqi');
INSERT INTO `cf_areas` VALUES ('150426', '翁牛特旗', '150400', '翁牛特旗', '3', '0476', '024500', '中国,内蒙古自治区,赤峰市,翁牛特旗', '119.030420000000', '42.931470000000', 'Wengniuteqi');
INSERT INTO `cf_areas` VALUES ('150428', '喀喇沁旗', '150400', '喀喇沁旗', '3', '0476', '024400', '中国,内蒙古自治区,赤峰市,喀喇沁旗', '118.701440000000', '41.929170000000', 'Kalaqinqi');
INSERT INTO `cf_areas` VALUES ('150429', '宁城县', '150400', '宁城', '3', '0476', '024200', '中国,内蒙古自治区,赤峰市,宁城县', '119.343750000000', '41.596610000000', 'Ningcheng');
INSERT INTO `cf_areas` VALUES ('150430', '敖汉旗', '150400', '敖汉旗', '3', '0476', '024300', '中国,内蒙古自治区,赤峰市,敖汉旗', '119.921630000000', '42.290710000000', 'Aohanqi');
INSERT INTO `cf_areas` VALUES ('150500', '通辽市', '150000', '通辽', '2', '0475', '028000', '中国,内蒙古自治区,通辽市', '122.263119000000', '43.617429000000', 'Tongliao');
INSERT INTO `cf_areas` VALUES ('150502', '科尔沁区', '150500', '科尔沁', '3', '0475', '028000', '中国,内蒙古自治区,通辽市,科尔沁区', '122.255730000000', '43.622570000000', 'Keerqin');
INSERT INTO `cf_areas` VALUES ('150521', '科尔沁左翼中旗', '150500', '科尔沁左翼中旗', '3', '0475', '029300', '中国,内蒙古自治区,通辽市,科尔沁左翼中旗', '123.319120000000', '44.130140000000', 'Keerqinzuoyizhongqi');
INSERT INTO `cf_areas` VALUES ('150522', '科尔沁左翼后旗', '150500', '科尔沁左翼后旗', '3', '0475', '028100', '中国,内蒙古自治区,通辽市,科尔沁左翼后旗', '122.357450000000', '42.948970000000', 'Keerqinzuoyihouqi');
INSERT INTO `cf_areas` VALUES ('150523', '开鲁县', '150500', '开鲁', '3', '0475', '028400', '中国,内蒙古自治区,通辽市,开鲁县', '121.318840000000', '43.600030000000', 'Kailu');
INSERT INTO `cf_areas` VALUES ('150524', '库伦旗', '150500', '库伦旗', '3', '0475', '028200', '中国,内蒙古自治区,通辽市,库伦旗', '121.776000000000', '42.729980000000', 'Kulunqi');
INSERT INTO `cf_areas` VALUES ('150525', '奈曼旗', '150500', '奈曼旗', '3', '0475', '028300', '中国,内蒙古自治区,通辽市,奈曼旗', '120.663480000000', '42.845270000000', 'Naimanqi');
INSERT INTO `cf_areas` VALUES ('150526', '扎鲁特旗', '150500', '扎鲁特旗', '3', '0475', '029100', '中国,内蒙古自治区,通辽市,扎鲁特旗', '120.915070000000', '44.555920000000', 'Zhaluteqi');
INSERT INTO `cf_areas` VALUES ('150581', '霍林郭勒市', '150500', '霍林郭勒', '3', '0475', '029200', '中国,内蒙古自治区,通辽市,霍林郭勒市', '119.654290000000', '45.534540000000', 'Huolinguole');
INSERT INTO `cf_areas` VALUES ('150600', '鄂尔多斯市', '150000', '鄂尔多斯', '2', '0477', '017004', '中国,内蒙古自治区,鄂尔多斯市', '109.990290000000', '39.817179000000', 'Ordos');
INSERT INTO `cf_areas` VALUES ('150602', '东胜区', '150600', '东胜', '3', '0477', '017000', '中国,内蒙古自治区,鄂尔多斯市,东胜区', '109.962890000000', '39.822360000000', 'Dongsheng');
INSERT INTO `cf_areas` VALUES ('150621', '达拉特旗', '150600', '达拉特旗', '3', '0477', '014300', '中国,内蒙古自治区,鄂尔多斯市,达拉特旗', '110.033170000000', '40.400100000000', 'Dalateqi');
INSERT INTO `cf_areas` VALUES ('150622', '准格尔旗', '150600', '准格尔旗', '3', '0477', '017100', '中国,内蒙古自治区,鄂尔多斯市,准格尔旗', '111.236450000000', '39.867830000000', 'Zhungeerqi');
INSERT INTO `cf_areas` VALUES ('150623', '鄂托克前旗', '150600', '鄂托克前旗', '3', '0477', '016200', '中国,内蒙古自治区,鄂尔多斯市,鄂托克前旗', '107.484030000000', '38.183960000000', 'Etuokeqianqi');
INSERT INTO `cf_areas` VALUES ('150624', '鄂托克旗', '150600', '鄂托克旗', '3', '0477', '016100', '中国,内蒙古自治区,鄂尔多斯市,鄂托克旗', '107.982260000000', '39.094560000000', 'Etuokeqi');
INSERT INTO `cf_areas` VALUES ('150625', '杭锦旗', '150600', '杭锦旗', '3', '0477', '017400', '中国,内蒙古自治区,鄂尔多斯市,杭锦旗', '108.729340000000', '39.840230000000', 'Hangjinqi');
INSERT INTO `cf_areas` VALUES ('150626', '乌审旗', '150600', '乌审旗', '3', '0477', '017300', '中国,内蒙古自治区,鄂尔多斯市,乌审旗', '108.846100000000', '38.590920000000', 'Wushenqi');
INSERT INTO `cf_areas` VALUES ('150627', '伊金霍洛旗', '150600', '伊金霍洛旗', '3', '0477', '017200', '中国,内蒙古自治区,鄂尔多斯市,伊金霍洛旗', '109.749080000000', '39.573930000000', 'Yijinhuoluoqi');
INSERT INTO `cf_areas` VALUES ('150700', '呼伦贝尔市', '150000', '呼伦贝尔', '2', '0470', '021008', '中国,内蒙古自治区,呼伦贝尔市', '119.758168000000', '49.215333000000', 'Hulunber');
INSERT INTO `cf_areas` VALUES ('150702', '海拉尔区', '150700', '海拉尔', '3', '0470', '021000', '中国,内蒙古自治区,呼伦贝尔市,海拉尔区', '119.736400000000', '49.212200000000', 'Hailaer');
INSERT INTO `cf_areas` VALUES ('150703', '扎赉诺尔区', '150700', '扎赉诺尔', '3', '0470', '021410', '中国,内蒙古自治区,呼伦贝尔市,扎赉诺尔区', '117.792702000000', '49.486943000000', 'Zhalainuoer');
INSERT INTO `cf_areas` VALUES ('150721', '阿荣旗', '150700', '阿荣旗', '3', '0470', '162750', '中国,内蒙古自治区,呼伦贝尔市,阿荣旗', '123.459410000000', '48.125810000000', 'Arongqi');
INSERT INTO `cf_areas` VALUES ('150722', '莫力达瓦达斡尔族自治旗', '150700', '莫旗', '3', '0470', '162850', '中国,内蒙古自治区,呼伦贝尔市,莫力达瓦达斡尔族自治旗', '124.514980000000', '48.480550000000', 'Moqi');
INSERT INTO `cf_areas` VALUES ('150723', '鄂伦春自治旗', '150700', '鄂伦春', '3', '0470', '165450', '中国,内蒙古自治区,呼伦贝尔市,鄂伦春自治旗', '123.726040000000', '50.597770000000', 'Elunchun');
INSERT INTO `cf_areas` VALUES ('150724', '鄂温克族自治旗', '150700', '鄂温', '3', '0470', '021100', '中国,内蒙古自治区,呼伦贝尔市,鄂温克族自治旗', '119.756500000000', '49.142840000000', 'Ewen');
INSERT INTO `cf_areas` VALUES ('150725', '陈巴尔虎旗', '150700', '陈巴尔虎旗', '3', '0470', '021500', '中国,内蒙古自治区,呼伦贝尔市,陈巴尔虎旗', '119.424340000000', '49.326840000000', 'Chenbaerhuqi');
INSERT INTO `cf_areas` VALUES ('150726', '新巴尔虎左旗', '150700', '新巴尔虎左旗', '3', '0470', '021200', '中国,内蒙古自治区,呼伦贝尔市,新巴尔虎左旗', '118.269890000000', '48.218420000000', 'Xinbaerhuzuoqi');
INSERT INTO `cf_areas` VALUES ('150727', '新巴尔虎右旗', '150700', '新巴尔虎右旗', '3', '0470', '021300', '中国,内蒙古自治区,呼伦贝尔市,新巴尔虎右旗', '116.823660000000', '48.664730000000', 'Xinbaerhuyouqi');
INSERT INTO `cf_areas` VALUES ('150781', '满洲里市', '150700', '满洲里', '3', '0470', '021400', '中国,内蒙古自治区,呼伦贝尔市,满洲里市', '117.479460000000', '49.582720000000', 'Manzhouli');
INSERT INTO `cf_areas` VALUES ('150782', '牙克石市', '150700', '牙克石', '3', '0470', '022150', '中国,内蒙古自治区,呼伦贝尔市,牙克石市', '120.711700000000', '49.285600000000', 'Yakeshi');
INSERT INTO `cf_areas` VALUES ('150783', '扎兰屯市', '150700', '扎兰屯', '3', '0470', '162650', '中国,内蒙古自治区,呼伦贝尔市,扎兰屯市', '122.737570000000', '48.013630000000', 'Zhalantun');
INSERT INTO `cf_areas` VALUES ('150784', '额尔古纳市', '150700', '额尔古纳', '3', '0470', '022250', '中国,内蒙古自治区,呼伦贝尔市,额尔古纳市', '120.190940000000', '50.242490000000', 'Eerguna');
INSERT INTO `cf_areas` VALUES ('150785', '根河市', '150700', '根河', '3', '0470', '022350', '中国,内蒙古自治区,呼伦贝尔市,根河市', '121.521970000000', '50.779960000000', 'Genhe');
INSERT INTO `cf_areas` VALUES ('150800', '巴彦淖尔市', '150000', '巴彦淖尔', '2', '0478', '015001', '中国,内蒙古自治区,巴彦淖尔市', '107.416959000000', '40.757402000000', 'Bayan Nur');
INSERT INTO `cf_areas` VALUES ('150802', '临河区', '150800', '临河', '3', '0478', '015001', '中国,内蒙古自治区,巴彦淖尔市,临河区', '107.426680000000', '40.758270000000', 'Linhe');
INSERT INTO `cf_areas` VALUES ('150821', '五原县', '150800', '五原', '3', '0478', '015100', '中国,内蒙古自治区,巴彦淖尔市,五原县', '108.269160000000', '41.096310000000', 'Wuyuan');
INSERT INTO `cf_areas` VALUES ('150822', '磴口县', '150800', '磴口', '3', '0478', '015200', '中国,内蒙古自治区,巴彦淖尔市,磴口县', '107.009360000000', '40.330620000000', 'Dengkou');
INSERT INTO `cf_areas` VALUES ('150823', '乌拉特前旗', '150800', '乌拉特前旗', '3', '0478', '014400', '中国,内蒙古自治区,巴彦淖尔市,乌拉特前旗', '108.652190000000', '40.736490000000', 'Wulateqianqi');
INSERT INTO `cf_areas` VALUES ('150824', '乌拉特中旗', '150800', '乌拉特中旗', '3', '0478', '015300', '中国,内蒙古自治区,巴彦淖尔市,乌拉特中旗', '108.525870000000', '41.567890000000', 'Wulatezhongqi');
INSERT INTO `cf_areas` VALUES ('150825', '乌拉特后旗', '150800', '乌拉特后旗', '3', '0478', '015500', '中国,内蒙古自治区,巴彦淖尔市,乌拉特后旗', '106.989710000000', '41.431510000000', 'Wulatehouqi');
INSERT INTO `cf_areas` VALUES ('150826', '杭锦后旗', '150800', '杭锦后旗', '3', '0478', '015400', '中国,内蒙古自治区,巴彦淖尔市,杭锦后旗', '107.151330000000', '40.886270000000', 'Hangjinhouqi');
INSERT INTO `cf_areas` VALUES ('150900', '乌兰察布市', '150000', '乌兰察布', '2', '0474', '012000', '中国,内蒙古自治区,乌兰察布市', '113.114543000000', '41.034126000000', 'Ulanqab');
INSERT INTO `cf_areas` VALUES ('150902', '集宁区', '150900', '集宁', '3', '0474', '012000', '中国,内蒙古自治区,乌兰察布市,集宁区', '113.114520000000', '41.035300000000', 'Jining');
INSERT INTO `cf_areas` VALUES ('150921', '卓资县', '150900', '卓资', '3', '0474', '012300', '中国,内蒙古自治区,乌兰察布市,卓资县', '112.577570000000', '40.894140000000', 'Zhuozi');
INSERT INTO `cf_areas` VALUES ('150922', '化德县', '150900', '化德', '3', '0474', '013350', '中国,内蒙古自治区,乌兰察布市,化德县', '114.010710000000', '41.904330000000', 'Huade');
INSERT INTO `cf_areas` VALUES ('150923', '商都县', '150900', '商都', '3', '0474', '013450', '中国,内蒙古自治区,乌兰察布市,商都县', '113.577720000000', '41.562130000000', 'Shangdu');
INSERT INTO `cf_areas` VALUES ('150924', '兴和县', '150900', '兴和', '3', '0474', '013650', '中国,内蒙古自治区,乌兰察布市,兴和县', '113.833950000000', '40.871860000000', 'Xinghe');
INSERT INTO `cf_areas` VALUES ('150925', '凉城县', '150900', '凉城', '3', '0474', '013750', '中国,内蒙古自治区,乌兰察布市,凉城县', '112.495690000000', '40.533460000000', 'Liangcheng');
INSERT INTO `cf_areas` VALUES ('150926', '察哈尔右翼前旗', '150900', '察右前旗', '3', '0474', '012200', '中国,内蒙古自治区,乌兰察布市,察哈尔右翼前旗', '113.221310000000', '40.778800000000', 'Chayouqianqi');
INSERT INTO `cf_areas` VALUES ('150927', '察哈尔右翼中旗', '150900', '察右中旗', '3', '0474', '013550', '中国,内蒙古自治区,乌兰察布市,察哈尔右翼中旗', '112.635370000000', '41.277420000000', 'Chayouzhongqi');
INSERT INTO `cf_areas` VALUES ('150928', '察哈尔右翼后旗', '150900', '察右后旗', '3', '0474', '012400', '中国,内蒙古自治区,乌兰察布市,察哈尔右翼后旗', '113.192160000000', '41.435540000000', 'Chayouhouqi');
INSERT INTO `cf_areas` VALUES ('150929', '四子王旗', '150900', '四子王旗', '3', '0474', '011800', '中国,内蒙古自治区,乌兰察布市,四子王旗', '111.706540000000', '41.533120000000', 'Siziwangqi');
INSERT INTO `cf_areas` VALUES ('150981', '丰镇市', '150900', '丰镇', '3', '0474', '012100', '中国,内蒙古自治区,乌兰察布市,丰镇市', '113.109830000000', '40.436900000000', 'Fengzhen');
INSERT INTO `cf_areas` VALUES ('152200', '兴安盟', '150000', '兴安盟', '2', '0482', '137401', '中国,内蒙古自治区,兴安盟', '122.070317000000', '46.076268000000', 'Hinggan');
INSERT INTO `cf_areas` VALUES ('152201', '乌兰浩特市', '152200', '乌兰浩特', '3', '0482', '137401', '中国,内蒙古自治区,兴安盟,乌兰浩特市', '122.063780000000', '46.062350000000', 'Wulanhaote');
INSERT INTO `cf_areas` VALUES ('152202', '阿尔山市', '152200', '阿尔山', '3', '0482', '137800', '中国,内蒙古自治区,兴安盟,阿尔山市', '119.943170000000', '47.177160000000', 'Aershan');
INSERT INTO `cf_areas` VALUES ('152221', '科尔沁右翼前旗', '152200', '科右前旗', '3', '0482', '137423', '中国,内蒙古自治区,兴安盟,科尔沁右翼前旗', '121.952690000000', '46.079500000000', 'Keyouqianqi');
INSERT INTO `cf_areas` VALUES ('152222', '科尔沁右翼中旗', '152200', '科右中旗', '3', '0482', '029400', '中国,内蒙古自治区,兴安盟,科尔沁右翼中旗', '121.468070000000', '45.056050000000', 'Keyouzhongqi');
INSERT INTO `cf_areas` VALUES ('152223', '扎赉特旗', '152200', '扎赉特旗', '3', '0482', '137600', '中国,内蒙古自治区,兴安盟,扎赉特旗', '122.912290000000', '46.726700000000', 'Zhalaiteqi');
INSERT INTO `cf_areas` VALUES ('152224', '突泉县', '152200', '突泉', '3', '0482', '137500', '中国,内蒙古自治区,兴安盟,突泉县', '121.593960000000', '45.381870000000', 'Tuquan');
INSERT INTO `cf_areas` VALUES ('152500', '锡林郭勒盟', '150000', '锡林郭勒盟', '2', '0479', '026000', '中国,内蒙古自治区,锡林郭勒盟', '116.090996000000', '43.944018000000', 'Xilin Gol');
INSERT INTO `cf_areas` VALUES ('152501', '二连浩特市', '152500', '二连浩特', '3', '0479', '011100', '中国,内蒙古自治区,锡林郭勒盟,二连浩特市', '111.982970000000', '43.653030000000', 'Erlianhaote');
INSERT INTO `cf_areas` VALUES ('152502', '锡林浩特市', '152500', '锡林浩特', '3', '0479', '026021', '中国,内蒙古自治区,锡林郭勒盟,锡林浩特市', '116.086030000000', '43.933410000000', 'Xilinhaote');
INSERT INTO `cf_areas` VALUES ('152522', '阿巴嘎旗', '152500', '阿巴嘎旗', '3', '0479', '011400', '中国,内蒙古自治区,锡林郭勒盟,阿巴嘎旗', '114.968260000000', '44.021740000000', 'Abagaqi');
INSERT INTO `cf_areas` VALUES ('152523', '苏尼特左旗', '152500', '苏尼特左旗', '3', '0479', '011300', '中国,内蒙古自治区,锡林郭勒盟,苏尼特左旗', '113.650600000000', '43.856870000000', 'Sunitezuoqi');
INSERT INTO `cf_areas` VALUES ('152524', '苏尼特右旗', '152500', '苏尼特右旗', '3', '0479', '011200', '中国,内蒙古自治区,锡林郭勒盟,苏尼特右旗', '112.657410000000', '42.746900000000', 'Suniteyouqi');
INSERT INTO `cf_areas` VALUES ('152525', '东乌珠穆沁旗', '152500', '东乌旗', '3', '0479', '026300', '中国,内蒙古自治区,锡林郭勒盟,东乌珠穆沁旗', '116.972930000000', '45.511080000000', 'Dongwuqi');
INSERT INTO `cf_areas` VALUES ('152526', '西乌珠穆沁旗', '152500', '西乌旗', '3', '0479', '026200', '中国,内蒙古自治区,锡林郭勒盟,西乌珠穆沁旗', '117.609830000000', '44.596230000000', 'Xiwuqi');
INSERT INTO `cf_areas` VALUES ('152527', '太仆寺旗', '152500', '太仆寺旗', '3', '0479', '027000', '中国,内蒙古自治区,锡林郭勒盟,太仆寺旗', '115.283020000000', '41.877270000000', 'Taipusiqi');
INSERT INTO `cf_areas` VALUES ('152528', '镶黄旗', '152500', '镶黄旗', '3', '0479', '013250', '中国,内蒙古自治区,锡林郭勒盟,镶黄旗', '113.844720000000', '42.239270000000', 'Xianghuangqi');
INSERT INTO `cf_areas` VALUES ('152529', '正镶白旗', '152500', '正镶白旗', '3', '0479', '013800', '中国,内蒙古自治区,锡林郭勒盟,正镶白旗', '115.000670000000', '42.307120000000', 'Zhengxiangbaiqi');
INSERT INTO `cf_areas` VALUES ('152530', '正蓝旗', '152500', '正蓝旗', '3', '0479', '027200', '中国,内蒙古自治区,锡林郭勒盟,正蓝旗', '116.003630000000', '42.252290000000', 'Zhenglanqi');
INSERT INTO `cf_areas` VALUES ('152531', '多伦县', '152500', '多伦', '3', '0479', '027300', '中国,内蒙古自治区,锡林郭勒盟,多伦县', '116.485650000000', '42.203000000000', 'Duolun');
INSERT INTO `cf_areas` VALUES ('152900', '阿拉善盟', '150000', '阿拉善盟', '2', '0483', '750306', '中国,内蒙古自治区,阿拉善盟', '105.706422000000', '38.844814000000', 'Alxa');
INSERT INTO `cf_areas` VALUES ('152921', '阿拉善左旗', '152900', '阿拉善左旗', '3', '0483', '750306', '中国,内蒙古自治区,阿拉善盟,阿拉善左旗', '105.675320000000', '38.829300000000', 'Alashanzuoqi');
INSERT INTO `cf_areas` VALUES ('152922', '阿拉善右旗', '152900', '阿拉善右旗', '3', '0483', '737300', '中国,内蒙古自治区,阿拉善盟,阿拉善右旗', '101.667050000000', '39.215330000000', 'Alashanyouqi');
INSERT INTO `cf_areas` VALUES ('152923', '额济纳旗', '152900', '额济纳旗', '3', '0483', '735400', '中国,内蒙古自治区,阿拉善盟,额济纳旗', '101.068870000000', '41.967550000000', 'Ejinaqi');
INSERT INTO `cf_areas` VALUES ('210000', '辽宁省', '100000', '辽宁', '1', '', '', '中国,辽宁省', '123.429096000000', '41.796767000000', 'Liaoning');
INSERT INTO `cf_areas` VALUES ('210100', '沈阳市', '210000', '沈阳', '2', '024', '110013', '中国,辽宁省,沈阳市', '123.429096000000', '41.796767000000', 'Shenyang');
INSERT INTO `cf_areas` VALUES ('210102', '和平区', '210100', '和平', '3', '024', '110001', '中国,辽宁省,沈阳市,和平区', '123.420400000000', '41.789970000000', 'Heping');
INSERT INTO `cf_areas` VALUES ('210103', '沈河区', '210100', '沈河', '3', '024', '110011', '中国,辽宁省,沈阳市,沈河区', '123.458710000000', '41.796250000000', 'Shenhe');
INSERT INTO `cf_areas` VALUES ('210104', '大东区', '210100', '大东', '3', '024', '110041', '中国,辽宁省,沈阳市,大东区', '123.469970000000', '41.805390000000', 'Dadong');
INSERT INTO `cf_areas` VALUES ('210105', '皇姑区', '210100', '皇姑', '3', '024', '110031', '中国,辽宁省,沈阳市,皇姑区', '123.425270000000', '41.820350000000', 'Huanggu');
INSERT INTO `cf_areas` VALUES ('210106', '铁西区', '210100', '铁西', '3', '024', '110021', '中国,辽宁省,沈阳市,铁西区', '123.376750000000', '41.802690000000', 'Tiexi');
INSERT INTO `cf_areas` VALUES ('210111', '苏家屯区', '210100', '苏家屯', '3', '024', '110101', '中国,辽宁省,沈阳市,苏家屯区', '123.344050000000', '41.664750000000', 'Sujiatun');
INSERT INTO `cf_areas` VALUES ('210112', '浑南区', '210100', '浑南', '3', '024', '110015', '中国,辽宁省,沈阳市,浑南区', '123.457707000000', '41.719450000000', 'Hunnan');
INSERT INTO `cf_areas` VALUES ('210113', '沈北新区', '210100', '沈北新区', '3', '024', '110121', '中国,辽宁省,沈阳市,沈北新区', '123.526580000000', '42.052970000000', 'Shenbeixinqu');
INSERT INTO `cf_areas` VALUES ('210114', '于洪区', '210100', '于洪', '3', '024', '110141', '中国,辽宁省,沈阳市,于洪区', '123.308070000000', '41.794000000000', 'Yuhong');
INSERT INTO `cf_areas` VALUES ('210122', '辽中县', '210100', '辽中', '3', '024', '110200', '中国,辽宁省,沈阳市,辽中县', '122.726590000000', '41.513020000000', 'Liaozhong');
INSERT INTO `cf_areas` VALUES ('210123', '康平县', '210100', '康平', '3', '024', '110500', '中国,辽宁省,沈阳市,康平县', '123.354460000000', '42.750810000000', 'Kangping');
INSERT INTO `cf_areas` VALUES ('210124', '法库县', '210100', '法库', '3', '024', '110400', '中国,辽宁省,沈阳市,法库县', '123.412140000000', '42.506080000000', 'Faku');
INSERT INTO `cf_areas` VALUES ('210181', '新民市', '210100', '新民', '3', '024', '110300', '中国,辽宁省,沈阳市,新民市', '122.828670000000', '41.998470000000', 'Xinmin');
INSERT INTO `cf_areas` VALUES ('210200', '大连市', '210000', '大连', '2', '0411', '116011', '中国,辽宁省,大连市', '121.618622000000', '38.914590000000', 'Dalian');
INSERT INTO `cf_areas` VALUES ('210202', '中山区', '210200', '中山', '3', '0411', '116001', '中国,辽宁省,大连市,中山区', '121.644650000000', '38.918590000000', 'Zhongshan');
INSERT INTO `cf_areas` VALUES ('210203', '西岗区', '210200', '西岗', '3', '0411', '116011', '中国,辽宁省,大连市,西岗区', '121.612380000000', '38.914690000000', 'Xigang');
INSERT INTO `cf_areas` VALUES ('210204', '沙河口区', '210200', '沙河口', '3', '0411', '116021', '中国,辽宁省,大连市,沙河口区', '121.580170000000', '38.905360000000', 'Shahekou');
INSERT INTO `cf_areas` VALUES ('210211', '甘井子区', '210200', '甘井子', '3', '0411', '116033', '中国,辽宁省,大连市,甘井子区', '121.565670000000', '38.950170000000', 'Ganjingzi');
INSERT INTO `cf_areas` VALUES ('210212', '旅顺口区', '210200', '旅顺口', '3', '0411', '116041', '中国,辽宁省,大连市,旅顺口区', '121.262020000000', '38.851250000000', 'Lvshunkou');
INSERT INTO `cf_areas` VALUES ('210213', '金州区', '210200', '金州', '3', '0411', '116100', '中国,辽宁省,大连市,金州区', '121.718930000000', '39.100400000000', 'Jinzhou');
INSERT INTO `cf_areas` VALUES ('210224', '长海县', '210200', '长海', '3', '0411', '116500', '中国,辽宁省,大连市,长海县', '122.588590000000', '39.272740000000', 'Changhai');
INSERT INTO `cf_areas` VALUES ('210281', '瓦房店市', '210200', '瓦房店', '3', '0411', '116300', '中国,辽宁省,大连市,瓦房店市', '121.981040000000', '39.628430000000', 'Wafangdian');
INSERT INTO `cf_areas` VALUES ('210282', '普兰店市', '210200', '普兰店', '3', '0411', '116200', '中国,辽宁省,大连市,普兰店市', '121.963160000000', '39.394650000000', 'Pulandian');
INSERT INTO `cf_areas` VALUES ('210283', '庄河市', '210200', '庄河', '3', '0411', '116400', '中国,辽宁省,大连市,庄河市', '122.967250000000', '39.688150000000', 'Zhuanghe');
INSERT INTO `cf_areas` VALUES ('210300', '鞍山市', '210000', '鞍山', '2', '0412', '114001', '中国,辽宁省,鞍山市', '122.995632000000', '41.110626000000', 'Anshan');
INSERT INTO `cf_areas` VALUES ('210302', '铁东区', '210300', '铁东', '3', '0412', '114001', '中国,辽宁省,鞍山市,铁东区', '122.990850000000', '41.089750000000', 'Tiedong');
INSERT INTO `cf_areas` VALUES ('210303', '铁西区', '210300', '铁西', '3', '0413', '114013', '中国,辽宁省,鞍山市,铁西区', '122.969670000000', '41.119770000000', 'Tiexi');
INSERT INTO `cf_areas` VALUES ('210304', '立山区', '210300', '立山', '3', '0414', '114031', '中国,辽宁省,鞍山市,立山区', '123.029480000000', '41.150080000000', 'Lishan');
INSERT INTO `cf_areas` VALUES ('210311', '千山区', '210300', '千山', '3', '0415', '114041', '中国,辽宁省,鞍山市,千山区', '122.960480000000', '41.075070000000', 'Qianshan');
INSERT INTO `cf_areas` VALUES ('210321', '台安县', '210300', '台安', '3', '0417', '114100', '中国,辽宁省,鞍山市,台安县', '122.435850000000', '41.412650000000', 'Tai\'an');
INSERT INTO `cf_areas` VALUES ('210323', '岫岩满族自治县', '210300', '岫岩', '3', '0418', '114300', '中国,辽宁省,鞍山市,岫岩满族自治县', '123.288750000000', '40.279960000000', 'Xiuyan');
INSERT INTO `cf_areas` VALUES ('210381', '海城市', '210300', '海城', '3', '0416', '114200', '中国,辽宁省,鞍山市,海城市', '122.684570000000', '40.881420000000', 'Haicheng');
INSERT INTO `cf_areas` VALUES ('210400', '抚顺市', '210000', '抚顺', '2', '024', '113008', '中国,辽宁省,抚顺市', '123.921109000000', '41.875956000000', 'Fushun');
INSERT INTO `cf_areas` VALUES ('210402', '新抚区', '210400', '新抚', '3', '024', '113008', '中国,辽宁省,抚顺市,新抚区', '123.912640000000', '41.862050000000', 'Xinfu');
INSERT INTO `cf_areas` VALUES ('210403', '东洲区', '210400', '东洲', '3', '024', '113003', '中国,辽宁省,抚顺市,东洲区', '124.037590000000', '41.851900000000', 'Dongzhou');
INSERT INTO `cf_areas` VALUES ('210404', '望花区', '210400', '望花', '3', '024', '113001', '中国,辽宁省,抚顺市,望花区', '123.782830000000', '41.855320000000', 'Wanghua');
INSERT INTO `cf_areas` VALUES ('210411', '顺城区', '210400', '顺城', '3', '024', '113006', '中国,辽宁省,抚顺市,顺城区', '123.945060000000', '41.883210000000', 'Shuncheng');
INSERT INTO `cf_areas` VALUES ('210421', '抚顺县', '210400', '抚顺', '3', '024', '113006', '中国,辽宁省,抚顺市,抚顺县', '124.177550000000', '41.712170000000', 'Fushun');
INSERT INTO `cf_areas` VALUES ('210422', '新宾满族自治县', '210400', '新宾', '3', '024', '113200', '中国,辽宁省,抚顺市,新宾满族自治县', '125.040490000000', '41.734090000000', 'Xinbin');
INSERT INTO `cf_areas` VALUES ('210423', '清原满族自治县', '210400', '清原', '3', '024', '113300', '中国,辽宁省,抚顺市,清原满族自治县', '124.928070000000', '42.102210000000', 'Qingyuan');
INSERT INTO `cf_areas` VALUES ('210500', '本溪市', '210000', '本溪', '2', '0414', '117000', '中国,辽宁省,本溪市', '123.770519000000', '41.297909000000', 'Benxi');
INSERT INTO `cf_areas` VALUES ('210502', '平山区', '210500', '平山', '3', '0414', '117000', '中国,辽宁省,本溪市,平山区', '123.768920000000', '41.299700000000', 'Pingshan');
INSERT INTO `cf_areas` VALUES ('210503', '溪湖区', '210500', '溪湖', '3', '0414', '117002', '中国,辽宁省,本溪市,溪湖区', '123.767640000000', '41.329210000000', 'Xihu');
INSERT INTO `cf_areas` VALUES ('210504', '明山区', '210500', '明山', '3', '0414', '117021', '中国,辽宁省,本溪市,明山区', '123.817460000000', '41.308270000000', 'Mingshan');
INSERT INTO `cf_areas` VALUES ('210505', '南芬区', '210500', '南芬', '3', '0414', '117014', '中国,辽宁省,本溪市,南芬区', '123.745230000000', '41.100600000000', 'Nanfen');
INSERT INTO `cf_areas` VALUES ('210521', '本溪满族自治县', '210500', '本溪', '3', '0414', '117100', '中国,辽宁省,本溪市,本溪满族自治县', '124.127410000000', '41.300590000000', 'Benxi');
INSERT INTO `cf_areas` VALUES ('210522', '桓仁满族自治县', '210500', '桓仁', '3', '0414', '117200', '中国,辽宁省,本溪市,桓仁满族自治县', '125.360620000000', '41.267980000000', 'Huanren');
INSERT INTO `cf_areas` VALUES ('210600', '丹东市', '210000', '丹东', '2', '0415', '118000', '中国,辽宁省,丹东市', '124.383044000000', '40.124296000000', 'Dandong');
INSERT INTO `cf_areas` VALUES ('210602', '元宝区', '210600', '元宝', '3', '0415', '118000', '中国,辽宁省,丹东市,元宝区', '124.395750000000', '40.136510000000', 'Yuanbao');
INSERT INTO `cf_areas` VALUES ('210603', '振兴区', '210600', '振兴', '3', '0415', '118002', '中国,辽宁省,丹东市,振兴区', '124.360350000000', '40.104890000000', 'Zhenxing');
INSERT INTO `cf_areas` VALUES ('210604', '振安区', '210600', '振安', '3', '0415', '118001', '中国,辽宁省,丹东市,振安区', '124.428160000000', '40.158260000000', 'Zhen\'an');
INSERT INTO `cf_areas` VALUES ('210624', '宽甸满族自治县', '210600', '宽甸', '3', '0415', '118200', '中国,辽宁省,丹东市,宽甸满族自治县', '124.782470000000', '40.731870000000', 'Kuandian');
INSERT INTO `cf_areas` VALUES ('210681', '东港市', '210600', '东港', '3', '0415', '118300', '中国,辽宁省,丹东市,东港市', '124.162870000000', '39.862560000000', 'Donggang');
INSERT INTO `cf_areas` VALUES ('210682', '凤城市', '210600', '凤城', '3', '0415', '118100', '中国,辽宁省,丹东市,凤城市', '124.066710000000', '40.453020000000', 'Fengcheng');
INSERT INTO `cf_areas` VALUES ('210700', '锦州市', '210000', '锦州', '2', '0416', '121000', '中国,辽宁省,锦州市', '121.135742000000', '41.119269000000', 'Jinzhou');
INSERT INTO `cf_areas` VALUES ('210702', '古塔区', '210700', '古塔', '3', '0416', '121001', '中国,辽宁省,锦州市,古塔区', '121.128320000000', '41.117250000000', 'Guta');
INSERT INTO `cf_areas` VALUES ('210703', '凌河区', '210700', '凌河', '3', '0416', '121000', '中国,辽宁省,锦州市,凌河区', '121.150890000000', '41.114960000000', 'Linghe');
INSERT INTO `cf_areas` VALUES ('210711', '太和区', '210700', '太和', '3', '0416', '121011', '中国,辽宁省,锦州市,太和区', '121.103540000000', '41.109290000000', 'Taihe');
INSERT INTO `cf_areas` VALUES ('210726', '黑山县', '210700', '黑山', '3', '0416', '121400', '中国,辽宁省,锦州市,黑山县', '122.120810000000', '41.694170000000', 'Heishan');
INSERT INTO `cf_areas` VALUES ('210727', '义县', '210700', '义县', '3', '0416', '121100', '中国,辽宁省,锦州市,义县', '121.240350000000', '41.534580000000', 'Yixian');
INSERT INTO `cf_areas` VALUES ('210781', '凌海市', '210700', '凌海', '3', '0416', '121200', '中国,辽宁省,锦州市,凌海市', '121.357050000000', '41.173700000000', 'Linghai');
INSERT INTO `cf_areas` VALUES ('210782', '北镇市', '210700', '北镇', '3', '0416', '121300', '中国,辽宁省,锦州市,北镇市', '121.798580000000', '41.595370000000', 'Beizhen');
INSERT INTO `cf_areas` VALUES ('210800', '营口市', '210000', '营口', '2', '0417', '115003', '中国,辽宁省,营口市', '122.235151000000', '40.667432000000', 'Yingkou');
INSERT INTO `cf_areas` VALUES ('210802', '站前区', '210800', '站前', '3', '0417', '115002', '中国,辽宁省,营口市,站前区', '122.258960000000', '40.672660000000', 'Zhanqian');
INSERT INTO `cf_areas` VALUES ('210803', '西市区', '210800', '西市', '3', '0417', '115004', '中国,辽宁省,营口市,西市区', '122.206410000000', '40.666400000000', 'Xishi');
INSERT INTO `cf_areas` VALUES ('210804', '鲅鱼圈区', '210800', '鲅鱼圈', '3', '0417', '115007', '中国,辽宁省,营口市,鲅鱼圈区', '122.132660000000', '40.268650000000', 'Bayuquan');
INSERT INTO `cf_areas` VALUES ('210811', '老边区', '210800', '老边', '3', '0417', '115005', '中国,辽宁省,营口市,老边区', '122.379960000000', '40.680300000000', 'Laobian');
INSERT INTO `cf_areas` VALUES ('210881', '盖州市', '210800', '盖州', '3', '0417', '115200', '中国,辽宁省,营口市,盖州市', '122.354640000000', '40.404460000000', 'Gaizhou');
INSERT INTO `cf_areas` VALUES ('210882', '大石桥市', '210800', '大石桥', '3', '0417', '115100', '中国,辽宁省,营口市,大石桥市', '122.509270000000', '40.645670000000', 'Dashiqiao');
INSERT INTO `cf_areas` VALUES ('210900', '阜新市', '210000', '阜新', '2', '0418', '123000', '中国,辽宁省,阜新市', '121.648962000000', '42.011796000000', 'Fuxin');
INSERT INTO `cf_areas` VALUES ('210902', '海州区', '210900', '海州', '3', '0418', '123000', '中国,辽宁省,阜新市,海州区', '121.656260000000', '42.013360000000', 'Haizhou');
INSERT INTO `cf_areas` VALUES ('210903', '新邱区', '210900', '新邱', '3', '0418', '123005', '中国,辽宁省,阜新市,新邱区', '121.792510000000', '42.091810000000', 'Xinqiu');
INSERT INTO `cf_areas` VALUES ('210904', '太平区', '210900', '太平', '3', '0418', '123003', '中国,辽宁省,阜新市,太平区', '121.678650000000', '42.010650000000', 'Taiping');
INSERT INTO `cf_areas` VALUES ('210905', '清河门区', '210900', '清河门', '3', '0418', '123006', '中国,辽宁省,阜新市,清河门区', '121.416100000000', '41.783090000000', 'Qinghemen');
INSERT INTO `cf_areas` VALUES ('210911', '细河区', '210900', '细河', '3', '0418', '123000', '中国,辽宁省,阜新市,细河区', '121.680130000000', '42.025330000000', 'Xihe');
INSERT INTO `cf_areas` VALUES ('210921', '阜新蒙古族自治县', '210900', '阜新', '3', '0418', '123100', '中国,辽宁省,阜新市,阜新蒙古族自治县', '121.757870000000', '42.065100000000', 'Fuxin');
INSERT INTO `cf_areas` VALUES ('210922', '彰武县', '210900', '彰武', '3', '0418', '123200', '中国,辽宁省,阜新市,彰武县', '122.540220000000', '42.386250000000', 'Zhangwu');
INSERT INTO `cf_areas` VALUES ('211000', '辽阳市', '210000', '辽阳', '2', '0419', '111000', '中国,辽宁省,辽阳市', '123.181520000000', '41.269402000000', 'Liaoyang');
INSERT INTO `cf_areas` VALUES ('211002', '白塔区', '211000', '白塔', '3', '0419', '111000', '中国,辽宁省,辽阳市,白塔区', '123.174700000000', '41.270250000000', 'Baita');
INSERT INTO `cf_areas` VALUES ('211003', '文圣区', '211000', '文圣', '3', '0419', '111000', '中国,辽宁省,辽阳市,文圣区', '123.185210000000', '41.262670000000', 'Wensheng');
INSERT INTO `cf_areas` VALUES ('211004', '宏伟区', '211000', '宏伟', '3', '0419', '111003', '中国,辽宁省,辽阳市,宏伟区', '123.192900000000', '41.218520000000', 'Hongwei');
INSERT INTO `cf_areas` VALUES ('211005', '弓长岭区', '211000', '弓长岭', '3', '0419', '111008', '中国,辽宁省,辽阳市,弓长岭区', '123.419630000000', '41.151810000000', 'Gongchangling');
INSERT INTO `cf_areas` VALUES ('211011', '太子河区', '211000', '太子河', '3', '0419', '111000', '中国,辽宁省,辽阳市,太子河区', '123.181820000000', '41.253370000000', 'Taizihe');
INSERT INTO `cf_areas` VALUES ('211021', '辽阳县', '211000', '辽阳', '3', '0419', '111200', '中国,辽宁省,辽阳市,辽阳县', '123.105740000000', '41.205420000000', 'Liaoyang');
INSERT INTO `cf_areas` VALUES ('211081', '灯塔市', '211000', '灯塔', '3', '0419', '111300', '中国,辽宁省,辽阳市,灯塔市', '123.339260000000', '41.426120000000', 'Dengta');
INSERT INTO `cf_areas` VALUES ('211100', '盘锦市', '210000', '盘锦', '2', '0427', '124010', '中国,辽宁省,盘锦市', '122.069570000000', '41.124484000000', 'Panjin');
INSERT INTO `cf_areas` VALUES ('211102', '双台子区', '211100', '双台子', '3', '0427', '124000', '中国,辽宁省,盘锦市,双台子区', '122.060110000000', '41.190600000000', 'Shuangtaizi');
INSERT INTO `cf_areas` VALUES ('211103', '兴隆台区', '211100', '兴隆台', '3', '0427', '124010', '中国,辽宁省,盘锦市,兴隆台区', '122.075290000000', '41.124020000000', 'Xinglongtai');
INSERT INTO `cf_areas` VALUES ('211121', '大洼县', '211100', '大洼', '3', '0427', '124200', '中国,辽宁省,盘锦市,大洼县', '122.082390000000', '41.002440000000', 'Dawa');
INSERT INTO `cf_areas` VALUES ('211122', '盘山县', '211100', '盘山', '3', '0427', '124000', '中国,辽宁省,盘锦市,盘山县', '121.997770000000', '41.238050000000', 'Panshan');
INSERT INTO `cf_areas` VALUES ('211200', '铁岭市', '210000', '铁岭', '2', '024', '112000', '中国,辽宁省,铁岭市', '123.844279000000', '42.290585000000', 'Tieling');
INSERT INTO `cf_areas` VALUES ('211202', '银州区', '211200', '银州', '3', '024', '112000', '中国,辽宁省,铁岭市,银州区', '123.857300000000', '42.295070000000', 'Yinzhou');
INSERT INTO `cf_areas` VALUES ('211204', '清河区', '211200', '清河', '3', '024', '112003', '中国,辽宁省,铁岭市,清河区', '124.159110000000', '42.546790000000', 'Qinghe');
INSERT INTO `cf_areas` VALUES ('211221', '铁岭县', '211200', '铁岭', '3', '024', '112000', '中国,辽宁省,铁岭市,铁岭县', '123.773250000000', '42.224980000000', 'Tieling');
INSERT INTO `cf_areas` VALUES ('211223', '西丰县', '211200', '西丰', '3', '024', '112400', '中国,辽宁省,铁岭市,西丰县', '124.730400000000', '42.737560000000', 'Xifeng');
INSERT INTO `cf_areas` VALUES ('211224', '昌图县', '211200', '昌图', '3', '024', '112500', '中国,辽宁省,铁岭市,昌图县', '124.112060000000', '42.784280000000', 'Changtu');
INSERT INTO `cf_areas` VALUES ('211281', '调兵山市', '211200', '调兵山', '3', '024', '112700', '中国,辽宁省,铁岭市,调兵山市', '123.566890000000', '42.467500000000', 'Diaobingshan');
INSERT INTO `cf_areas` VALUES ('211282', '开原市', '211200', '开原', '3', '024', '112300', '中国,辽宁省,铁岭市,开原市', '124.039450000000', '42.545850000000', 'Kaiyuan');
INSERT INTO `cf_areas` VALUES ('211300', '朝阳市', '210000', '朝阳', '2', '0421', '122000', '中国,辽宁省,朝阳市', '120.451176000000', '41.576758000000', 'Chaoyang');
INSERT INTO `cf_areas` VALUES ('211302', '双塔区', '211300', '双塔', '3', '0421', '122000', '中国,辽宁省,朝阳市,双塔区', '120.453850000000', '41.566000000000', 'Shuangta');
INSERT INTO `cf_areas` VALUES ('211303', '龙城区', '211300', '龙城', '3', '0421', '122000', '中国,辽宁省,朝阳市,龙城区', '120.437190000000', '41.592640000000', 'Longcheng');
INSERT INTO `cf_areas` VALUES ('211321', '朝阳县', '211300', '朝阳', '3', '0421', '122000', '中国,辽宁省,朝阳市,朝阳县', '120.174010000000', '41.432400000000', 'Chaoyang');
INSERT INTO `cf_areas` VALUES ('211322', '建平县', '211300', '建平', '3', '0421', '122400', '中国,辽宁省,朝阳市,建平县', '119.643920000000', '41.403150000000', 'Jianping');
INSERT INTO `cf_areas` VALUES ('211324', '喀喇沁左翼蒙古族自治县', '211300', '喀喇沁左翼', '3', '0421', '122300', '中国,辽宁省,朝阳市,喀喇沁左翼蒙古族自治县', '119.741850000000', '41.128010000000', 'Kalaqinzuoyi');
INSERT INTO `cf_areas` VALUES ('211381', '北票市', '211300', '北票', '3', '0421', '122100', '中国,辽宁省,朝阳市,北票市', '120.769770000000', '41.801960000000', 'Beipiao');
INSERT INTO `cf_areas` VALUES ('211382', '凌源市', '211300', '凌源', '3', '0421', '122500', '中国,辽宁省,朝阳市,凌源市', '119.401480000000', '41.245580000000', 'Lingyuan');
INSERT INTO `cf_areas` VALUES ('211400', '葫芦岛市', '210000', '葫芦岛', '2', '0429', '125000', '中国,辽宁省,葫芦岛市', '120.856394000000', '40.755572000000', 'Huludao');
INSERT INTO `cf_areas` VALUES ('211402', '连山区', '211400', '连山', '3', '0429', '125001', '中国,辽宁省,葫芦岛市,连山区', '120.863930000000', '40.755540000000', 'Lianshan');
INSERT INTO `cf_areas` VALUES ('211403', '龙港区', '211400', '龙港', '3', '0429', '125003', '中国,辽宁省,葫芦岛市,龙港区', '120.948660000000', '40.719190000000', 'Longgang');
INSERT INTO `cf_areas` VALUES ('211404', '南票区', '211400', '南票', '3', '0429', '125027', '中国,辽宁省,葫芦岛市,南票区', '120.749780000000', '41.107070000000', 'Nanpiao');
INSERT INTO `cf_areas` VALUES ('211421', '绥中县', '211400', '绥中', '3', '0429', '125200', '中国,辽宁省,葫芦岛市,绥中县', '120.344510000000', '40.325520000000', 'Suizhong');
INSERT INTO `cf_areas` VALUES ('211422', '建昌县', '211400', '建昌', '3', '0429', '125300', '中国,辽宁省,葫芦岛市,建昌县', '119.837700000000', '40.824480000000', 'Jianchang');
INSERT INTO `cf_areas` VALUES ('211481', '兴城市', '211400', '兴城', '3', '0429', '125100', '中国,辽宁省,葫芦岛市,兴城市', '120.725370000000', '40.614920000000', 'Xingcheng');
INSERT INTO `cf_areas` VALUES ('211500', '金普新区', '210000', '金普新区', '2', '0411', '116100', '中国,辽宁省,金普新区', '121.789627000000', '39.055451000000', 'Jinpuxinqu');
INSERT INTO `cf_areas` VALUES ('211501', '金州新区', '211500', '金州新区', '3', '0411', '116100', '中国,辽宁省,金普新区,金州新区', '121.784821000000', '39.052252000000', 'Jinzhouxinqu');
INSERT INTO `cf_areas` VALUES ('211502', '普湾新区', '211500', '普湾新区', '3', '0411', '116200', '中国,辽宁省,金普新区,普湾新区', '121.812812000000', '39.330093000000', 'Puwanxinqu');
INSERT INTO `cf_areas` VALUES ('211503', '保税区', '211500', '保税区', '3', '0411', '116100', '中国,辽宁省,金普新区,保税区', '121.942890000000', '39.224614000000', 'Baoshuiqu');
INSERT INTO `cf_areas` VALUES ('220000', '吉林省', '100000', '吉林', '1', '', '', '中国,吉林省', '125.324500000000', '43.886841000000', 'Jilin');
INSERT INTO `cf_areas` VALUES ('220100', '长春市', '220000', '长春', '2', '0431', '130022', '中国,吉林省,长春市', '125.324500000000', '43.886841000000', 'Changchun');
INSERT INTO `cf_areas` VALUES ('220102', '南关区', '220100', '南关', '3', '0431', '130022', '中国,吉林省,长春市,南关区', '125.350350000000', '43.864010000000', 'Nanguan');
INSERT INTO `cf_areas` VALUES ('220103', '宽城区', '220100', '宽城', '3', '0431', '130051', '中国,吉林省,长春市,宽城区', '125.326350000000', '43.901820000000', 'Kuancheng');
INSERT INTO `cf_areas` VALUES ('220104', '朝阳区', '220100', '朝阳', '3', '0431', '130012', '中国,吉林省,长春市,朝阳区', '125.288300000000', '43.833390000000', 'Chaoyang');
INSERT INTO `cf_areas` VALUES ('220105', '二道区', '220100', '二道', '3', '0431', '130031', '中国,吉林省,长春市,二道区', '125.374290000000', '43.865010000000', 'Erdao');
INSERT INTO `cf_areas` VALUES ('220106', '绿园区', '220100', '绿园', '3', '0431', '130062', '中国,吉林省,长春市,绿园区', '125.255820000000', '43.880450000000', 'Lvyuan');
INSERT INTO `cf_areas` VALUES ('220112', '双阳区', '220100', '双阳', '3', '0431', '130600', '中国,吉林省,长春市,双阳区', '125.656310000000', '43.528030000000', 'Shuangyang');
INSERT INTO `cf_areas` VALUES ('220113', '九台区', '220100', '九台', '3', '0431', '130500', '中国,吉林省,长春市,九台区', '125.839500000000', '44.151630000000', 'Jiutai');
INSERT INTO `cf_areas` VALUES ('220122', '农安县', '220100', '农安', '3', '0431', '130200', '中国,吉林省,长春市,农安县', '125.184810000000', '44.432650000000', 'Nong\'an');
INSERT INTO `cf_areas` VALUES ('220182', '榆树市', '220100', '榆树', '3', '0431', '130400', '中国,吉林省,长春市,榆树市', '126.556880000000', '44.825230000000', 'Yushu');
INSERT INTO `cf_areas` VALUES ('220183', '德惠市', '220100', '德惠', '3', '0431', '130300', '中国,吉林省,长春市,德惠市', '125.705380000000', '44.537190000000', 'Dehui');
INSERT INTO `cf_areas` VALUES ('220200', '吉林市', '220000', '吉林', '2', '0432', '132011', '中国,吉林省,吉林市', '126.553020000000', '43.843577000000', 'Jilin');
INSERT INTO `cf_areas` VALUES ('220202', '昌邑区', '220200', '昌邑', '3', '0432', '132002', '中国,吉林省,吉林市,昌邑区', '126.574240000000', '43.881830000000', 'Changyi');
INSERT INTO `cf_areas` VALUES ('220203', '龙潭区', '220200', '龙潭', '3', '0432', '132021', '中国,吉林省,吉林市,龙潭区', '126.562130000000', '43.910540000000', 'Longtan');
INSERT INTO `cf_areas` VALUES ('220204', '船营区', '220200', '船营', '3', '0432', '132011', '中国,吉林省,吉林市,船营区', '126.540960000000', '43.833440000000', 'Chuanying');
INSERT INTO `cf_areas` VALUES ('220211', '丰满区', '220200', '丰满', '3', '0432', '132013', '中国,吉林省,吉林市,丰满区', '126.562370000000', '43.822360000000', 'Fengman');
INSERT INTO `cf_areas` VALUES ('220221', '永吉县', '220200', '永吉', '3', '0432', '132200', '中国,吉林省,吉林市,永吉县', '126.496300000000', '43.671970000000', 'Yongji');
INSERT INTO `cf_areas` VALUES ('220281', '蛟河市', '220200', '蛟河', '3', '0432', '132500', '中国,吉林省,吉林市,蛟河市', '127.344260000000', '43.726960000000', 'Jiaohe');
INSERT INTO `cf_areas` VALUES ('220282', '桦甸市', '220200', '桦甸', '3', '0432', '132400', '中国,吉林省,吉林市,桦甸市', '126.746240000000', '42.972060000000', 'Huadian');
INSERT INTO `cf_areas` VALUES ('220283', '舒兰市', '220200', '舒兰', '3', '0432', '132600', '中国,吉林省,吉林市,舒兰市', '126.965300000000', '44.405820000000', 'Shulan');
INSERT INTO `cf_areas` VALUES ('220284', '磐石市', '220200', '磐石', '3', '0432', '132300', '中国,吉林省,吉林市,磐石市', '126.062500000000', '42.946280000000', 'Panshi');
INSERT INTO `cf_areas` VALUES ('220300', '四平市', '220000', '四平', '2', '0434', '136000', '中国,吉林省,四平市', '124.370785000000', '43.170344000000', 'Siping');
INSERT INTO `cf_areas` VALUES ('220302', '铁西区', '220300', '铁西', '3', '0434', '136000', '中国,吉林省,四平市,铁西区', '124.373690000000', '43.174560000000', 'Tiexi');
INSERT INTO `cf_areas` VALUES ('220303', '铁东区', '220300', '铁东', '3', '0434', '136001', '中国,吉林省,四平市,铁东区', '124.409760000000', '43.162410000000', 'Tiedong');
INSERT INTO `cf_areas` VALUES ('220322', '梨树县', '220300', '梨树', '3', '0434', '136500', '中国,吉林省,四平市,梨树县', '124.335630000000', '43.307170000000', 'Lishu');
INSERT INTO `cf_areas` VALUES ('220323', '伊通满族自治县', '220300', '伊通', '3', '0434', '130700', '中国,吉林省,四平市,伊通满族自治县', '125.305960000000', '43.344340000000', 'Yitong');
INSERT INTO `cf_areas` VALUES ('220381', '公主岭市', '220300', '公主岭', '3', '0434', '136100', '中国,吉林省,四平市,公主岭市', '124.822660000000', '43.504530000000', 'Gongzhuling');
INSERT INTO `cf_areas` VALUES ('220382', '双辽市', '220300', '双辽', '3', '0434', '136400', '中国,吉林省,四平市,双辽市', '123.501060000000', '43.520990000000', 'Shuangliao');
INSERT INTO `cf_areas` VALUES ('220400', '辽源市', '220000', '辽源', '2', '0437', '136200', '中国,吉林省,辽源市', '125.145349000000', '42.902692000000', 'Liaoyuan');
INSERT INTO `cf_areas` VALUES ('220402', '龙山区', '220400', '龙山', '3', '0437', '136200', '中国,吉林省,辽源市,龙山区', '125.136410000000', '42.897140000000', 'Longshan');
INSERT INTO `cf_areas` VALUES ('220403', '西安区', '220400', '西安', '3', '0437', '136201', '中国,吉林省,辽源市,西安区', '125.149040000000', '42.927000000000', 'Xi\'an');
INSERT INTO `cf_areas` VALUES ('220421', '东丰县', '220400', '东丰', '3', '0437', '136300', '中国,吉林省,辽源市,东丰县', '125.532440000000', '42.678300000000', 'Dongfeng');
INSERT INTO `cf_areas` VALUES ('220422', '东辽县', '220400', '东辽', '3', '0437', '136600', '中国,吉林省,辽源市,东辽县', '124.985960000000', '42.924920000000', 'Dongliao');
INSERT INTO `cf_areas` VALUES ('220500', '通化市', '220000', '通化', '2', '0435', '134001', '中国,吉林省,通化市', '125.936501000000', '41.721177000000', 'Tonghua');
INSERT INTO `cf_areas` VALUES ('220502', '东昌区', '220500', '东昌', '3', '0435', '134001', '中国,吉林省,通化市,东昌区', '125.955100000000', '41.728490000000', 'Dongchang');
INSERT INTO `cf_areas` VALUES ('220503', '二道江区', '220500', '二道江', '3', '0435', '134003', '中国,吉林省,通化市,二道江区', '126.042570000000', '41.774100000000', 'Erdaojiang');
INSERT INTO `cf_areas` VALUES ('220521', '通化县', '220500', '通化', '3', '0435', '134100', '中国,吉林省,通化市,通化县', '125.759360000000', '41.679280000000', 'Tonghua');
INSERT INTO `cf_areas` VALUES ('220523', '辉南县', '220500', '辉南', '3', '0435', '135100', '中国,吉林省,通化市,辉南县', '126.046840000000', '42.684970000000', 'Huinan');
INSERT INTO `cf_areas` VALUES ('220524', '柳河县', '220500', '柳河', '3', '0435', '135300', '中国,吉林省,通化市,柳河县', '125.744750000000', '42.284680000000', 'Liuhe');
INSERT INTO `cf_areas` VALUES ('220581', '梅河口市', '220500', '梅河口', '3', '0435', '135000', '中国,吉林省,通化市,梅河口市', '125.710410000000', '42.538280000000', 'Meihekou');
INSERT INTO `cf_areas` VALUES ('220582', '集安市', '220500', '集安', '3', '0435', '134200', '中国,吉林省,通化市,集安市', '126.188290000000', '41.122680000000', 'Ji\'an');
INSERT INTO `cf_areas` VALUES ('220600', '白山市', '220000', '白山', '2', '0439', '134300', '中国,吉林省,白山市', '126.427839000000', '41.942505000000', 'Baishan');
INSERT INTO `cf_areas` VALUES ('220602', '浑江区', '220600', '浑江', '3', '0439', '134300', '中国,吉林省,白山市,浑江区', '126.422342000000', '41.945656000000', 'Hunjiang');
INSERT INTO `cf_areas` VALUES ('220605', '江源区', '220600', '江源', '3', '0439', '134700', '中国,吉林省,白山市,江源区', '126.590790000000', '42.056640000000', 'Jiangyuan');
INSERT INTO `cf_areas` VALUES ('220621', '抚松县', '220600', '抚松', '3', '0439', '134500', '中国,吉林省,白山市,抚松县', '127.280300000000', '42.341980000000', 'Fusong');
INSERT INTO `cf_areas` VALUES ('220622', '靖宇县', '220600', '靖宇', '3', '0439', '135200', '中国,吉林省,白山市,靖宇县', '126.813080000000', '42.388630000000', 'Jingyu');
INSERT INTO `cf_areas` VALUES ('220623', '长白朝鲜族自治县', '220600', '长白', '3', '0439', '134400', '中国,吉林省,白山市,长白朝鲜族自治县', '128.200470000000', '41.419960000000', 'Changbai');
INSERT INTO `cf_areas` VALUES ('220681', '临江市', '220600', '临江', '3', '0439', '134600', '中国,吉林省,白山市,临江市', '126.917510000000', '41.811420000000', 'Linjiang');
INSERT INTO `cf_areas` VALUES ('220700', '松原市', '220000', '松原', '2', '0438', '138000', '中国,吉林省,松原市', '124.823608000000', '45.118243000000', 'Songyuan');
INSERT INTO `cf_areas` VALUES ('220702', '宁江区', '220700', '宁江', '3', '0438', '138000', '中国,吉林省,松原市,宁江区', '124.816890000000', '45.171750000000', 'Ningjiang');
INSERT INTO `cf_areas` VALUES ('220721', '前郭尔罗斯蒙古族自治县', '220700', '前郭尔罗斯', '3', '0438', '138000', '中国,吉林省,松原市,前郭尔罗斯蒙古族自治县', '124.823510000000', '45.117260000000', 'Qianguoerluosi');
INSERT INTO `cf_areas` VALUES ('220722', '长岭县', '220700', '长岭', '3', '0438', '131500', '中国,吉林省,松原市,长岭县', '123.967250000000', '44.275810000000', 'Changling');
INSERT INTO `cf_areas` VALUES ('220723', '乾安县', '220700', '乾安', '3', '0438', '131400', '中国,吉林省,松原市,乾安县', '124.027370000000', '45.010680000000', 'Qian\'an');
INSERT INTO `cf_areas` VALUES ('220781', '扶余市', '220700', '扶余', '3', '0438', '131200', '中国,吉林省,松原市,扶余市', '126.042758000000', '44.986199000000', 'Fuyu');
INSERT INTO `cf_areas` VALUES ('220800', '白城市', '220000', '白城', '2', '0436', '137000', '中国,吉林省,白城市', '122.841114000000', '45.619026000000', 'Baicheng');
INSERT INTO `cf_areas` VALUES ('220802', '洮北区', '220800', '洮北', '3', '0436', '137000', '中国,吉林省,白城市,洮北区', '122.851040000000', '45.621670000000', 'Taobei');
INSERT INTO `cf_areas` VALUES ('220821', '镇赉县', '220800', '镇赉', '3', '0436', '137300', '中国,吉林省,白城市,镇赉县', '123.199240000000', '45.847790000000', 'Zhenlai');
INSERT INTO `cf_areas` VALUES ('220822', '通榆县', '220800', '通榆', '3', '0436', '137200', '中国,吉林省,白城市,通榆县', '123.087610000000', '44.813880000000', 'Tongyu');
INSERT INTO `cf_areas` VALUES ('220881', '洮南市', '220800', '洮南', '3', '0436', '137100', '中国,吉林省,白城市,洮南市', '122.787720000000', '45.335020000000', 'Taonan');
INSERT INTO `cf_areas` VALUES ('220882', '大安市', '220800', '大安', '3', '0436', '131300', '中国,吉林省,白城市,大安市', '124.295190000000', '45.508460000000', 'Da\'an');
INSERT INTO `cf_areas` VALUES ('222400', '延边朝鲜族自治州', '220000', '延边', '2', '0433', '133000', '中国,吉林省,延边朝鲜族自治州', '129.513228000000', '42.904823000000', 'Yanbian');
INSERT INTO `cf_areas` VALUES ('222401', '延吉市', '222400', '延吉', '3', '0433', '133000', '中国,吉林省,延边朝鲜族自治州,延吉市', '129.513570000000', '42.906820000000', 'Yanji');
INSERT INTO `cf_areas` VALUES ('222402', '图们市', '222400', '图们', '3', '0433', '133100', '中国,吉林省,延边朝鲜族自治州,图们市', '129.843810000000', '42.968010000000', 'Tumen');
INSERT INTO `cf_areas` VALUES ('222403', '敦化市', '222400', '敦化', '3', '0433', '133700', '中国,吉林省,延边朝鲜族自治州,敦化市', '128.232420000000', '43.373040000000', 'Dunhua');
INSERT INTO `cf_areas` VALUES ('222404', '珲春市', '222400', '珲春', '3', '0433', '133300', '中国,吉林省,延边朝鲜族自治州,珲春市', '130.365720000000', '42.862420000000', 'Hunchun');
INSERT INTO `cf_areas` VALUES ('222405', '龙井市', '222400', '龙井', '3', '0433', '133400', '中国,吉林省,延边朝鲜族自治州,龙井市', '129.425840000000', '42.768040000000', 'Longjing');
INSERT INTO `cf_areas` VALUES ('222406', '和龙市', '222400', '和龙', '3', '0433', '133500', '中国,吉林省,延边朝鲜族自治州,和龙市', '129.010770000000', '42.546400000000', 'Helong');
INSERT INTO `cf_areas` VALUES ('222424', '汪清县', '222400', '汪清', '3', '0433', '133200', '中国,吉林省,延边朝鲜族自治州,汪清县', '129.771210000000', '43.312780000000', 'Wangqing');
INSERT INTO `cf_areas` VALUES ('222426', '安图县', '222400', '安图', '3', '0433', '133600', '中国,吉林省,延边朝鲜族自治州,安图县', '128.906250000000', '43.115330000000', 'Antu');
INSERT INTO `cf_areas` VALUES ('230000', '黑龙江省', '100000', '黑龙江', '1', '', '', '中国,黑龙江省', '126.642464000000', '45.756967000000', 'Heilongjiang');
INSERT INTO `cf_areas` VALUES ('230100', '哈尔滨市', '230000', '哈尔滨', '2', '0451', '150010', '中国,黑龙江省,哈尔滨市', '126.642464000000', '45.756967000000', 'Harbin');
INSERT INTO `cf_areas` VALUES ('230102', '道里区', '230100', '道里', '3', '0451', '150010', '中国,黑龙江省,哈尔滨市,道里区', '126.617050000000', '45.755860000000', 'Daoli');
INSERT INTO `cf_areas` VALUES ('230103', '南岗区', '230100', '南岗', '3', '0451', '150006', '中国,黑龙江省,哈尔滨市,南岗区', '126.668540000000', '45.759960000000', 'Nangang');
INSERT INTO `cf_areas` VALUES ('230104', '道外区', '230100', '道外', '3', '0451', '150020', '中国,黑龙江省,哈尔滨市,道外区', '126.649380000000', '45.791870000000', 'Daowai');
INSERT INTO `cf_areas` VALUES ('230108', '平房区', '230100', '平房', '3', '0451', '150060', '中国,黑龙江省,哈尔滨市,平房区', '126.637290000000', '45.597770000000', 'Pingfang');
INSERT INTO `cf_areas` VALUES ('230109', '松北区', '230100', '松北', '3', '0451', '150028', '中国,黑龙江省,哈尔滨市,松北区', '126.562760000000', '45.808310000000', 'Songbei');
INSERT INTO `cf_areas` VALUES ('230110', '香坊区', '230100', '香坊', '3', '0451', '150036', '中国,黑龙江省,哈尔滨市,香坊区', '126.679680000000', '45.723830000000', 'Xiangfang');
INSERT INTO `cf_areas` VALUES ('230111', '呼兰区', '230100', '呼兰', '3', '0451', '150500', '中国,黑龙江省,哈尔滨市,呼兰区', '126.587920000000', '45.888950000000', 'Hulan');
INSERT INTO `cf_areas` VALUES ('230112', '阿城区', '230100', '阿城', '3', '0451', '150300', '中国,黑龙江省,哈尔滨市,阿城区', '126.975250000000', '45.541440000000', 'A\'cheng');
INSERT INTO `cf_areas` VALUES ('230113', '双城区', '230100', '双城', '3', '0451', '150100', '中国,黑龙江省,哈尔滨市,双城区', '126.308784000000', '45.377942000000', 'Shuangcheng');
INSERT INTO `cf_areas` VALUES ('230123', '依兰县', '230100', '依兰', '3', '0451', '154800', '中国,黑龙江省,哈尔滨市,依兰县', '129.568170000000', '46.324700000000', 'Yilan');
INSERT INTO `cf_areas` VALUES ('230124', '方正县', '230100', '方正', '3', '0451', '150800', '中国,黑龙江省,哈尔滨市,方正县', '128.829520000000', '45.851620000000', 'Fangzheng');
INSERT INTO `cf_areas` VALUES ('230125', '宾县', '230100', '宾县', '3', '0451', '150400', '中国,黑龙江省,哈尔滨市,宾县', '127.486750000000', '45.755040000000', 'Binxian');
INSERT INTO `cf_areas` VALUES ('230126', '巴彦县', '230100', '巴彦', '3', '0451', '151800', '中国,黑龙江省,哈尔滨市,巴彦县', '127.407990000000', '46.081480000000', 'Bayan');
INSERT INTO `cf_areas` VALUES ('230127', '木兰县', '230100', '木兰', '3', '0451', '151900', '中国,黑龙江省,哈尔滨市,木兰县', '128.044800000000', '45.949440000000', 'Mulan');
INSERT INTO `cf_areas` VALUES ('230128', '通河县', '230100', '通河', '3', '0451', '150900', '中国,黑龙江省,哈尔滨市,通河县', '128.746030000000', '45.990070000000', 'Tonghe');
INSERT INTO `cf_areas` VALUES ('230129', '延寿县', '230100', '延寿', '3', '0451', '150700', '中国,黑龙江省,哈尔滨市,延寿县', '128.334190000000', '45.455400000000', 'Yanshou');
INSERT INTO `cf_areas` VALUES ('230183', '尚志市', '230100', '尚志', '3', '0451', '150600', '中国,黑龙江省,哈尔滨市,尚志市', '127.961910000000', '45.217360000000', 'Shangzhi');
INSERT INTO `cf_areas` VALUES ('230184', '五常市', '230100', '五常', '3', '0451', '150200', '中国,黑龙江省,哈尔滨市,五常市', '127.167510000000', '44.931840000000', 'Wuchang');
INSERT INTO `cf_areas` VALUES ('230200', '齐齐哈尔市', '230000', '齐齐哈尔', '2', '0452', '161005', '中国,黑龙江省,齐齐哈尔市', '123.953486000000', '47.348079000000', 'Qiqihar');
INSERT INTO `cf_areas` VALUES ('230202', '龙沙区', '230200', '龙沙', '3', '0452', '161000', '中国,黑龙江省,齐齐哈尔市,龙沙区', '123.957520000000', '47.317760000000', 'Longsha');
INSERT INTO `cf_areas` VALUES ('230203', '建华区', '230200', '建华', '3', '0452', '161006', '中国,黑龙江省,齐齐哈尔市,建华区', '124.013300000000', '47.367180000000', 'Jianhua');
INSERT INTO `cf_areas` VALUES ('230204', '铁锋区', '230200', '铁锋', '3', '0452', '161000', '中国,黑龙江省,齐齐哈尔市,铁锋区', '123.978210000000', '47.340750000000', 'Tiefeng');
INSERT INTO `cf_areas` VALUES ('230205', '昂昂溪区', '230200', '昂昂溪', '3', '0452', '161031', '中国,黑龙江省,齐齐哈尔市,昂昂溪区', '123.822290000000', '47.155130000000', 'Angangxi');
INSERT INTO `cf_areas` VALUES ('230206', '富拉尔基区', '230200', '富拉尔基', '3', '0452', '161041', '中国,黑龙江省,齐齐哈尔市,富拉尔基区', '123.629180000000', '47.208840000000', 'Fulaerji');
INSERT INTO `cf_areas` VALUES ('230207', '碾子山区', '230200', '碾子山', '3', '0452', '161046', '中国,黑龙江省,齐齐哈尔市,碾子山区', '122.881830000000', '47.516620000000', 'Nianzishan');
INSERT INTO `cf_areas` VALUES ('230208', '梅里斯达斡尔族区', '230200', '梅里斯', '3', '0452', '161021', '中国,黑龙江省,齐齐哈尔市,梅里斯达斡尔族区', '123.752740000000', '47.309460000000', 'Meilisi');
INSERT INTO `cf_areas` VALUES ('230221', '龙江县', '230200', '龙江', '3', '0452', '161100', '中国,黑龙江省,齐齐哈尔市,龙江县', '123.205320000000', '47.338680000000', 'Longjiang');
INSERT INTO `cf_areas` VALUES ('230223', '依安县', '230200', '依安', '3', '0452', '161500', '中国,黑龙江省,齐齐哈尔市,依安县', '125.308960000000', '47.893100000000', 'Yi\'an');
INSERT INTO `cf_areas` VALUES ('230224', '泰来县', '230200', '泰来', '3', '0452', '162400', '中国,黑龙江省,齐齐哈尔市,泰来县', '123.422850000000', '46.393860000000', 'Tailai');
INSERT INTO `cf_areas` VALUES ('230225', '甘南县', '230200', '甘南', '3', '0452', '162100', '中国,黑龙江省,齐齐哈尔市,甘南县', '123.503170000000', '47.924370000000', 'Gannan');
INSERT INTO `cf_areas` VALUES ('230227', '富裕县', '230200', '富裕', '3', '0452', '161200', '中国,黑龙江省,齐齐哈尔市,富裕县', '124.474570000000', '47.774310000000', 'Fuyu');
INSERT INTO `cf_areas` VALUES ('230229', '克山县', '230200', '克山', '3', '0452', '161600', '中国,黑龙江省,齐齐哈尔市,克山县', '125.873960000000', '48.032650000000', 'Keshan');
INSERT INTO `cf_areas` VALUES ('230230', '克东县', '230200', '克东', '3', '0452', '164800', '中国,黑龙江省,齐齐哈尔市,克东县', '126.249170000000', '48.038280000000', 'Kedong');
INSERT INTO `cf_areas` VALUES ('230231', '拜泉县', '230200', '拜泉', '3', '0452', '164700', '中国,黑龙江省,齐齐哈尔市,拜泉县', '126.091670000000', '47.608170000000', 'Baiquan');
INSERT INTO `cf_areas` VALUES ('230281', '讷河市', '230200', '讷河', '3', '0452', '161300', '中国,黑龙江省,齐齐哈尔市,讷河市', '124.877130000000', '48.483880000000', 'Nehe');
INSERT INTO `cf_areas` VALUES ('230300', '鸡西市', '230000', '鸡西', '2', '0467', '158100', '中国,黑龙江省,鸡西市', '130.975966000000', '45.300046000000', 'Jixi');
INSERT INTO `cf_areas` VALUES ('230302', '鸡冠区', '230300', '鸡冠', '3', '0467', '158100', '中国,黑龙江省,鸡西市,鸡冠区', '130.981390000000', '45.303960000000', 'Jiguan');
INSERT INTO `cf_areas` VALUES ('230303', '恒山区', '230300', '恒山', '3', '0467', '158130', '中国,黑龙江省,鸡西市,恒山区', '130.904930000000', '45.210710000000', 'Hengshan');
INSERT INTO `cf_areas` VALUES ('230304', '滴道区', '230300', '滴道', '3', '0467', '158150', '中国,黑龙江省,鸡西市,滴道区', '130.848410000000', '45.351090000000', 'Didao');
INSERT INTO `cf_areas` VALUES ('230305', '梨树区', '230300', '梨树', '3', '0467', '158160', '中国,黑龙江省,鸡西市,梨树区', '130.698480000000', '45.090370000000', 'Lishu');
INSERT INTO `cf_areas` VALUES ('230306', '城子河区', '230300', '城子河', '3', '0467', '158170', '中国,黑龙江省,鸡西市,城子河区', '131.011320000000', '45.336890000000', 'Chengzihe');
INSERT INTO `cf_areas` VALUES ('230307', '麻山区', '230300', '麻山', '3', '0467', '158180', '中国,黑龙江省,鸡西市,麻山区', '130.478110000000', '45.212090000000', 'Mashan');
INSERT INTO `cf_areas` VALUES ('230321', '鸡东县', '230300', '鸡东', '3', '0467', '158200', '中国,黑龙江省,鸡西市,鸡东县', '131.124230000000', '45.260250000000', 'Jidong');
INSERT INTO `cf_areas` VALUES ('230381', '虎林市', '230300', '虎林', '3', '0467', '158400', '中国,黑龙江省,鸡西市,虎林市', '132.936790000000', '45.762910000000', 'Hulin');
INSERT INTO `cf_areas` VALUES ('230382', '密山市', '230300', '密山', '3', '0467', '158300', '中国,黑龙江省,鸡西市,密山市', '131.846250000000', '45.529700000000', 'Mishan');
INSERT INTO `cf_areas` VALUES ('230400', '鹤岗市', '230000', '鹤岗', '2', '0468', '154100', '中国,黑龙江省,鹤岗市', '130.277487000000', '47.332085000000', 'Hegang');
INSERT INTO `cf_areas` VALUES ('230402', '向阳区', '230400', '向阳', '3', '0468', '154100', '中国,黑龙江省,鹤岗市,向阳区', '130.294300000000', '47.342470000000', 'Xiangyang');
INSERT INTO `cf_areas` VALUES ('230403', '工农区', '230400', '工农', '3', '0468', '154101', '中国,黑龙江省,鹤岗市,工农区', '130.274680000000', '47.318690000000', 'Gongnong');
INSERT INTO `cf_areas` VALUES ('230404', '南山区', '230400', '南山', '3', '0468', '154104', '中国,黑龙江省,鹤岗市,南山区', '130.276760000000', '47.314040000000', 'Nanshan');
INSERT INTO `cf_areas` VALUES ('230405', '兴安区', '230400', '兴安', '3', '0468', '154102', '中国,黑龙江省,鹤岗市,兴安区', '130.239650000000', '47.252600000000', 'Xing\'an');
INSERT INTO `cf_areas` VALUES ('230406', '东山区', '230400', '东山', '3', '0468', '154106', '中国,黑龙江省,鹤岗市,东山区', '130.317060000000', '47.338530000000', 'Dongshan');
INSERT INTO `cf_areas` VALUES ('230407', '兴山区', '230400', '兴山', '3', '0468', '154105', '中国,黑龙江省,鹤岗市,兴山区', '130.292710000000', '47.357760000000', 'Xingshan');
INSERT INTO `cf_areas` VALUES ('230421', '萝北县', '230400', '萝北', '3', '0468', '154200', '中国,黑龙江省,鹤岗市,萝北县', '130.833460000000', '47.579590000000', 'Luobei');
INSERT INTO `cf_areas` VALUES ('230422', '绥滨县', '230400', '绥滨', '3', '0468', '156200', '中国,黑龙江省,鹤岗市,绥滨县', '131.860290000000', '47.290300000000', 'Suibin');
INSERT INTO `cf_areas` VALUES ('230500', '双鸭山市', '230000', '双鸭山', '2', '0469', '155100', '中国,黑龙江省,双鸭山市', '131.157304000000', '46.643442000000', 'Shuangyashan');
INSERT INTO `cf_areas` VALUES ('230502', '尖山区', '230500', '尖山', '3', '0469', '155100', '中国,黑龙江省,双鸭山市,尖山区', '131.158410000000', '46.646350000000', 'Jianshan');
INSERT INTO `cf_areas` VALUES ('230503', '岭东区', '230500', '岭东', '3', '0469', '155120', '中国,黑龙江省,双鸭山市,岭东区', '131.164730000000', '46.590430000000', 'Lingdong');
INSERT INTO `cf_areas` VALUES ('230505', '四方台区', '230500', '四方台', '3', '0469', '155130', '中国,黑龙江省,双鸭山市,四方台区', '131.335930000000', '46.594990000000', 'Sifangtai');
INSERT INTO `cf_areas` VALUES ('230506', '宝山区', '230500', '宝山', '3', '0469', '155131', '中国,黑龙江省,双鸭山市,宝山区', '131.401600000000', '46.577180000000', 'Baoshan');
INSERT INTO `cf_areas` VALUES ('230521', '集贤县', '230500', '集贤', '3', '0469', '155900', '中国,黑龙江省,双鸭山市,集贤县', '131.140530000000', '46.726780000000', 'Jixian');
INSERT INTO `cf_areas` VALUES ('230522', '友谊县', '230500', '友谊', '3', '0469', '155800', '中国,黑龙江省,双鸭山市,友谊县', '131.807890000000', '46.767390000000', 'Youyi');
INSERT INTO `cf_areas` VALUES ('230523', '宝清县', '230500', '宝清', '3', '0469', '155600', '中国,黑龙江省,双鸭山市,宝清县', '132.196950000000', '46.327160000000', 'Baoqing');
INSERT INTO `cf_areas` VALUES ('230524', '饶河县', '230500', '饶河', '3', '0469', '155700', '中国,黑龙江省,双鸭山市,饶河县', '134.019860000000', '46.798990000000', 'Raohe');
INSERT INTO `cf_areas` VALUES ('230600', '大庆市', '230000', '大庆', '2', '0459', '163000', '中国,黑龙江省,大庆市', '125.112720000000', '46.590734000000', 'Daqing');
INSERT INTO `cf_areas` VALUES ('230602', '萨尔图区', '230600', '萨尔图', '3', '0459', '163001', '中国,黑龙江省,大庆市,萨尔图区', '125.087920000000', '46.593590000000', 'Saertu');
INSERT INTO `cf_areas` VALUES ('230603', '龙凤区', '230600', '龙凤', '3', '0459', '163711', '中国,黑龙江省,大庆市,龙凤区', '125.116570000000', '46.532730000000', 'Longfeng');
INSERT INTO `cf_areas` VALUES ('230604', '让胡路区', '230600', '让胡路', '3', '0459', '163712', '中国,黑龙江省,大庆市,让胡路区', '124.870750000000', '46.652200000000', 'Ranghulu');
INSERT INTO `cf_areas` VALUES ('230605', '红岗区', '230600', '红岗', '3', '0459', '163511', '中国,黑龙江省,大庆市,红岗区', '124.892480000000', '46.401280000000', 'Honggang');
INSERT INTO `cf_areas` VALUES ('230606', '大同区', '230600', '大同', '3', '0459', '163515', '中国,黑龙江省,大庆市,大同区', '124.815910000000', '46.032950000000', 'Datong');
INSERT INTO `cf_areas` VALUES ('230621', '肇州县', '230600', '肇州', '3', '0459', '166400', '中国,黑龙江省,大庆市,肇州县', '125.270590000000', '45.704140000000', 'Zhaozhou');
INSERT INTO `cf_areas` VALUES ('230622', '肇源县', '230600', '肇源', '3', '0459', '166500', '中国,黑龙江省,大庆市,肇源县', '125.084560000000', '45.520320000000', 'Zhaoyuan');
INSERT INTO `cf_areas` VALUES ('230623', '林甸县', '230600', '林甸', '3', '0459', '166300', '中国,黑龙江省,大庆市,林甸县', '124.875640000000', '47.186010000000', 'Lindian');
INSERT INTO `cf_areas` VALUES ('230624', '杜尔伯特蒙古族自治县', '230600', '杜尔伯特', '3', '0459', '166200', '中国,黑龙江省,大庆市,杜尔伯特蒙古族自治县', '124.449370000000', '46.865070000000', 'Duerbote');
INSERT INTO `cf_areas` VALUES ('230700', '伊春市', '230000', '伊春', '2', '0458', '153000', '中国,黑龙江省,伊春市', '128.899396000000', '47.724775000000', 'Yichun');
INSERT INTO `cf_areas` VALUES ('230702', '伊春区', '230700', '伊春', '3', '0458', '153000', '中国,黑龙江省,伊春市,伊春区', '128.907520000000', '47.728000000000', 'Yichun');
INSERT INTO `cf_areas` VALUES ('230703', '南岔区', '230700', '南岔', '3', '0458', '153100', '中国,黑龙江省,伊春市,南岔区', '129.283620000000', '47.138970000000', 'Nancha');
INSERT INTO `cf_areas` VALUES ('230704', '友好区', '230700', '友好', '3', '0458', '153031', '中国,黑龙江省,伊春市,友好区', '128.840390000000', '47.853710000000', 'Youhao');
INSERT INTO `cf_areas` VALUES ('230705', '西林区', '230700', '西林', '3', '0458', '153025', '中国,黑龙江省,伊春市,西林区', '129.312010000000', '47.481030000000', 'Xilin');
INSERT INTO `cf_areas` VALUES ('230706', '翠峦区', '230700', '翠峦', '3', '0458', '153013', '中国,黑龙江省,伊春市,翠峦区', '128.667290000000', '47.725030000000', 'Cuiluan');
INSERT INTO `cf_areas` VALUES ('230707', '新青区', '230700', '新青', '3', '0458', '153036', '中国,黑龙江省,伊春市,新青区', '129.536530000000', '48.290670000000', 'Xinqing');
INSERT INTO `cf_areas` VALUES ('230708', '美溪区', '230700', '美溪', '3', '0458', '153021', '中国,黑龙江省,伊春市,美溪区', '129.137080000000', '47.635130000000', 'Meixi');
INSERT INTO `cf_areas` VALUES ('230709', '金山屯区', '230700', '金山屯', '3', '0458', '153026', '中国,黑龙江省,伊春市,金山屯区', '129.437680000000', '47.413490000000', 'Jinshantun');
INSERT INTO `cf_areas` VALUES ('230710', '五营区', '230700', '五营', '3', '0458', '153033', '中国,黑龙江省,伊春市,五营区', '129.245450000000', '48.107910000000', 'Wuying');
INSERT INTO `cf_areas` VALUES ('230711', '乌马河区', '230700', '乌马河', '3', '0458', '153011', '中国,黑龙江省,伊春市,乌马河区', '128.796720000000', '47.728000000000', 'Wumahe');
INSERT INTO `cf_areas` VALUES ('230712', '汤旺河区', '230700', '汤旺河', '3', '0458', '153037', '中国,黑龙江省,伊春市,汤旺河区', '129.572260000000', '48.451820000000', 'Tangwanghe');
INSERT INTO `cf_areas` VALUES ('230713', '带岭区', '230700', '带岭', '3', '0458', '153106', '中国,黑龙江省,伊春市,带岭区', '129.023520000000', '47.025530000000', 'Dailing');
INSERT INTO `cf_areas` VALUES ('230714', '乌伊岭区', '230700', '乌伊岭', '3', '0458', '153038', '中国,黑龙江省,伊春市,乌伊岭区', '129.439810000000', '48.596020000000', 'Wuyiling');
INSERT INTO `cf_areas` VALUES ('230715', '红星区', '230700', '红星', '3', '0458', '153035', '中国,黑龙江省,伊春市,红星区', '129.388700000000', '48.239440000000', 'Hongxing');
INSERT INTO `cf_areas` VALUES ('230716', '上甘岭区', '230700', '上甘岭', '3', '0458', '153032', '中国,黑龙江省,伊春市,上甘岭区', '129.024470000000', '47.975220000000', 'Shangganling');
INSERT INTO `cf_areas` VALUES ('230722', '嘉荫县', '230700', '嘉荫', '3', '0458', '153200', '中国,黑龙江省,伊春市,嘉荫县', '130.398250000000', '48.891700000000', 'Jiayin');
INSERT INTO `cf_areas` VALUES ('230781', '铁力市', '230700', '铁力', '3', '0458', '152500', '中国,黑龙江省,伊春市,铁力市', '128.031700000000', '46.985710000000', 'Tieli');
INSERT INTO `cf_areas` VALUES ('230800', '佳木斯市', '230000', '佳木斯', '2', '0454', '154002', '中国,黑龙江省,佳木斯市', '130.361634000000', '46.809606000000', 'Jiamusi');
INSERT INTO `cf_areas` VALUES ('230803', '向阳区', '230800', '向阳', '3', '0454', '154002', '中国,黑龙江省,佳木斯市,向阳区', '130.365190000000', '46.807780000000', 'Xiangyang');
INSERT INTO `cf_areas` VALUES ('230804', '前进区', '230800', '前进', '3', '0454', '154002', '中国,黑龙江省,佳木斯市,前进区', '130.374970000000', '46.814010000000', 'Qianjin');
INSERT INTO `cf_areas` VALUES ('230805', '东风区', '230800', '东风', '3', '0454', '154005', '中国,黑龙江省,佳木斯市,东风区', '130.403660000000', '46.822570000000', 'Dongfeng');
INSERT INTO `cf_areas` VALUES ('230811', '郊区', '230800', '郊区', '3', '0454', '154004', '中国,黑龙江省,佳木斯市,郊区', '130.327310000000', '46.809580000000', 'Jiaoqu');
INSERT INTO `cf_areas` VALUES ('230822', '桦南县', '230800', '桦南', '3', '0454', '154400', '中国,黑龙江省,佳木斯市,桦南县', '130.553610000000', '46.239210000000', 'Huanan');
INSERT INTO `cf_areas` VALUES ('230826', '桦川县', '230800', '桦川', '3', '0454', '154300', '中国,黑龙江省,佳木斯市,桦川县', '130.718930000000', '47.022970000000', 'Huachuan');
INSERT INTO `cf_areas` VALUES ('230828', '汤原县', '230800', '汤原', '3', '0454', '154700', '中国,黑龙江省,佳木斯市,汤原县', '129.909660000000', '46.727550000000', 'Tangyuan');
INSERT INTO `cf_areas` VALUES ('230833', '抚远县', '230800', '抚远', '3', '0454', '156500', '中国,黑龙江省,佳木斯市,抚远县', '134.295950000000', '48.367940000000', 'Fuyuan');
INSERT INTO `cf_areas` VALUES ('230881', '同江市', '230800', '同江', '3', '0454', '156400', '中国,黑龙江省,佳木斯市,同江市', '132.510950000000', '47.642110000000', 'Tongjiang');
INSERT INTO `cf_areas` VALUES ('230882', '富锦市', '230800', '富锦', '3', '0454', '156100', '中国,黑龙江省,佳木斯市,富锦市', '132.037070000000', '47.251320000000', 'Fujin');
INSERT INTO `cf_areas` VALUES ('230900', '七台河市', '230000', '七台河', '2', '0464', '154600', '中国,黑龙江省,七台河市', '131.015584000000', '45.771266000000', 'Qitaihe');
INSERT INTO `cf_areas` VALUES ('230902', '新兴区', '230900', '新兴', '3', '0464', '154604', '中国,黑龙江省,七台河市,新兴区', '130.932120000000', '45.816240000000', 'Xinxing');
INSERT INTO `cf_areas` VALUES ('230903', '桃山区', '230900', '桃山', '3', '0464', '154600', '中国,黑龙江省,七台河市,桃山区', '131.017860000000', '45.767820000000', 'Taoshan');
INSERT INTO `cf_areas` VALUES ('230904', '茄子河区', '230900', '茄子河', '3', '0464', '154622', '中国,黑龙江省,七台河市,茄子河区', '131.068070000000', '45.785190000000', 'Qiezihe');
INSERT INTO `cf_areas` VALUES ('230921', '勃利县', '230900', '勃利', '3', '0464', '154500', '中国,黑龙江省,七台河市,勃利县', '130.591790000000', '45.755000000000', 'Boli');
INSERT INTO `cf_areas` VALUES ('231000', '牡丹江市', '230000', '牡丹江', '2', '0453', '157000', '中国,黑龙江省,牡丹江市', '129.618602000000', '44.582962000000', 'Mudanjiang');
INSERT INTO `cf_areas` VALUES ('231002', '东安区', '231000', '东安', '3', '0453', '157000', '中国,黑龙江省,牡丹江市,东安区', '129.626650000000', '44.581330000000', 'Dong\'an');
INSERT INTO `cf_areas` VALUES ('231003', '阳明区', '231000', '阳明', '3', '0453', '157013', '中国,黑龙江省,牡丹江市,阳明区', '129.635470000000', '44.596030000000', 'Yangming');
INSERT INTO `cf_areas` VALUES ('231004', '爱民区', '231000', '爱民', '3', '0453', '157009', '中国,黑龙江省,牡丹江市,爱民区', '129.590770000000', '44.596480000000', 'Aimin');
INSERT INTO `cf_areas` VALUES ('231005', '西安区', '231000', '西安', '3', '0453', '157000', '中国,黑龙江省,牡丹江市,西安区', '129.616160000000', '44.577660000000', 'Xi\'an');
INSERT INTO `cf_areas` VALUES ('231024', '东宁县', '231000', '东宁', '3', '0453', '157200', '中国,黑龙江省,牡丹江市,东宁县', '131.127930000000', '44.066100000000', 'Dongning');
INSERT INTO `cf_areas` VALUES ('231025', '林口县', '231000', '林口', '3', '0453', '157600', '中国,黑龙江省,牡丹江市,林口县', '130.283930000000', '45.278090000000', 'Linkou');
INSERT INTO `cf_areas` VALUES ('231081', '绥芬河市', '231000', '绥芬河', '3', '0453', '157300', '中国,黑龙江省,牡丹江市,绥芬河市', '131.151390000000', '44.412490000000', 'Suifenhe');
INSERT INTO `cf_areas` VALUES ('231083', '海林市', '231000', '海林', '3', '0453', '157100', '中国,黑龙江省,牡丹江市,海林市', '129.381560000000', '44.590000000000', 'Hailin');
INSERT INTO `cf_areas` VALUES ('231084', '宁安市', '231000', '宁安', '3', '0453', '157400', '中国,黑龙江省,牡丹江市,宁安市', '129.483030000000', '44.340160000000', 'Ning\'an');
INSERT INTO `cf_areas` VALUES ('231085', '穆棱市', '231000', '穆棱', '3', '0453', '157500', '中国,黑龙江省,牡丹江市,穆棱市', '130.524650000000', '44.919000000000', 'Muling');
INSERT INTO `cf_areas` VALUES ('231100', '黑河市', '230000', '黑河', '2', '0456', '164300', '中国,黑龙江省,黑河市', '127.499023000000', '50.249585000000', 'Heihe');
INSERT INTO `cf_areas` VALUES ('231102', '爱辉区', '231100', '爱辉', '3', '0456', '164300', '中国,黑龙江省,黑河市,爱辉区', '127.500740000000', '50.252020000000', 'Aihui');
INSERT INTO `cf_areas` VALUES ('231121', '嫩江县', '231100', '嫩江', '3', '0456', '161400', '中国,黑龙江省,黑河市,嫩江县', '125.226070000000', '49.178440000000', 'Nenjiang');
INSERT INTO `cf_areas` VALUES ('231123', '逊克县', '231100', '逊克', '3', '0456', '164400', '中国,黑龙江省,黑河市,逊克县', '128.478820000000', '49.579830000000', 'Xunke');
INSERT INTO `cf_areas` VALUES ('231124', '孙吴县', '231100', '孙吴', '3', '0456', '164200', '中国,黑龙江省,黑河市,孙吴县', '127.335990000000', '49.425390000000', 'Sunwu');
INSERT INTO `cf_areas` VALUES ('231181', '北安市', '231100', '北安', '3', '0456', '164000', '中国,黑龙江省,黑河市,北安市', '126.481930000000', '48.238720000000', 'Bei\'an');
INSERT INTO `cf_areas` VALUES ('231182', '五大连池市', '231100', '五大连池', '3', '0456', '164100', '中国,黑龙江省,黑河市,五大连池市', '126.202940000000', '48.515070000000', 'Wudalianchi');
INSERT INTO `cf_areas` VALUES ('231200', '绥化市', '230000', '绥化', '2', '0455', '152000', '中国,黑龙江省,绥化市', '126.992930000000', '46.637393000000', 'Suihua');
INSERT INTO `cf_areas` VALUES ('231202', '北林区', '231200', '北林', '3', '0455', '152000', '中国,黑龙江省,绥化市,北林区', '126.985640000000', '46.637350000000', 'Beilin');
INSERT INTO `cf_areas` VALUES ('231221', '望奎县', '231200', '望奎', '3', '0455', '152100', '中国,黑龙江省,绥化市,望奎县', '126.481870000000', '46.830790000000', 'Wangkui');
INSERT INTO `cf_areas` VALUES ('231222', '兰西县', '231200', '兰西', '3', '0455', '151500', '中国,黑龙江省,绥化市,兰西县', '126.289940000000', '46.252500000000', 'Lanxi');
INSERT INTO `cf_areas` VALUES ('231223', '青冈县', '231200', '青冈', '3', '0455', '151600', '中国,黑龙江省,绥化市,青冈县', '126.113250000000', '46.685340000000', 'Qinggang');
INSERT INTO `cf_areas` VALUES ('231224', '庆安县', '231200', '庆安', '3', '0455', '152400', '中国,黑龙江省,绥化市,庆安县', '127.507530000000', '46.880160000000', 'Qing\'an');
INSERT INTO `cf_areas` VALUES ('231225', '明水县', '231200', '明水', '3', '0455', '151700', '中国,黑龙江省,绥化市,明水县', '125.905940000000', '47.173270000000', 'Mingshui');
INSERT INTO `cf_areas` VALUES ('231226', '绥棱县', '231200', '绥棱', '3', '0455', '152200', '中国,黑龙江省,绥化市,绥棱县', '127.115840000000', '47.242670000000', 'Suileng');
INSERT INTO `cf_areas` VALUES ('231281', '安达市', '231200', '安达', '3', '0455', '151400', '中国,黑龙江省,绥化市,安达市', '125.343750000000', '46.417700000000', 'Anda');
INSERT INTO `cf_areas` VALUES ('231282', '肇东市', '231200', '肇东', '3', '0455', '151100', '中国,黑龙江省,绥化市,肇东市', '125.962430000000', '46.051310000000', 'Zhaodong');
INSERT INTO `cf_areas` VALUES ('231283', '海伦市', '231200', '海伦', '3', '0455', '152300', '中国,黑龙江省,绥化市,海伦市', '126.968200000000', '47.460930000000', 'Hailun');
INSERT INTO `cf_areas` VALUES ('232700', '大兴安岭地区', '230000', '大兴安岭', '2', '0457', '165000', '中国,黑龙江省,大兴安岭地区', '124.711526000000', '52.335262000000', 'DaXingAnLing');
INSERT INTO `cf_areas` VALUES ('232701', '加格达奇区', '232700', '加格达奇', '3', '0457', '165000', '中国,黑龙江省,大兴安岭地区,加格达奇区', '124.309540000000', '51.981440000000', 'Jiagedaqi');
INSERT INTO `cf_areas` VALUES ('232702', '新林区', '232700', '新林', '3', '0457', '165000', '中国,黑龙江省,大兴安岭地区,新林区', '124.397983000000', '51.673410000000', 'Xinlin');
INSERT INTO `cf_areas` VALUES ('232703', '松岭区', '232700', '松岭', '3', '0457', '165000', '中国,黑龙江省,大兴安岭地区,松岭区', '124.189713000000', '51.985453000000', 'Songling');
INSERT INTO `cf_areas` VALUES ('232704', '呼中区', '232700', '呼中', '3', '0457', '165000', '中国,黑龙江省,大兴安岭地区,呼中区', '123.600090000000', '52.033460000000', 'Huzhong');
INSERT INTO `cf_areas` VALUES ('232721', '呼玛县', '232700', '呼玛', '3', '0457', '165100', '中国,黑龙江省,大兴安岭地区,呼玛县', '126.661740000000', '51.731120000000', 'Huma');
INSERT INTO `cf_areas` VALUES ('232722', '塔河县', '232700', '塔河', '3', '0457', '165200', '中国,黑龙江省,大兴安岭地区,塔河县', '124.709990000000', '52.334310000000', 'Tahe');
INSERT INTO `cf_areas` VALUES ('232723', '漠河县', '232700', '漠河', '3', '0457', '165300', '中国,黑龙江省,大兴安岭地区,漠河县', '122.537590000000', '52.970030000000', 'Mohe');
INSERT INTO `cf_areas` VALUES ('310000', '上海', '100000', '上海', '1', '', '', '中国,上海', '121.472644000000', '31.231706000000', 'Shanghai');
INSERT INTO `cf_areas` VALUES ('310100', '上海市', '310000', '上海', '2', '021', '200000', '中国,上海,上海市', '121.472644000000', '31.231706000000', 'Shanghai');
INSERT INTO `cf_areas` VALUES ('310101', '黄浦区', '310100', '黄浦', '3', '021', '200001', '中国,上海,上海市,黄浦区', '121.492950000000', '31.223370000000', 'Huangpu');
INSERT INTO `cf_areas` VALUES ('310104', '徐汇区', '310100', '徐汇', '3', '021', '200030', '中国,上海,上海市,徐汇区', '121.436760000000', '31.188310000000', 'Xuhui');
INSERT INTO `cf_areas` VALUES ('310105', '长宁区', '310100', '长宁', '3', '021', '200050', '中国,上海,上海市,长宁区', '121.424620000000', '31.220360000000', 'Changning');
INSERT INTO `cf_areas` VALUES ('310106', '静安区', '310100', '静安', '3', '021', '200040', '中国,上海,上海市,静安区', '121.444400000000', '31.228840000000', 'Jing\'an');
INSERT INTO `cf_areas` VALUES ('310107', '普陀区', '310100', '普陀', '3', '021', '200333', '中国,上海,上海市,普陀区', '121.397030000000', '31.249510000000', 'Putuo');
INSERT INTO `cf_areas` VALUES ('310108', '闸北区', '310100', '闸北', '3', '021', '200070', '中国,上海,上海市,闸北区', '121.446360000000', '31.280750000000', 'Zhabei');
INSERT INTO `cf_areas` VALUES ('310109', '虹口区', '310100', '虹口', '3', '021', '200086', '中国,上海,上海市,虹口区', '121.481620000000', '31.277880000000', 'Hongkou');
INSERT INTO `cf_areas` VALUES ('310110', '杨浦区', '310100', '杨浦', '3', '021', '200082', '中国,上海,上海市,杨浦区', '121.526000000000', '31.259500000000', 'Yangpu');
INSERT INTO `cf_areas` VALUES ('310112', '闵行区', '310100', '闵行', '3', '021', '201100', '中国,上海,上海市,闵行区', '121.381620000000', '31.112460000000', 'Minhang');
INSERT INTO `cf_areas` VALUES ('310113', '宝山区', '310100', '宝山', '3', '021', '201900', '中国,上海,上海市,宝山区', '121.489100000000', '31.404500000000', 'Baoshan');
INSERT INTO `cf_areas` VALUES ('310114', '嘉定区', '310100', '嘉定', '3', '021', '201800', '中国,上海,上海市,嘉定区', '121.265500000000', '31.374730000000', 'Jiading');
INSERT INTO `cf_areas` VALUES ('310115', '浦东新区', '310100', '浦东', '3', '021', '200135', '中国,上海,上海市,浦东新区', '121.544700000000', '31.222490000000', 'Pudong');
INSERT INTO `cf_areas` VALUES ('310116', '金山区', '310100', '金山', '3', '021', '200540', '中国,上海,上海市,金山区', '121.341640000000', '30.741630000000', 'Jinshan');
INSERT INTO `cf_areas` VALUES ('310117', '松江区', '310100', '松江', '3', '021', '201600', '中国,上海,上海市,松江区', '121.228790000000', '31.032220000000', 'Songjiang');
INSERT INTO `cf_areas` VALUES ('310118', '青浦区', '310100', '青浦', '3', '021', '201700', '中国,上海,上海市,青浦区', '121.124170000000', '31.149740000000', 'Qingpu');
INSERT INTO `cf_areas` VALUES ('310120', '奉贤区', '310100', '奉贤', '3', '021', '201400', '中国,上海,上海市,奉贤区', '121.474120000000', '30.917900000000', 'Fengxian');
INSERT INTO `cf_areas` VALUES ('310230', '崇明县', '310100', '崇明', '3', '021', '202150', '中国,上海,上海市,崇明县', '121.397580000000', '31.622780000000', 'Chongming');
INSERT INTO `cf_areas` VALUES ('320000', '江苏省', '100000', '江苏', '1', '', '', '中国,江苏省', '118.767413000000', '32.041544000000', 'Jiangsu');
INSERT INTO `cf_areas` VALUES ('320100', '南京市', '320000', '南京', '2', '025', '210008', '中国,江苏省,南京市', '118.767413000000', '32.041544000000', 'Nanjing');
INSERT INTO `cf_areas` VALUES ('320102', '玄武区', '320100', '玄武', '3', '025', '210018', '中国,江苏省,南京市,玄武区', '118.797720000000', '32.048560000000', 'Xuanwu');
INSERT INTO `cf_areas` VALUES ('320104', '秦淮区', '320100', '秦淮', '3', '025', '210001', '中国,江苏省,南京市,秦淮区', '118.798150000000', '32.011120000000', 'Qinhuai');
INSERT INTO `cf_areas` VALUES ('320105', '建邺区', '320100', '建邺', '3', '025', '210004', '中国,江苏省,南京市,建邺区', '118.766410000000', '32.030960000000', 'Jianye');
INSERT INTO `cf_areas` VALUES ('320106', '鼓楼区', '320100', '鼓楼', '3', '025', '210009', '中国,江苏省,南京市,鼓楼区', '118.769740000000', '32.066320000000', 'Gulou');
INSERT INTO `cf_areas` VALUES ('320111', '浦口区', '320100', '浦口', '3', '025', '211800', '中国,江苏省,南京市,浦口区', '118.628020000000', '32.058810000000', 'Pukou');
INSERT INTO `cf_areas` VALUES ('320113', '栖霞区', '320100', '栖霞', '3', '025', '210046', '中国,江苏省,南京市,栖霞区', '118.880640000000', '32.113520000000', 'Qixia');
INSERT INTO `cf_areas` VALUES ('320114', '雨花台区', '320100', '雨花台', '3', '025', '210012', '中国,江苏省,南京市,雨花台区', '118.779900000000', '31.992020000000', 'Yuhuatai');
INSERT INTO `cf_areas` VALUES ('320115', '江宁区', '320100', '江宁', '3', '025', '211100', '中国,江苏省,南京市,江宁区', '118.839900000000', '31.952630000000', 'Jiangning');
INSERT INTO `cf_areas` VALUES ('320116', '六合区', '320100', '六合', '3', '025', '211500', '中国,江苏省,南京市,六合区', '118.841300000000', '32.342220000000', 'Luhe');
INSERT INTO `cf_areas` VALUES ('320117', '溧水区', '320100', '溧水', '3', '025', '211200', '中国,江苏省,南京市,溧水区', '119.028732000000', '31.653061000000', 'Lishui');
INSERT INTO `cf_areas` VALUES ('320118', '高淳区', '320100', '高淳', '3', '025', '211300', '中国,江苏省,南京市,高淳区', '118.875890000000', '31.327132000000', 'Gaochun');
INSERT INTO `cf_areas` VALUES ('320200', '无锡市', '320000', '无锡', '2', '0510', '214000', '中国,江苏省,无锡市', '120.301663000000', '31.574729000000', 'Wuxi');
INSERT INTO `cf_areas` VALUES ('320202', '崇安区', '320200', '崇安', '3', '0510', '214001', '中国,江苏省,无锡市,崇安区', '120.299750000000', '31.580020000000', 'Chong\'an');
INSERT INTO `cf_areas` VALUES ('320203', '南长区', '320200', '南长', '3', '0510', '214021', '中国,江苏省,无锡市,南长区', '120.308730000000', '31.563590000000', 'Nanchang');
INSERT INTO `cf_areas` VALUES ('320204', '北塘区', '320200', '北塘', '3', '0510', '214044', '中国,江苏省,无锡市,北塘区', '120.294050000000', '31.605920000000', 'Beitang');
INSERT INTO `cf_areas` VALUES ('320205', '锡山区', '320200', '锡山', '3', '0510', '214101', '中国,江苏省,无锡市,锡山区', '120.356990000000', '31.588600000000', 'Xishan');
INSERT INTO `cf_areas` VALUES ('320206', '惠山区', '320200', '惠山', '3', '0510', '214174', '中国,江苏省,无锡市,惠山区', '120.298490000000', '31.680880000000', 'Huishan');
INSERT INTO `cf_areas` VALUES ('320211', '滨湖区', '320200', '滨湖', '3', '0510', '214123', '中国,江苏省,无锡市,滨湖区', '120.294610000000', '31.521620000000', 'Binhu');
INSERT INTO `cf_areas` VALUES ('320281', '江阴市', '320200', '江阴', '3', '0510', '214431', '中国,江苏省,无锡市,江阴市', '120.285300000000', '31.919960000000', 'Jiangyin');
INSERT INTO `cf_areas` VALUES ('320282', '宜兴市', '320200', '宜兴', '3', '0510', '214200', '中国,江苏省,无锡市,宜兴市', '119.823570000000', '31.339780000000', 'Yixing');
INSERT INTO `cf_areas` VALUES ('320300', '徐州市', '320000', '徐州', '2', '0516', '221003', '中国,江苏省,徐州市', '117.184811000000', '34.261792000000', 'Xuzhou');
INSERT INTO `cf_areas` VALUES ('320302', '鼓楼区', '320300', '鼓楼', '3', '0516', '221005', '中国,江苏省,徐州市,鼓楼区', '117.185590000000', '34.288510000000', 'Gulou');
INSERT INTO `cf_areas` VALUES ('320303', '云龙区', '320300', '云龙', '3', '0516', '221007', '中国,江苏省,徐州市,云龙区', '117.230530000000', '34.248950000000', 'Yunlong');
INSERT INTO `cf_areas` VALUES ('320305', '贾汪区', '320300', '贾汪', '3', '0516', '221003', '中国,江苏省,徐州市,贾汪区', '117.453460000000', '34.442640000000', 'Jiawang');
INSERT INTO `cf_areas` VALUES ('320311', '泉山区', '320300', '泉山', '3', '0516', '221006', '中国,江苏省,徐州市,泉山区', '117.193780000000', '34.244180000000', 'Quanshan');
INSERT INTO `cf_areas` VALUES ('320312', '铜山区', '320300', '铜山', '3', '0516', '221106', '中国,江苏省,徐州市,铜山区', '117.183894000000', '34.192880000000', 'Tongshan');
INSERT INTO `cf_areas` VALUES ('320321', '丰县', '320300', '丰县', '3', '0516', '221700', '中国,江苏省,徐州市,丰县', '116.599570000000', '34.699720000000', 'Fengxian');
INSERT INTO `cf_areas` VALUES ('320322', '沛县', '320300', '沛县', '3', '0516', '221600', '中国,江苏省,徐州市,沛县', '116.937430000000', '34.721630000000', 'Peixian');
INSERT INTO `cf_areas` VALUES ('320324', '睢宁县', '320300', '睢宁', '3', '0516', '221200', '中国,江苏省,徐州市,睢宁县', '117.941040000000', '33.912690000000', 'Suining');
INSERT INTO `cf_areas` VALUES ('320381', '新沂市', '320300', '新沂', '3', '0516', '221400', '中国,江苏省,徐州市,新沂市', '118.354520000000', '34.369420000000', 'Xinyi');
INSERT INTO `cf_areas` VALUES ('320382', '邳州市', '320300', '邳州', '3', '0516', '221300', '中国,江苏省,徐州市,邳州市', '117.958580000000', '34.333290000000', 'Pizhou');
INSERT INTO `cf_areas` VALUES ('320400', '常州市', '320000', '常州', '2', '0519', '213000', '中国,江苏省,常州市', '119.946973000000', '31.772752000000', 'Changzhou');
INSERT INTO `cf_areas` VALUES ('320402', '天宁区', '320400', '天宁', '3', '0519', '213000', '中国,江苏省,常州市,天宁区', '119.951320000000', '31.752110000000', 'Tianning');
INSERT INTO `cf_areas` VALUES ('320404', '钟楼区', '320400', '钟楼', '3', '0519', '213023', '中国,江苏省,常州市,钟楼区', '119.901780000000', '31.802210000000', 'Zhonglou');
INSERT INTO `cf_areas` VALUES ('320405', '戚墅堰区', '320400', '戚墅堰', '3', '0519', '213025', '中国,江苏省,常州市,戚墅堰区', '120.061060000000', '31.719560000000', 'Qishuyan');
INSERT INTO `cf_areas` VALUES ('320411', '新北区', '320400', '新北', '3', '0519', '213022', '中国,江苏省,常州市,新北区', '119.971310000000', '31.830460000000', 'Xinbei');
INSERT INTO `cf_areas` VALUES ('320412', '武进区', '320400', '武进', '3', '0519', '213100', '中国,江苏省,常州市,武进区', '119.942440000000', '31.700860000000', 'Wujin');
INSERT INTO `cf_areas` VALUES ('320481', '溧阳市', '320400', '溧阳', '3', '0519', '213300', '中国,江苏省,常州市,溧阳市', '119.483700000000', '31.415380000000', 'Liyang');
INSERT INTO `cf_areas` VALUES ('320482', '金坛市', '320400', '金坛', '3', '0519', '213200', '中国,江苏省,常州市,金坛市', '119.577570000000', '31.740430000000', 'Jintan');
INSERT INTO `cf_areas` VALUES ('320500', '苏州市', '320000', '苏州', '2', '0512', '215002', '中国,江苏省,苏州市', '120.619585000000', '31.299379000000', 'Suzhou');
INSERT INTO `cf_areas` VALUES ('320505', '虎丘区', '320500', '虎丘', '3', '0512', '215004', '中国,江苏省,苏州市,虎丘区', '120.573450000000', '31.295300000000', 'Huqiu');
INSERT INTO `cf_areas` VALUES ('320506', '吴中区', '320500', '吴中', '3', '0512', '215128', '中国,江苏省,苏州市,吴中区', '120.632110000000', '31.262260000000', 'Wuzhong');
INSERT INTO `cf_areas` VALUES ('320507', '相城区', '320500', '相城', '3', '0512', '215131', '中国,江苏省,苏州市,相城区', '120.642390000000', '31.368890000000', 'Xiangcheng');
INSERT INTO `cf_areas` VALUES ('320508', '姑苏区', '320500', '姑苏', '3', '0512', '215031', '中国,江苏省,苏州市,姑苏区', '120.619585000000', '31.299379000000', 'Gusu');
INSERT INTO `cf_areas` VALUES ('320509', '吴江区', '320500', '吴江', '3', '0512', '215200', '中国,江苏省,苏州市,吴江区', '120.638317000000', '31.159815000000', 'Wujiang');
INSERT INTO `cf_areas` VALUES ('320581', '常熟市', '320500', '常熟', '3', '0512', '215500', '中国,江苏省,苏州市,常熟市', '120.752250000000', '31.653740000000', 'Changshu');
INSERT INTO `cf_areas` VALUES ('320582', '张家港市', '320500', '张家港', '3', '0512', '215600', '中国,江苏省,苏州市,张家港市', '120.555380000000', '31.875320000000', 'Zhangjiagang');
INSERT INTO `cf_areas` VALUES ('320583', '昆山市', '320500', '昆山', '3', '0512', '215300', '中国,江苏省,苏州市,昆山市', '120.980740000000', '31.384640000000', 'Kunshan');
INSERT INTO `cf_areas` VALUES ('320585', '太仓市', '320500', '太仓', '3', '0512', '215400', '中国,江苏省,苏州市,太仓市', '121.108910000000', '31.449700000000', 'Taicang');
INSERT INTO `cf_areas` VALUES ('320600', '南通市', '320000', '南通', '2', '0513', '226001', '中国,江苏省,南通市', '120.864608000000', '32.016212000000', 'Nantong');
INSERT INTO `cf_areas` VALUES ('320602', '崇川区', '320600', '崇川', '3', '0513', '226001', '中国,江苏省,南通市,崇川区', '120.857300000000', '32.009800000000', 'Chongchuan');
INSERT INTO `cf_areas` VALUES ('320611', '港闸区', '320600', '港闸', '3', '0513', '226001', '中国,江苏省,南通市,港闸区', '120.817780000000', '32.031630000000', 'Gangzha');
INSERT INTO `cf_areas` VALUES ('320612', '通州区', '320600', '通州', '3', '0513', '226300', '中国,江苏省,南通市,通州区', '121.072930000000', '32.067600000000', 'Tongzhou');
INSERT INTO `cf_areas` VALUES ('320621', '海安县', '320600', '海安', '3', '0513', '226600', '中国,江苏省,南通市,海安县', '120.458520000000', '32.545140000000', 'Hai\'an');
INSERT INTO `cf_areas` VALUES ('320623', '如东县', '320600', '如东', '3', '0513', '226400', '中国,江苏省,南通市,如东县', '121.189420000000', '32.314390000000', 'Rudong');
INSERT INTO `cf_areas` VALUES ('320681', '启东市', '320600', '启东', '3', '0513', '226200', '中国,江苏省,南通市,启东市', '121.659850000000', '31.810830000000', 'Qidong');
INSERT INTO `cf_areas` VALUES ('320682', '如皋市', '320600', '如皋', '3', '0513', '226500', '中国,江苏省,南通市,如皋市', '120.559690000000', '32.375970000000', 'Rugao');
INSERT INTO `cf_areas` VALUES ('320684', '海门市', '320600', '海门', '3', '0513', '226100', '中国,江苏省,南通市,海门市', '121.169950000000', '31.894220000000', 'Haimen');
INSERT INTO `cf_areas` VALUES ('320700', '连云港市', '320000', '连云港', '2', '0518', '222002', '中国,江苏省,连云港市', '119.178821000000', '34.600018000000', 'Lianyungang');
INSERT INTO `cf_areas` VALUES ('320703', '连云区', '320700', '连云', '3', '0518', '222042', '中国,江苏省,连云港市,连云区', '119.373040000000', '34.752930000000', 'Lianyun');
INSERT INTO `cf_areas` VALUES ('320706', '海州区', '320700', '海州', '3', '0518', '222003', '中国,江苏省,连云港市,海州区', '119.131280000000', '34.569860000000', 'Haizhou');
INSERT INTO `cf_areas` VALUES ('320707', '赣榆区', '320700', '赣榆', '3', '0518', '222100', '中国,江苏省,连云港市,赣榆区', '119.128774000000', '34.839154000000', 'Ganyu');
INSERT INTO `cf_areas` VALUES ('320722', '东海县', '320700', '东海', '3', '0518', '222300', '中国,江苏省,连云港市,东海县', '118.771450000000', '34.542150000000', 'Donghai');
INSERT INTO `cf_areas` VALUES ('320723', '灌云县', '320700', '灌云', '3', '0518', '222200', '中国,江苏省,连云港市,灌云县', '119.239250000000', '34.283910000000', 'Guanyun');
INSERT INTO `cf_areas` VALUES ('320724', '灌南县', '320700', '灌南', '3', '0518', '222500', '中国,江苏省,连云港市,灌南县', '119.356320000000', '34.090000000000', 'Guannan');
INSERT INTO `cf_areas` VALUES ('320800', '淮安市', '320000', '淮安', '2', '0517', '223001', '中国,江苏省,淮安市', '119.021265000000', '33.597506000000', 'Huai\'an');
INSERT INTO `cf_areas` VALUES ('320802', '清河区', '320800', '清河', '3', '0517', '223001', '中国,江苏省,淮安市,清河区', '119.007780000000', '33.599490000000', 'Qinghe');
INSERT INTO `cf_areas` VALUES ('320803', '淮安区', '320800', '淮安', '3', '0517', '223200', '中国,江苏省,淮安市,淮安区', '119.021265000000', '33.597506000000', 'Huai\'an');
INSERT INTO `cf_areas` VALUES ('320804', '淮阴区', '320800', '淮阴', '3', '0517', '223300', '中国,江苏省,淮安市,淮阴区', '119.034850000000', '33.631710000000', 'Huaiyin');
INSERT INTO `cf_areas` VALUES ('320811', '清浦区', '320800', '清浦', '3', '0517', '223002', '中国,江苏省,淮安市,清浦区', '119.026480000000', '33.552320000000', 'Qingpu');
INSERT INTO `cf_areas` VALUES ('320826', '涟水县', '320800', '涟水', '3', '0517', '223400', '中国,江苏省,淮安市,涟水县', '119.260830000000', '33.780940000000', 'Lianshui');
INSERT INTO `cf_areas` VALUES ('320829', '洪泽县', '320800', '洪泽', '3', '0517', '223100', '中国,江苏省,淮安市,洪泽县', '118.873440000000', '33.294290000000', 'Hongze');
INSERT INTO `cf_areas` VALUES ('320830', '盱眙县', '320800', '盱眙', '3', '0517', '211700', '中国,江苏省,淮安市,盱眙县', '118.544950000000', '33.010860000000', 'Xuyi');
INSERT INTO `cf_areas` VALUES ('320831', '金湖县', '320800', '金湖', '3', '0517', '211600', '中国,江苏省,淮安市,金湖县', '119.023070000000', '33.022190000000', 'Jinhu');
INSERT INTO `cf_areas` VALUES ('320900', '盐城市', '320000', '盐城', '2', '0515', '224005', '中国,江苏省,盐城市', '120.139998000000', '33.377631000000', 'Yancheng');
INSERT INTO `cf_areas` VALUES ('320902', '亭湖区', '320900', '亭湖', '3', '0515', '224005', '中国,江苏省,盐城市,亭湖区', '120.165830000000', '33.378250000000', 'Tinghu');
INSERT INTO `cf_areas` VALUES ('320903', '盐都区', '320900', '盐都', '3', '0515', '224055', '中国,江苏省,盐城市,盐都区', '120.154410000000', '33.337300000000', 'Yandu');
INSERT INTO `cf_areas` VALUES ('320921', '响水县', '320900', '响水', '3', '0515', '224600', '中国,江苏省,盐城市,响水县', '119.569850000000', '34.205130000000', 'Xiangshui');
INSERT INTO `cf_areas` VALUES ('320922', '滨海县', '320900', '滨海', '3', '0515', '224500', '中国,江苏省,盐城市,滨海县', '119.820580000000', '33.989720000000', 'Binhai');
INSERT INTO `cf_areas` VALUES ('320923', '阜宁县', '320900', '阜宁', '3', '0515', '224400', '中国,江苏省,盐城市,阜宁县', '119.801750000000', '33.782280000000', 'Funing');
INSERT INTO `cf_areas` VALUES ('320924', '射阳县', '320900', '射阳', '3', '0515', '224300', '中国,江苏省,盐城市,射阳县', '120.260430000000', '33.776360000000', 'Sheyang');
INSERT INTO `cf_areas` VALUES ('320925', '建湖县', '320900', '建湖', '3', '0515', '224700', '中国,江苏省,盐城市,建湖县', '119.798520000000', '33.472410000000', 'Jianhu');
INSERT INTO `cf_areas` VALUES ('320981', '东台市', '320900', '东台', '3', '0515', '224200', '中国,江苏省,盐城市,东台市', '120.323760000000', '32.850780000000', 'Dongtai');
INSERT INTO `cf_areas` VALUES ('320982', '大丰市', '320900', '大丰', '3', '0515', '224100', '中国,江苏省,盐城市,大丰市', '120.465940000000', '33.198930000000', 'Dafeng');
INSERT INTO `cf_areas` VALUES ('321000', '扬州市', '320000', '扬州', '2', '0514', '225002', '中国,江苏省,扬州市', '119.421003000000', '32.393159000000', 'Yangzhou');
INSERT INTO `cf_areas` VALUES ('321002', '广陵区', '321000', '广陵', '3', '0514', '225002', '中国,江苏省,扬州市,广陵区', '119.431860000000', '32.394720000000', 'Guangling');
INSERT INTO `cf_areas` VALUES ('321003', '邗江区', '321000', '邗江', '3', '0514', '225002', '中国,江苏省,扬州市,邗江区', '119.398160000000', '32.376500000000', 'Hanjiang');
INSERT INTO `cf_areas` VALUES ('321012', '江都区', '321000', '江都', '3', '0514', '225200', '中国,江苏省,扬州市,江都区', '119.567481000000', '32.426564000000', 'Jiangdu');
INSERT INTO `cf_areas` VALUES ('321023', '宝应县', '321000', '宝应', '3', '0514', '225800', '中国,江苏省,扬州市,宝应县', '119.312130000000', '33.235490000000', 'Baoying');
INSERT INTO `cf_areas` VALUES ('321081', '仪征市', '321000', '仪征', '3', '0514', '211400', '中国,江苏省,扬州市,仪征市', '119.184320000000', '32.271970000000', 'Yizheng');
INSERT INTO `cf_areas` VALUES ('321084', '高邮市', '321000', '高邮', '3', '0514', '225600', '中国,江苏省,扬州市,高邮市', '119.459650000000', '32.781350000000', 'Gaoyou');
INSERT INTO `cf_areas` VALUES ('321100', '镇江市', '320000', '镇江', '2', '0511', '212004', '中国,江苏省,镇江市', '119.452753000000', '32.204402000000', 'Zhenjiang');
INSERT INTO `cf_areas` VALUES ('321102', '京口区', '321100', '京口', '3', '0511', '212003', '中国,江苏省,镇江市,京口区', '119.469470000000', '32.198090000000', 'Jingkou');
INSERT INTO `cf_areas` VALUES ('321111', '润州区', '321100', '润州', '3', '0511', '212005', '中国,江苏省,镇江市,润州区', '119.411340000000', '32.195230000000', 'Runzhou');
INSERT INTO `cf_areas` VALUES ('321112', '丹徒区', '321100', '丹徒', '3', '0511', '212028', '中国,江苏省,镇江市,丹徒区', '119.433830000000', '32.131830000000', 'Dantu');
INSERT INTO `cf_areas` VALUES ('321181', '丹阳市', '321100', '丹阳', '3', '0511', '212300', '中国,江苏省,镇江市,丹阳市', '119.575250000000', '31.991210000000', 'Danyang');
INSERT INTO `cf_areas` VALUES ('321182', '扬中市', '321100', '扬中', '3', '0511', '212200', '中国,江苏省,镇江市,扬中市', '119.797180000000', '32.236300000000', 'Yangzhong');
INSERT INTO `cf_areas` VALUES ('321183', '句容市', '321100', '句容', '3', '0511', '212400', '中国,江苏省,镇江市,句容市', '119.164820000000', '31.955910000000', 'Jurong');
INSERT INTO `cf_areas` VALUES ('321200', '泰州市', '320000', '泰州', '2', '0523', '225300', '中国,江苏省,泰州市', '119.915176000000', '32.484882000000', 'Taizhou');
INSERT INTO `cf_areas` VALUES ('321202', '海陵区', '321200', '海陵', '3', '0523', '225300', '中国,江苏省,泰州市,海陵区', '119.919420000000', '32.491010000000', 'Hailing');
INSERT INTO `cf_areas` VALUES ('321203', '高港区', '321200', '高港', '3', '0523', '225321', '中国,江苏省,泰州市,高港区', '119.880890000000', '32.318330000000', 'Gaogang');
INSERT INTO `cf_areas` VALUES ('321204', '姜堰区', '321200', '姜堰', '3', '0523', '225500', '中国,江苏省,泰州市,姜堰区', '120.148208000000', '32.508483000000', 'Jiangyan');
INSERT INTO `cf_areas` VALUES ('321281', '兴化市', '321200', '兴化', '3', '0523', '225700', '中国,江苏省,泰州市,兴化市', '119.852380000000', '32.909440000000', 'Xinghua');
INSERT INTO `cf_areas` VALUES ('321282', '靖江市', '321200', '靖江', '3', '0523', '214500', '中国,江苏省,泰州市,靖江市', '120.272910000000', '32.015950000000', 'Jingjiang');
INSERT INTO `cf_areas` VALUES ('321283', '泰兴市', '321200', '泰兴', '3', '0523', '225400', '中国,江苏省,泰州市,泰兴市', '120.051940000000', '32.171870000000', 'Taixing');
INSERT INTO `cf_areas` VALUES ('321300', '宿迁市', '320000', '宿迁', '2', '0527', '223800', '中国,江苏省,宿迁市', '118.293328000000', '33.945154000000', 'Suqian');
INSERT INTO `cf_areas` VALUES ('321302', '宿城区', '321300', '宿城', '3', '0527', '223800', '中国,江苏省,宿迁市,宿城区', '118.291410000000', '33.942190000000', 'Sucheng');
INSERT INTO `cf_areas` VALUES ('321311', '宿豫区', '321300', '宿豫', '3', '0527', '223800', '中国,江苏省,宿迁市,宿豫区', '118.329220000000', '33.946730000000', 'Suyu');
INSERT INTO `cf_areas` VALUES ('321322', '沭阳县', '321300', '沭阳', '3', '0527', '223600', '中国,江苏省,宿迁市,沭阳县', '118.768730000000', '34.114460000000', 'Shuyang');
INSERT INTO `cf_areas` VALUES ('321323', '泗阳县', '321300', '泗阳', '3', '0527', '223700', '中国,江苏省,宿迁市,泗阳县', '118.703300000000', '33.720960000000', 'Siyang');
INSERT INTO `cf_areas` VALUES ('321324', '泗洪县', '321300', '泗洪', '3', '0527', '223900', '中国,江苏省,宿迁市,泗洪县', '118.217160000000', '33.459960000000', 'Sihong');
INSERT INTO `cf_areas` VALUES ('330000', '浙江省', '100000', '浙江', '1', '', '', '中国,浙江省', '120.153576000000', '30.287459000000', 'Zhejiang');
INSERT INTO `cf_areas` VALUES ('330100', '杭州市', '330000', '杭州', '2', '0571', '310026', '中国,浙江省,杭州市', '120.153576000000', '30.287459000000', 'Hangzhou');
INSERT INTO `cf_areas` VALUES ('330102', '上城区', '330100', '上城', '3', '0571', '310002', '中国,浙江省,杭州市,上城区', '120.169220000000', '30.242550000000', 'Shangcheng');
INSERT INTO `cf_areas` VALUES ('330103', '下城区', '330100', '下城', '3', '0571', '310006', '中国,浙江省,杭州市,下城区', '120.180960000000', '30.281530000000', 'Xiacheng');
INSERT INTO `cf_areas` VALUES ('330104', '江干区', '330100', '江干', '3', '0571', '310016', '中国,浙江省,杭州市,江干区', '120.205170000000', '30.257200000000', 'Jianggan');
INSERT INTO `cf_areas` VALUES ('330105', '拱墅区', '330100', '拱墅', '3', '0571', '310011', '中国,浙江省,杭州市,拱墅区', '120.142090000000', '30.319680000000', 'Gongshu');
INSERT INTO `cf_areas` VALUES ('330106', '西湖区', '330100', '西湖', '3', '0571', '310013', '中国,浙江省,杭州市,西湖区', '120.129790000000', '30.259490000000', 'Xihu');
INSERT INTO `cf_areas` VALUES ('330108', '滨江区', '330100', '滨江', '3', '0571', '310051', '中国,浙江省,杭州市,滨江区', '120.211940000000', '30.208350000000', 'Binjiang');
INSERT INTO `cf_areas` VALUES ('330109', '萧山区', '330100', '萧山', '3', '0571', '311200', '中国,浙江省,杭州市,萧山区', '120.264520000000', '30.185050000000', 'Xiaoshan');
INSERT INTO `cf_areas` VALUES ('330110', '余杭区', '330100', '余杭', '3', '0571', '311100', '中国,浙江省,杭州市,余杭区', '120.299860000000', '30.418290000000', 'Yuhang');
INSERT INTO `cf_areas` VALUES ('330122', '桐庐县', '330100', '桐庐', '3', '0571', '311500', '中国,浙江省,杭州市,桐庐县', '119.688530000000', '29.797790000000', 'Tonglu');
INSERT INTO `cf_areas` VALUES ('330127', '淳安县', '330100', '淳安', '3', '0571', '311700', '中国,浙江省,杭州市,淳安县', '119.042570000000', '29.609880000000', 'Chun\'an');
INSERT INTO `cf_areas` VALUES ('330182', '建德市', '330100', '建德', '3', '0571', '311600', '中国,浙江省,杭州市,建德市', '119.281580000000', '29.476030000000', 'Jiande');
INSERT INTO `cf_areas` VALUES ('330183', '富阳区', '330100', '富阳', '3', '0571', '311400', '中国,浙江省,杭州市,富阳区', '119.960410000000', '30.048780000000', 'Fuyang');
INSERT INTO `cf_areas` VALUES ('330185', '临安市', '330100', '临安', '3', '0571', '311300', '中国,浙江省,杭州市,临安市', '119.724730000000', '30.234470000000', 'Lin\'an');
INSERT INTO `cf_areas` VALUES ('330200', '宁波市', '330000', '宁波', '2', '0574', '315000', '中国,浙江省,宁波市', '121.549792000000', '29.868388000000', 'Ningbo');
INSERT INTO `cf_areas` VALUES ('330203', '海曙区', '330200', '海曙', '3', '0574', '315000', '中国,浙江省,宁波市,海曙区', '121.551060000000', '29.859770000000', 'Haishu');
INSERT INTO `cf_areas` VALUES ('330204', '江东区', '330200', '江东', '3', '0574', '315040', '中国,浙江省,宁波市,江东区', '121.570280000000', '29.867010000000', 'Jiangdong');
INSERT INTO `cf_areas` VALUES ('330205', '江北区', '330200', '江北', '3', '0574', '315020', '中国,浙江省,宁波市,江北区', '121.556810000000', '29.887760000000', 'Jiangbei');
INSERT INTO `cf_areas` VALUES ('330206', '北仑区', '330200', '北仑', '3', '0574', '315800', '中国,浙江省,宁波市,北仑区', '121.844080000000', '29.900690000000', 'Beilun');
INSERT INTO `cf_areas` VALUES ('330211', '镇海区', '330200', '镇海', '3', '0574', '315200', '中国,浙江省,宁波市,镇海区', '121.716150000000', '29.948930000000', 'Zhenhai');
INSERT INTO `cf_areas` VALUES ('330212', '鄞州区', '330200', '鄞州', '3', '0574', '315100', '中国,浙江省,宁波市,鄞州区', '121.547540000000', '29.816140000000', 'Yinzhou');
INSERT INTO `cf_areas` VALUES ('330225', '象山县', '330200', '象山', '3', '0574', '315700', '中国,浙江省,宁波市,象山县', '121.869170000000', '29.477580000000', 'Xiangshan');
INSERT INTO `cf_areas` VALUES ('330226', '宁海县', '330200', '宁海', '3', '0574', '315600', '中国,浙江省,宁波市,宁海县', '121.430720000000', '29.288900000000', 'Ninghai');
INSERT INTO `cf_areas` VALUES ('330281', '余姚市', '330200', '余姚', '3', '0574', '315400', '中国,浙江省,宁波市,余姚市', '121.153410000000', '30.038670000000', 'Yuyao');
INSERT INTO `cf_areas` VALUES ('330282', '慈溪市', '330200', '慈溪', '3', '0574', '315300', '中国,浙江省,宁波市,慈溪市', '121.266410000000', '30.169590000000', 'Cixi');
INSERT INTO `cf_areas` VALUES ('330283', '奉化市', '330200', '奉化', '3', '0574', '315500', '中国,浙江省,宁波市,奉化市', '121.410030000000', '29.655370000000', 'Fenghua');
INSERT INTO `cf_areas` VALUES ('330300', '温州市', '330000', '温州', '2', '0577', '325000', '中国,浙江省,温州市', '120.672111000000', '28.000575000000', 'Wenzhou');
INSERT INTO `cf_areas` VALUES ('330302', '鹿城区', '330300', '鹿城', '3', '0577', '325000', '中国,浙江省,温州市,鹿城区', '120.655050000000', '28.014890000000', 'Lucheng');
INSERT INTO `cf_areas` VALUES ('330303', '龙湾区', '330300', '龙湾', '3', '0577', '325013', '中国,浙江省,温州市,龙湾区', '120.830530000000', '27.912840000000', 'Longwan');
INSERT INTO `cf_areas` VALUES ('330304', '瓯海区', '330300', '瓯海', '3', '0577', '325005', '中国,浙江省,温州市,瓯海区', '120.637510000000', '28.007140000000', 'Ouhai');
INSERT INTO `cf_areas` VALUES ('330322', '洞头县', '330300', '洞头', '3', '0577', '325700', '中国,浙江省,温州市,洞头县', '121.156060000000', '27.836340000000', 'Dongtou');
INSERT INTO `cf_areas` VALUES ('330324', '永嘉县', '330300', '永嘉', '3', '0577', '325100', '中国,浙江省,温州市,永嘉县', '120.693170000000', '28.154560000000', 'Yongjia');
INSERT INTO `cf_areas` VALUES ('330326', '平阳县', '330300', '平阳', '3', '0577', '325400', '中国,浙江省,温州市,平阳县', '120.565060000000', '27.662450000000', 'Pingyang');
INSERT INTO `cf_areas` VALUES ('330327', '苍南县', '330300', '苍南', '3', '0577', '325800', '中国,浙江省,温州市,苍南县', '120.426080000000', '27.517390000000', 'Cangnan');
INSERT INTO `cf_areas` VALUES ('330328', '文成县', '330300', '文成', '3', '0577', '325300', '中国,浙江省,温州市,文成县', '120.090630000000', '27.786780000000', 'Wencheng');
INSERT INTO `cf_areas` VALUES ('330329', '泰顺县', '330300', '泰顺', '3', '0577', '325500', '中国,浙江省,温州市,泰顺县', '119.718200000000', '27.556940000000', 'Taishun');
INSERT INTO `cf_areas` VALUES ('330381', '瑞安市', '330300', '瑞安', '3', '0577', '325200', '中国,浙江省,温州市,瑞安市', '120.654660000000', '27.780410000000', 'Rui\'an');
INSERT INTO `cf_areas` VALUES ('330382', '乐清市', '330300', '乐清', '3', '0577', '325600', '中国,浙江省,温州市,乐清市', '120.961700000000', '28.124040000000', 'Yueqing');
INSERT INTO `cf_areas` VALUES ('330400', '嘉兴市', '330000', '嘉兴', '2', '0573', '314000', '中国,浙江省,嘉兴市', '120.750865000000', '30.762653000000', 'Jiaxing');
INSERT INTO `cf_areas` VALUES ('330402', '南湖区', '330400', '南湖', '3', '0573', '314051', '中国,浙江省,嘉兴市,南湖区', '120.785240000000', '30.748650000000', 'Nanhu');
INSERT INTO `cf_areas` VALUES ('330411', '秀洲区', '330400', '秀洲', '3', '0573', '314031', '中国,浙江省,嘉兴市,秀洲区', '120.708670000000', '30.764540000000', 'Xiuzhou');
INSERT INTO `cf_areas` VALUES ('330421', '嘉善县', '330400', '嘉善', '3', '0573', '314100', '中国,浙江省,嘉兴市,嘉善县', '120.925590000000', '30.829930000000', 'Jiashan');
INSERT INTO `cf_areas` VALUES ('330424', '海盐县', '330400', '海盐', '3', '0573', '314300', '中国,浙江省,嘉兴市,海盐县', '120.945700000000', '30.525470000000', 'Haiyan');
INSERT INTO `cf_areas` VALUES ('330481', '海宁市', '330400', '海宁', '3', '0573', '314400', '中国,浙江省,嘉兴市,海宁市', '120.681300000000', '30.509700000000', 'Haining');
INSERT INTO `cf_areas` VALUES ('330482', '平湖市', '330400', '平湖', '3', '0573', '314200', '中国,浙江省,嘉兴市,平湖市', '121.021660000000', '30.696180000000', 'Pinghu');
INSERT INTO `cf_areas` VALUES ('330483', '桐乡市', '330400', '桐乡', '3', '0573', '314500', '中国,浙江省,嘉兴市,桐乡市', '120.564850000000', '30.630200000000', 'Tongxiang');
INSERT INTO `cf_areas` VALUES ('330500', '湖州市', '330000', '湖州', '2', '0572', '313000', '中国,浙江省,湖州市', '120.102398000000', '30.867198000000', 'Huzhou');
INSERT INTO `cf_areas` VALUES ('330502', '吴兴区', '330500', '吴兴', '3', '0572', '313000', '中国,浙江省,湖州市,吴兴区', '120.125480000000', '30.857520000000', 'Wuxing');
INSERT INTO `cf_areas` VALUES ('330503', '南浔区', '330500', '南浔', '3', '0572', '313009', '中国,浙江省,湖州市,南浔区', '120.420380000000', '30.866860000000', 'Nanxun');
INSERT INTO `cf_areas` VALUES ('330521', '德清县', '330500', '德清', '3', '0572', '313200', '中国,浙江省,湖州市,德清县', '119.978360000000', '30.533690000000', 'Deqing');
INSERT INTO `cf_areas` VALUES ('330522', '长兴县', '330500', '长兴', '3', '0572', '313100', '中国,浙江省,湖州市,长兴县', '119.907830000000', '31.006060000000', 'Changxing');
INSERT INTO `cf_areas` VALUES ('330523', '安吉县', '330500', '安吉', '3', '0572', '313300', '中国,浙江省,湖州市,安吉县', '119.681580000000', '30.637980000000', 'Anji');
INSERT INTO `cf_areas` VALUES ('330600', '绍兴市', '330000', '绍兴', '2', '0575', '312000', '中国,浙江省,绍兴市', '120.582112000000', '29.997117000000', 'Shaoxing');
INSERT INTO `cf_areas` VALUES ('330602', '越城区', '330600', '越城', '3', '0575', '312000', '中国,浙江省,绍兴市,越城区', '120.581900000000', '29.988950000000', 'Yuecheng');
INSERT INTO `cf_areas` VALUES ('330603', '柯桥区', '330600', '柯桥', '3', '0575', '312030', '中国,浙江省,绍兴市,柯桥区', '120.492736000000', '30.087630000000', 'Keqiao ');
INSERT INTO `cf_areas` VALUES ('330604', '上虞区', '330600', '上虞', '3', '0575', '312300', '中国,浙江省,绍兴市,上虞区', '120.476075000000', '30.078038000000', 'Shangyu');
INSERT INTO `cf_areas` VALUES ('330624', '新昌县', '330600', '新昌', '3', '0575', '312500', '中国,浙江省,绍兴市,新昌县', '120.904350000000', '29.499910000000', 'Xinchang');
INSERT INTO `cf_areas` VALUES ('330681', '诸暨市', '330600', '诸暨', '3', '0575', '311800', '中国,浙江省,绍兴市,诸暨市', '120.236290000000', '29.713580000000', 'Zhuji');
INSERT INTO `cf_areas` VALUES ('330683', '嵊州市', '330600', '嵊州', '3', '0575', '312400', '中国,浙江省,绍兴市,嵊州市', '120.821740000000', '29.588540000000', 'Shengzhou');
INSERT INTO `cf_areas` VALUES ('330700', '金华市', '330000', '金华', '2', '0579', '321000', '中国,浙江省,金华市', '119.649506000000', '29.089524000000', 'Jinhua');
INSERT INTO `cf_areas` VALUES ('330702', '婺城区', '330700', '婺城', '3', '0579', '321000', '中国,浙江省,金华市,婺城区', '119.571350000000', '29.095210000000', 'Wucheng');
INSERT INTO `cf_areas` VALUES ('330703', '金东区', '330700', '金东', '3', '0579', '321000', '中国,浙江省,金华市,金东区', '119.693020000000', '29.099100000000', 'Jindong');
INSERT INTO `cf_areas` VALUES ('330723', '武义县', '330700', '武义', '3', '0579', '321200', '中国,浙江省,金华市,武义县', '119.816400000000', '28.893310000000', 'Wuyi');
INSERT INTO `cf_areas` VALUES ('330726', '浦江县', '330700', '浦江', '3', '0579', '322200', '中国,浙江省,金华市,浦江县', '119.891810000000', '29.453530000000', 'Pujiang');
INSERT INTO `cf_areas` VALUES ('330727', '磐安县', '330700', '磐安', '3', '0579', '322300', '中国,浙江省,金华市,磐安县', '120.450220000000', '29.057330000000', 'Pan\'an');
INSERT INTO `cf_areas` VALUES ('330781', '兰溪市', '330700', '兰溪', '3', '0579', '321100', '中国,浙江省,金华市,兰溪市', '119.459650000000', '29.208410000000', 'Lanxi');
INSERT INTO `cf_areas` VALUES ('330782', '义乌市', '330700', '义乌', '3', '0579', '322000', '中国,浙江省,金华市,义乌市', '120.074400000000', '29.305580000000', 'Yiwu');
INSERT INTO `cf_areas` VALUES ('330783', '东阳市', '330700', '东阳', '3', '0579', '322100', '中国,浙江省,金华市,东阳市', '120.241850000000', '29.289420000000', 'Dongyang');
INSERT INTO `cf_areas` VALUES ('330784', '永康市', '330700', '永康', '3', '0579', '321300', '中国,浙江省,金华市,永康市', '120.047270000000', '28.888440000000', 'Yongkang');
INSERT INTO `cf_areas` VALUES ('330800', '衢州市', '330000', '衢州', '2', '0570', '324002', '中国,浙江省,衢州市', '118.872630000000', '28.941708000000', 'Quzhou');
INSERT INTO `cf_areas` VALUES ('330802', '柯城区', '330800', '柯城', '3', '0570', '324100', '中国,浙江省,衢州市,柯城区', '118.871090000000', '28.968580000000', 'Kecheng');
INSERT INTO `cf_areas` VALUES ('330803', '衢江区', '330800', '衢江', '3', '0570', '324022', '中国,浙江省,衢州市,衢江区', '118.959800000000', '28.979770000000', 'Qujiang');
INSERT INTO `cf_areas` VALUES ('330822', '常山县', '330800', '常山', '3', '0570', '324200', '中国,浙江省,衢州市,常山县', '118.510250000000', '28.901910000000', 'Changshan');
INSERT INTO `cf_areas` VALUES ('330824', '开化县', '330800', '开化', '3', '0570', '324300', '中国,浙江省,衢州市,开化县', '118.416160000000', '29.137850000000', 'Kaihua');
INSERT INTO `cf_areas` VALUES ('330825', '龙游县', '330800', '龙游', '3', '0570', '324400', '中国,浙江省,衢州市,龙游县', '119.172210000000', '29.028230000000', 'Longyou');
INSERT INTO `cf_areas` VALUES ('330881', '江山市', '330800', '江山', '3', '0570', '324100', '中国,浙江省,衢州市,江山市', '118.626740000000', '28.738600000000', 'Jiangshan');
INSERT INTO `cf_areas` VALUES ('330900', '舟山市', '330000', '舟山', '2', '0580', '316000', '中国,浙江省,舟山市', '122.106863000000', '30.016028000000', 'Zhoushan');
INSERT INTO `cf_areas` VALUES ('330902', '定海区', '330900', '定海', '3', '0580', '316000', '中国,浙江省,舟山市,定海区', '122.106770000000', '30.019850000000', 'Dinghai');
INSERT INTO `cf_areas` VALUES ('330903', '普陀区', '330900', '普陀', '3', '0580', '316100', '中国,浙江省,舟山市,普陀区', '122.302780000000', '29.949080000000', 'Putuo');
INSERT INTO `cf_areas` VALUES ('330921', '岱山县', '330900', '岱山', '3', '0580', '316200', '中国,浙江省,舟山市,岱山县', '122.204860000000', '30.243850000000', 'Daishan');
INSERT INTO `cf_areas` VALUES ('330922', '嵊泗县', '330900', '嵊泗', '3', '0580', '202450', '中国,浙江省,舟山市,嵊泗县', '122.451290000000', '30.726780000000', 'Shengsi');
INSERT INTO `cf_areas` VALUES ('331000', '台州市', '330000', '台州', '2', '0576', '318000', '中国,浙江省,台州市', '121.428599000000', '28.661378000000', 'Taizhou');
INSERT INTO `cf_areas` VALUES ('331002', '椒江区', '331000', '椒江', '3', '0576', '318000', '中国,浙江省,台州市,椒江区', '121.442870000000', '28.673010000000', 'Jiaojiang');
INSERT INTO `cf_areas` VALUES ('331003', '黄岩区', '331000', '黄岩', '3', '0576', '318020', '中国,浙江省,台州市,黄岩区', '121.258910000000', '28.650770000000', 'Huangyan');
INSERT INTO `cf_areas` VALUES ('331004', '路桥区', '331000', '路桥', '3', '0576', '318050', '中国,浙江省,台州市,路桥区', '121.373810000000', '28.580160000000', 'Luqiao');
INSERT INTO `cf_areas` VALUES ('331021', '玉环县', '331000', '玉环', '3', '0576', '317600', '中国,浙江省,台州市,玉环县', '121.232420000000', '28.136370000000', 'Yuhuan');
INSERT INTO `cf_areas` VALUES ('331022', '三门县', '331000', '三门', '3', '0576', '317100', '中国,浙江省,台州市,三门县', '121.393700000000', '29.105100000000', 'Sanmen');
INSERT INTO `cf_areas` VALUES ('331023', '天台县', '331000', '天台', '3', '0576', '317200', '中国,浙江省,台州市,天台县', '121.008480000000', '29.142900000000', 'Tiantai');
INSERT INTO `cf_areas` VALUES ('331024', '仙居县', '331000', '仙居', '3', '0576', '317300', '中国,浙江省,台州市,仙居县', '120.728720000000', '28.846720000000', 'Xianju');
INSERT INTO `cf_areas` VALUES ('331081', '温岭市', '331000', '温岭', '3', '0576', '317500', '中国,浙江省,台州市,温岭市', '121.385950000000', '28.371760000000', 'Wenling');
INSERT INTO `cf_areas` VALUES ('331082', '临海市', '331000', '临海', '3', '0576', '317000', '中国,浙江省,台州市,临海市', '121.138850000000', '28.856030000000', 'Linhai');
INSERT INTO `cf_areas` VALUES ('331100', '丽水市', '330000', '丽水', '2', '0578', '323000', '中国,浙江省,丽水市', '119.921786000000', '28.451993000000', 'Lishui');
INSERT INTO `cf_areas` VALUES ('331102', '莲都区', '331100', '莲都', '3', '0578', '323000', '中国,浙江省,丽水市,莲都区', '119.912700000000', '28.445830000000', 'Liandu');
INSERT INTO `cf_areas` VALUES ('331121', '青田县', '331100', '青田', '3', '0578', '323900', '中国,浙江省,丽水市,青田县', '120.290280000000', '28.138970000000', 'Qingtian');
INSERT INTO `cf_areas` VALUES ('331122', '缙云县', '331100', '缙云', '3', '0578', '321400', '中国,浙江省,丽水市,缙云县', '120.090360000000', '28.659440000000', 'Jinyun');
INSERT INTO `cf_areas` VALUES ('331123', '遂昌县', '331100', '遂昌', '3', '0578', '323300', '中国,浙江省,丽水市,遂昌县', '119.276060000000', '28.592910000000', 'Suichang');
INSERT INTO `cf_areas` VALUES ('331124', '松阳县', '331100', '松阳', '3', '0578', '323400', '中国,浙江省,丽水市,松阳县', '119.481990000000', '28.449400000000', 'Songyang');
INSERT INTO `cf_areas` VALUES ('331125', '云和县', '331100', '云和', '3', '0578', '323600', '中国,浙江省,丽水市,云和县', '119.572870000000', '28.116430000000', 'Yunhe');
INSERT INTO `cf_areas` VALUES ('331126', '庆元县', '331100', '庆元', '3', '0578', '323800', '中国,浙江省,丽水市,庆元县', '119.062560000000', '27.618420000000', 'Qingyuan');
INSERT INTO `cf_areas` VALUES ('331127', '景宁畲族自治县', '331100', '景宁', '3', '0578', '323500', '中国,浙江省,丽水市,景宁畲族自治县', '119.638390000000', '27.973930000000', 'Jingning');
INSERT INTO `cf_areas` VALUES ('331181', '龙泉市', '331100', '龙泉', '3', '0578', '323700', '中国,浙江省,丽水市,龙泉市', '119.141630000000', '28.074300000000', 'Longquan');
INSERT INTO `cf_areas` VALUES ('331200', '舟山群岛新区', '330000', '舟山新区', '2', '0580', '316000', '中国,浙江省,舟山群岛新区', '122.317657000000', '29.813242000000', 'Zhoushan');
INSERT INTO `cf_areas` VALUES ('331201', '金塘岛', '331200', '金塘', '3', '0580', '316000', '中国,浙江省,舟山群岛新区,金塘岛', '121.893373000000', '30.040641000000', 'Jintang');
INSERT INTO `cf_areas` VALUES ('331202', '六横岛', '331200', '六横', '3', '0580', '316000', '中国,浙江省,舟山群岛新区,六横岛', '122.142650000000', '29.662938000000', 'Liuheng');
INSERT INTO `cf_areas` VALUES ('331203', '衢山岛', '331200', '衢山', '3', '0580', '316000', '中国,浙江省,舟山群岛新区,衢山岛', '122.358425000000', '30.442642000000', 'Qushan');
INSERT INTO `cf_areas` VALUES ('331204', '舟山本岛西北部', '331200', '舟山', '3', '0580', '316000', '中国,浙江省,舟山群岛新区,舟山本岛西北部', '122.030640000000', '30.140377000000', 'Zhoushan');
INSERT INTO `cf_areas` VALUES ('331205', '岱山岛西南部', '331200', '岱山', '3', '0580', '316000', '中国,浙江省,舟山群岛新区,岱山岛西南部', '122.180123000000', '30.277269000000', 'Daishan');
INSERT INTO `cf_areas` VALUES ('331206', '泗礁岛', '331200', '泗礁', '3', '0580', '316000', '中国,浙江省,舟山群岛新区,泗礁岛', '122.458030000000', '30.725112000000', 'Sijiao');
INSERT INTO `cf_areas` VALUES ('331207', '朱家尖岛', '331200', '朱家尖', '3', '0580', '316000', '中国,浙江省,舟山群岛新区,朱家尖岛', '122.390636000000', '29.916303000000', 'Zhujiajian');
INSERT INTO `cf_areas` VALUES ('331208', '洋山岛', '331200', '洋山', '3', '0580', '316000', '中国,浙江省,舟山群岛新区,洋山岛', '121.995891000000', '30.094637000000', 'Yangshan');
INSERT INTO `cf_areas` VALUES ('331209', '长涂岛', '331200', '长涂', '3', '0580', '316000', '中国,浙江省,舟山群岛新区,长涂岛', '122.284681000000', '30.248880000000', 'Changtu');
INSERT INTO `cf_areas` VALUES ('331210', '虾峙岛', '331200', '虾峙', '3', '0580', '316000', '中国,浙江省,舟山群岛新区,虾峙岛', '122.244686000000', '29.752941000000', 'Xiazhi');
INSERT INTO `cf_areas` VALUES ('340000', '安徽省', '100000', '安徽', '1', '', '', '中国,安徽省', '117.283042000000', '31.861190000000', 'Anhui');
INSERT INTO `cf_areas` VALUES ('340100', '合肥市', '340000', '合肥', '2', '0551', '230001', '中国,安徽省,合肥市', '117.283042000000', '31.861190000000', 'Hefei');
INSERT INTO `cf_areas` VALUES ('340102', '瑶海区', '340100', '瑶海', '3', '0551', '230011', '中国,安徽省,合肥市,瑶海区', '117.309470000000', '31.858090000000', 'Yaohai');
INSERT INTO `cf_areas` VALUES ('340103', '庐阳区', '340100', '庐阳', '3', '0551', '230001', '中国,安徽省,合肥市,庐阳区', '117.264520000000', '31.878740000000', 'Luyang');
INSERT INTO `cf_areas` VALUES ('340104', '蜀山区', '340100', '蜀山', '3', '0551', '230031', '中国,安徽省,合肥市,蜀山区', '117.261040000000', '31.851170000000', 'Shushan');
INSERT INTO `cf_areas` VALUES ('340111', '包河区', '340100', '包河', '3', '0551', '230041', '中国,安徽省,合肥市,包河区', '117.309840000000', '31.795020000000', 'Baohe');
INSERT INTO `cf_areas` VALUES ('340121', '长丰县', '340100', '长丰', '3', '0551', '231100', '中国,安徽省,合肥市,长丰县', '117.165490000000', '32.479590000000', 'Changfeng');
INSERT INTO `cf_areas` VALUES ('340122', '肥东县', '340100', '肥东', '3', '0551', '231600', '中国,安徽省,合肥市,肥东县', '117.471280000000', '31.885250000000', 'Feidong');
INSERT INTO `cf_areas` VALUES ('340123', '肥西县', '340100', '肥西', '3', '0551', '231200', '中国,安徽省,合肥市,肥西县', '117.168450000000', '31.721430000000', 'Feixi');
INSERT INTO `cf_areas` VALUES ('340124', '庐江县', '340100', '庐江', '3', '0565', '231500', '中国,安徽省,合肥市,庐江县', '117.289844000000', '31.251488000000', 'Lujiang');
INSERT INTO `cf_areas` VALUES ('340181', '巢湖市', '340100', '巢湖', '3', '0565', '238000', '中国,安徽省,合肥市,巢湖市', '117.874155000000', '31.600518000000', 'Chaohu');
INSERT INTO `cf_areas` VALUES ('340200', '芜湖市', '340000', '芜湖', '2', '0551', '241000', '中国,安徽省,芜湖市', '118.376451000000', '31.326319000000', 'Wuhu');
INSERT INTO `cf_areas` VALUES ('340202', '镜湖区', '340200', '镜湖', '3', '0553', '241000', '中国,安徽省,芜湖市,镜湖区', '118.385250000000', '31.340380000000', 'Jinghu');
INSERT INTO `cf_areas` VALUES ('340203', '弋江区', '340200', '弋江', '3', '0553', '241000', '中国,安徽省,芜湖市,弋江区', '118.372650000000', '31.311780000000', 'Yijiang');
INSERT INTO `cf_areas` VALUES ('340207', '鸠江区', '340200', '鸠江', '3', '0553', '241000', '中国,安徽省,芜湖市,鸠江区', '118.392150000000', '31.369280000000', 'Jiujiang');
INSERT INTO `cf_areas` VALUES ('340208', '三山区', '340200', '三山', '3', '0553', '241000', '中国,安徽省,芜湖市,三山区', '118.225090000000', '31.207030000000', 'Sanshan');
INSERT INTO `cf_areas` VALUES ('340221', '芜湖县', '340200', '芜湖', '3', '0553', '241100', '中国,安徽省,芜湖市,芜湖县', '118.575250000000', '31.134760000000', 'Wuhu');
INSERT INTO `cf_areas` VALUES ('340222', '繁昌县', '340200', '繁昌', '3', '0553', '241200', '中国,安徽省,芜湖市,繁昌县', '118.199820000000', '31.083190000000', 'Fanchang');
INSERT INTO `cf_areas` VALUES ('340223', '南陵县', '340200', '南陵', '3', '0553', '242400', '中国,安徽省,芜湖市,南陵县', '118.336880000000', '30.919690000000', 'Nanling');
INSERT INTO `cf_areas` VALUES ('340225', '无为县', '340200', '无为', '3', '0565', '238300', '中国,安徽省,芜湖市,无为县', '117.911432000000', '31.303075000000', 'Wuwei');
INSERT INTO `cf_areas` VALUES ('340300', '蚌埠市', '340000', '蚌埠', '2', '0552', '233000', '中国,安徽省,蚌埠市', '117.362370000000', '32.934037000000', 'Bengbu');
INSERT INTO `cf_areas` VALUES ('340302', '龙子湖区', '340300', '龙子湖', '3', '0552', '233000', '中国,安徽省,蚌埠市,龙子湖区', '117.393790000000', '32.943010000000', 'Longzihu');
INSERT INTO `cf_areas` VALUES ('340303', '蚌山区', '340300', '蚌山', '3', '0552', '233000', '中国,安徽省,蚌埠市,蚌山区', '117.367670000000', '32.944110000000', 'Bengshan');
INSERT INTO `cf_areas` VALUES ('340304', '禹会区', '340300', '禹会', '3', '0552', '233010', '中国,安徽省,蚌埠市,禹会区', '117.353150000000', '32.933360000000', 'Yuhui');
INSERT INTO `cf_areas` VALUES ('340311', '淮上区', '340300', '淮上', '3', '0552', '233002', '中国,安徽省,蚌埠市,淮上区', '117.359830000000', '32.964230000000', 'Huaishang');
INSERT INTO `cf_areas` VALUES ('340321', '怀远县', '340300', '怀远', '3', '0552', '233400', '中国,安徽省,蚌埠市,怀远县', '117.205070000000', '32.970070000000', 'Huaiyuan');
INSERT INTO `cf_areas` VALUES ('340322', '五河县', '340300', '五河', '3', '0552', '233300', '中国,安徽省,蚌埠市,五河县', '117.891440000000', '33.144570000000', 'Wuhe');
INSERT INTO `cf_areas` VALUES ('340323', '固镇县', '340300', '固镇', '3', '0552', '233700', '中国,安徽省,蚌埠市,固镇县', '117.315580000000', '33.318030000000', 'Guzhen');
INSERT INTO `cf_areas` VALUES ('340400', '淮南市', '340000', '淮南', '2', '0554', '232001', '中国,安徽省,淮南市', '117.025449000000', '32.645947000000', 'Huainan');
INSERT INTO `cf_areas` VALUES ('340402', '大通区', '340400', '大通', '3', '0554', '232033', '中国,安徽省,淮南市,大通区', '117.052550000000', '32.632650000000', 'Datong');
INSERT INTO `cf_areas` VALUES ('340403', '田家庵区', '340400', '田家庵', '3', '0554', '232000', '中国,安徽省,淮南市,田家庵区', '117.017390000000', '32.646970000000', 'Tianjiaan');
INSERT INTO `cf_areas` VALUES ('340404', '谢家集区', '340400', '谢家集', '3', '0554', '232052', '中国,安徽省,淮南市,谢家集区', '116.863770000000', '32.598180000000', 'Xiejiaji');
INSERT INTO `cf_areas` VALUES ('340405', '八公山区', '340400', '八公山', '3', '0554', '232072', '中国,安徽省,淮南市,八公山区', '116.836940000000', '32.629410000000', 'Bagongshan');
INSERT INTO `cf_areas` VALUES ('340406', '潘集区', '340400', '潘集', '3', '0554', '232082', '中国,安徽省,淮南市,潘集区', '116.816220000000', '32.782870000000', 'Panji');
INSERT INTO `cf_areas` VALUES ('340421', '凤台县', '340400', '凤台', '3', '0554', '232100', '中国,安徽省,淮南市,凤台县', '116.715690000000', '32.707520000000', 'Fengtai');
INSERT INTO `cf_areas` VALUES ('340500', '马鞍山市', '340000', '马鞍山', '2', '0555', '243001', '中国,安徽省,马鞍山市', '118.507906000000', '31.689362000000', 'Ma\'anshan');
INSERT INTO `cf_areas` VALUES ('340503', '花山区', '340500', '花山', '3', '0555', '243000', '中国,安徽省,马鞍山市,花山区', '118.512310000000', '31.700100000000', 'Huashan');
INSERT INTO `cf_areas` VALUES ('340504', '雨山区', '340500', '雨山', '3', '0555', '243071', '中国,安徽省,马鞍山市,雨山区', '118.498690000000', '31.682190000000', 'Yushan');
INSERT INTO `cf_areas` VALUES ('340506', '博望区', '340500', '博望', '3', '0555', '243131', '中国,安徽省,马鞍山市,博望区', '118.844387000000', '31.561871000000', 'Bowang');
INSERT INTO `cf_areas` VALUES ('340521', '当涂县', '340500', '当涂', '3', '0555', '243100', '中国,安徽省,马鞍山市,当涂县', '118.497860000000', '31.570980000000', 'Dangtu');
INSERT INTO `cf_areas` VALUES ('340522', '含山县', '340500', '含山', '3', '0555', '238100', '中国,安徽省,马鞍山市,含山县', '118.105545000000', '31.727758000000', 'Hanshan ');
INSERT INTO `cf_areas` VALUES ('340523', '和县', '340500', '和县', '3', '0555', '238200', '中国,安徽省,马鞍山市,和县', '118.351405000000', '31.741794000000', 'Hexian');
INSERT INTO `cf_areas` VALUES ('340600', '淮北市', '340000', '淮北', '2', '0561', '235000', '中国,安徽省,淮北市', '116.794664000000', '33.971707000000', 'Huaibei');
INSERT INTO `cf_areas` VALUES ('340602', '杜集区', '340600', '杜集', '3', '0561', '235000', '中国,安徽省,淮北市,杜集区', '116.829980000000', '33.993630000000', 'Duji');
INSERT INTO `cf_areas` VALUES ('340603', '相山区', '340600', '相山', '3', '0561', '235000', '中国,安徽省,淮北市,相山区', '116.794640000000', '33.959790000000', 'Xiangshan');
INSERT INTO `cf_areas` VALUES ('340604', '烈山区', '340600', '烈山', '3', '0561', '235000', '中国,安徽省,淮北市,烈山区', '116.814480000000', '33.893550000000', 'Lieshan');
INSERT INTO `cf_areas` VALUES ('340621', '濉溪县', '340600', '濉溪', '3', '0561', '235100', '中国,安徽省,淮北市,濉溪县', '116.767850000000', '33.914550000000', 'Suixi');
INSERT INTO `cf_areas` VALUES ('340700', '铜陵市', '340000', '铜陵', '2', '0562', '244000', '中国,安徽省,铜陵市', '117.816576000000', '30.929935000000', 'Tongling');
INSERT INTO `cf_areas` VALUES ('340702', '铜官山区', '340700', '铜官山', '3', '0562', '244000', '中国,安徽省,铜陵市,铜官山区', '117.815250000000', '30.934230000000', 'Tongguanshan');
INSERT INTO `cf_areas` VALUES ('340703', '狮子山区', '340700', '狮子山', '3', '0562', '244000', '中国,安徽省,铜陵市,狮子山区', '117.891780000000', '30.926310000000', 'Shizishan');
INSERT INTO `cf_areas` VALUES ('340711', '郊区', '340700', '郊区', '3', '0562', '244000', '中国,安徽省,铜陵市,郊区', '117.808680000000', '30.919760000000', 'Jiaoqu');
INSERT INTO `cf_areas` VALUES ('340721', '铜陵县', '340700', '铜陵', '3', '0562', '244100', '中国,安徽省,铜陵市,铜陵县', '117.791130000000', '30.953650000000', 'Tongling');
INSERT INTO `cf_areas` VALUES ('340800', '安庆市', '340000', '安庆', '2', '0556', '246001', '中国,安徽省,安庆市', '117.053571000000', '30.524816000000', 'Anqing');
INSERT INTO `cf_areas` VALUES ('340802', '迎江区', '340800', '迎江', '3', '0556', '246001', '中国,安徽省,安庆市,迎江区', '117.049300000000', '30.504210000000', 'Yingjiang');
INSERT INTO `cf_areas` VALUES ('340803', '大观区', '340800', '大观', '3', '0556', '246002', '中国,安徽省,安庆市,大观区', '117.034260000000', '30.512160000000', 'Daguan');
INSERT INTO `cf_areas` VALUES ('340811', '宜秀区', '340800', '宜秀', '3', '0556', '246003', '中国,安徽省,安庆市,宜秀区', '117.061270000000', '30.507830000000', 'Yixiu');
INSERT INTO `cf_areas` VALUES ('340822', '怀宁县', '340800', '怀宁', '3', '0556', '246100', '中国,安徽省,安庆市,怀宁县', '116.829680000000', '30.733760000000', 'Huaining');
INSERT INTO `cf_areas` VALUES ('340823', '枞阳县', '340800', '枞阳', '3', '0556', '246700', '中国,安徽省,安庆市,枞阳县', '117.220150000000', '30.699560000000', 'Zongyang');
INSERT INTO `cf_areas` VALUES ('340824', '潜山县', '340800', '潜山', '3', '0556', '246300', '中国,安徽省,安庆市,潜山县', '116.575740000000', '30.630370000000', 'Qianshan');
INSERT INTO `cf_areas` VALUES ('340825', '太湖县', '340800', '太湖', '3', '0556', '246400', '中国,安徽省,安庆市,太湖县', '116.308800000000', '30.454100000000', 'Taihu');
INSERT INTO `cf_areas` VALUES ('340826', '宿松县', '340800', '宿松', '3', '0556', '246500', '中国,安徽省,安庆市,宿松县', '116.129150000000', '30.153600000000', 'Susong');
INSERT INTO `cf_areas` VALUES ('340827', '望江县', '340800', '望江', '3', '0556', '246200', '中国,安徽省,安庆市,望江县', '116.688140000000', '30.125850000000', 'Wangjiang');
INSERT INTO `cf_areas` VALUES ('340828', '岳西县', '340800', '岳西', '3', '0556', '246600', '中国,安徽省,安庆市,岳西县', '116.359950000000', '30.849830000000', 'Yuexi');
INSERT INTO `cf_areas` VALUES ('340881', '桐城市', '340800', '桐城', '3', '0556', '231400', '中国,安徽省,安庆市,桐城市', '116.950710000000', '31.052160000000', 'Tongcheng');
INSERT INTO `cf_areas` VALUES ('341000', '黄山市', '340000', '黄山', '2', '0559', '245000', '中国,安徽省,黄山市', '118.317325000000', '29.709239000000', 'Huangshan');
INSERT INTO `cf_areas` VALUES ('341002', '屯溪区', '341000', '屯溪', '3', '0559', '245000', '中国,安徽省,黄山市,屯溪区', '118.333680000000', '29.711380000000', 'Tunxi');
INSERT INTO `cf_areas` VALUES ('341003', '黄山区', '341000', '黄山', '3', '0559', '242700', '中国,安徽省,黄山市,黄山区', '118.141600000000', '30.272900000000', 'Huangshan');
INSERT INTO `cf_areas` VALUES ('341004', '徽州区', '341000', '徽州', '3', '0559', '245061', '中国,安徽省,黄山市,徽州区', '118.336540000000', '29.827840000000', 'Huizhou');
INSERT INTO `cf_areas` VALUES ('341021', '歙县', '341000', '歙县', '3', '0559', '245200', '中国,安徽省,黄山市,歙县', '118.436760000000', '29.867450000000', 'Shexian');
INSERT INTO `cf_areas` VALUES ('341022', '休宁县', '341000', '休宁', '3', '0559', '245400', '中国,安徽省,黄山市,休宁县', '118.181360000000', '29.786070000000', 'Xiuning');
INSERT INTO `cf_areas` VALUES ('341023', '黟县', '341000', '黟县', '3', '0559', '245500', '中国,安徽省,黄山市,黟县', '117.941370000000', '29.925880000000', 'Yixian');
INSERT INTO `cf_areas` VALUES ('341024', '祁门县', '341000', '祁门', '3', '0559', '245600', '中国,安徽省,黄山市,祁门县', '117.718470000000', '29.857230000000', 'Qimen');
INSERT INTO `cf_areas` VALUES ('341100', '滁州市', '340000', '滁州', '2', '0550', '239000', '中国,安徽省,滁州市', '118.316264000000', '32.303627000000', 'Chuzhou');
INSERT INTO `cf_areas` VALUES ('341102', '琅琊区', '341100', '琅琊', '3', '0550', '239000', '中国,安徽省,滁州市,琅琊区', '118.305380000000', '32.295210000000', 'Langya');
INSERT INTO `cf_areas` VALUES ('341103', '南谯区', '341100', '南谯', '3', '0550', '239000', '中国,安徽省,滁州市,南谯区', '118.312220000000', '32.318610000000', 'Nanqiao');
INSERT INTO `cf_areas` VALUES ('341122', '来安县', '341100', '来安', '3', '0550', '239200', '中国,安徽省,滁州市,来安县', '118.434380000000', '32.451760000000', 'Lai\'an');
INSERT INTO `cf_areas` VALUES ('341124', '全椒县', '341100', '全椒', '3', '0550', '239500', '中国,安徽省,滁州市,全椒县', '118.272910000000', '32.085240000000', 'Quanjiao');
INSERT INTO `cf_areas` VALUES ('341125', '定远县', '341100', '定远', '3', '0550', '233200', '中国,安徽省,滁州市,定远县', '117.680350000000', '32.524880000000', 'Dingyuan');
INSERT INTO `cf_areas` VALUES ('341126', '凤阳县', '341100', '凤阳', '3', '0550', '233100', '中国,安徽省,滁州市,凤阳县', '117.564540000000', '32.865070000000', 'Fengyang');
INSERT INTO `cf_areas` VALUES ('341181', '天长市', '341100', '天长', '3', '0550', '239300', '中国,安徽省,滁州市,天长市', '118.998680000000', '32.691240000000', 'Tianchang');
INSERT INTO `cf_areas` VALUES ('341182', '明光市', '341100', '明光', '3', '0550', '239400', '中国,安徽省,滁州市,明光市', '117.990930000000', '32.778190000000', 'Mingguang');
INSERT INTO `cf_areas` VALUES ('341200', '阜阳市', '340000', '阜阳', '2', '0558', '236033', '中国,安徽省,阜阳市', '115.819729000000', '32.896969000000', 'Fuyang');
INSERT INTO `cf_areas` VALUES ('341202', '颍州区', '341200', '颍州', '3', '0558', '236001', '中国,安徽省,阜阳市,颍州区', '115.806940000000', '32.883460000000', 'Yingzhou');
INSERT INTO `cf_areas` VALUES ('341203', '颍东区', '341200', '颍东', '3', '0558', '236058', '中国,安徽省,阜阳市,颍东区', '115.856590000000', '32.912960000000', 'Yingdong');
INSERT INTO `cf_areas` VALUES ('341204', '颍泉区', '341200', '颍泉', '3', '0558', '236045', '中国,安徽省,阜阳市,颍泉区', '115.807120000000', '32.924900000000', 'Yingquan');
INSERT INTO `cf_areas` VALUES ('341221', '临泉县', '341200', '临泉', '3', '0558', '236400', '中国,安徽省,阜阳市,临泉县', '115.262320000000', '33.067580000000', 'Linquan');
INSERT INTO `cf_areas` VALUES ('341222', '太和县', '341200', '太和', '3', '0558', '236600', '中国,安徽省,阜阳市,太和县', '115.621910000000', '33.160250000000', 'Taihe');
INSERT INTO `cf_areas` VALUES ('341225', '阜南县', '341200', '阜南', '3', '0558', '236300', '中国,安徽省,阜阳市,阜南县', '115.585630000000', '32.635510000000', 'Funan');
INSERT INTO `cf_areas` VALUES ('341226', '颍上县', '341200', '颍上', '3', '0558', '236200', '中国,安徽省,阜阳市,颍上县', '116.264580000000', '32.629980000000', 'Yingshang');
INSERT INTO `cf_areas` VALUES ('341282', '界首市', '341200', '界首', '3', '0558', '236500', '中国,安徽省,阜阳市,界首市', '115.374450000000', '33.257140000000', 'Jieshou');
INSERT INTO `cf_areas` VALUES ('341300', '宿州市', '340000', '宿州', '2', '0557', '234000', '中国,安徽省,宿州市', '116.984084000000', '33.633891000000', 'Suzhou');
INSERT INTO `cf_areas` VALUES ('341302', '埇桥区', '341300', '埇桥', '3', '0557', '234000', '中国,安徽省,宿州市,埇桥区', '116.977310000000', '33.640580000000', 'Yongqiao');
INSERT INTO `cf_areas` VALUES ('341321', '砀山县', '341300', '砀山', '3', '0557', '235300', '中国,安徽省,宿州市,砀山县', '116.353630000000', '34.423560000000', 'Dangshan');
INSERT INTO `cf_areas` VALUES ('341322', '萧县', '341300', '萧县', '3', '0557', '235200', '中国,安徽省,宿州市,萧县', '116.945460000000', '34.187900000000', 'Xiaoxian');
INSERT INTO `cf_areas` VALUES ('341323', '灵璧县', '341300', '灵璧', '3', '0557', '234200', '中国,安徽省,宿州市,灵璧县', '117.558130000000', '33.543390000000', 'Lingbi');
INSERT INTO `cf_areas` VALUES ('341324', '泗县', '341300', '泗县', '3', '0557', '234300', '中国,安徽省,宿州市,泗县', '117.910330000000', '33.482950000000', 'Sixian');
INSERT INTO `cf_areas` VALUES ('341500', '六安市', '340000', '六安', '2', '0564', '237000', '中国,安徽省,六安市', '116.507676000000', '31.752889000000', 'Lu\'an');
INSERT INTO `cf_areas` VALUES ('341502', '金安区', '341500', '金安', '3', '0564', '237005', '中国,安徽省,六安市,金安区', '116.509120000000', '31.755730000000', 'Jin\'an');
INSERT INTO `cf_areas` VALUES ('341503', '裕安区', '341500', '裕安', '3', '0564', '237010', '中国,安徽省,六安市,裕安区', '116.479850000000', '31.737870000000', 'Yu\'an');
INSERT INTO `cf_areas` VALUES ('341521', '寿县', '341500', '寿县', '3', '0564', '232200', '中国,安徽省,六安市,寿县', '116.784660000000', '32.576530000000', 'Shouxian');
INSERT INTO `cf_areas` VALUES ('341522', '霍邱县', '341500', '霍邱', '3', '0564', '237400', '中国,安徽省,六安市,霍邱县', '116.277950000000', '32.353000000000', 'Huoqiu');
INSERT INTO `cf_areas` VALUES ('341523', '舒城县', '341500', '舒城', '3', '0564', '231300', '中国,安徽省,六安市,舒城县', '116.944910000000', '31.464130000000', 'Shucheng');
INSERT INTO `cf_areas` VALUES ('341524', '金寨县', '341500', '金寨', '3', '0564', '237300', '中国,安徽省,六安市,金寨县', '115.934630000000', '31.735100000000', 'Jinzhai');
INSERT INTO `cf_areas` VALUES ('341525', '霍山县', '341500', '霍山', '3', '0564', '237200', '中国,安徽省,六安市,霍山县', '116.332910000000', '31.392900000000', 'Huoshan');
INSERT INTO `cf_areas` VALUES ('341600', '亳州市', '340000', '亳州', '2', '0558', '236802', '中国,安徽省,亳州市', '115.782939000000', '33.869338000000', 'Bozhou');
INSERT INTO `cf_areas` VALUES ('341602', '谯城区', '341600', '谯城', '3', '0558', '236800', '中国,安徽省,亳州市,谯城区', '115.779410000000', '33.875320000000', 'Qiaocheng');
INSERT INTO `cf_areas` VALUES ('341621', '涡阳县', '341600', '涡阳', '3', '0558', '233600', '中国,安徽省,亳州市,涡阳县', '116.216820000000', '33.509110000000', 'Guoyang');
INSERT INTO `cf_areas` VALUES ('341622', '蒙城县', '341600', '蒙城', '3', '0558', '233500', '中国,安徽省,亳州市,蒙城县', '116.564600000000', '33.264770000000', 'Mengcheng');
INSERT INTO `cf_areas` VALUES ('341623', '利辛县', '341600', '利辛', '3', '0558', '236700', '中国,安徽省,亳州市,利辛县', '116.208000000000', '33.141980000000', 'Lixin');
INSERT INTO `cf_areas` VALUES ('341700', '池州市', '340000', '池州', '2', '0566', '247100', '中国,安徽省,池州市', '117.489157000000', '30.656037000000', 'Chizhou');
INSERT INTO `cf_areas` VALUES ('341702', '贵池区', '341700', '贵池', '3', '0566', '247100', '中国,安徽省,池州市,贵池区', '117.487220000000', '30.652830000000', 'Guichi');
INSERT INTO `cf_areas` VALUES ('341721', '东至县', '341700', '东至', '3', '0566', '247200', '中国,安徽省,池州市,东至县', '117.027190000000', '30.096900000000', 'Dongzhi');
INSERT INTO `cf_areas` VALUES ('341722', '石台县', '341700', '石台', '3', '0566', '245100', '中国,安徽省,池州市,石台县', '117.486660000000', '30.210420000000', 'Shitai');
INSERT INTO `cf_areas` VALUES ('341723', '青阳县', '341700', '青阳', '3', '0566', '242800', '中国,安徽省,池州市,青阳县', '117.847440000000', '30.639320000000', 'Qingyang');
INSERT INTO `cf_areas` VALUES ('341800', '宣城市', '340000', '宣城', '2', '0563', '242000', '中国,安徽省,宣城市', '118.757995000000', '30.945667000000', 'Xuancheng');
INSERT INTO `cf_areas` VALUES ('341802', '宣州区', '341800', '宣州', '3', '0563', '242000', '中国,安徽省,宣城市,宣州区', '118.754620000000', '30.944390000000', 'Xuanzhou');
INSERT INTO `cf_areas` VALUES ('341821', '郎溪县', '341800', '郎溪', '3', '0563', '242100', '中国,安徽省,宣城市,郎溪县', '119.179230000000', '31.125990000000', 'Langxi');
INSERT INTO `cf_areas` VALUES ('341822', '广德县', '341800', '广德', '3', '0563', '242200', '中国,安徽省,宣城市,广德县', '119.417690000000', '30.893710000000', 'Guangde');
INSERT INTO `cf_areas` VALUES ('341823', '泾县', '341800', '泾县', '3', '0563', '242500', '中国,安徽省,宣城市,泾县', '118.419640000000', '30.694980000000', 'Jingxian');
INSERT INTO `cf_areas` VALUES ('341824', '绩溪县', '341800', '绩溪', '3', '0563', '245300', '中国,安徽省,宣城市,绩溪县', '118.597650000000', '30.070690000000', 'Jixi');
INSERT INTO `cf_areas` VALUES ('341825', '旌德县', '341800', '旌德', '3', '0563', '242600', '中国,安徽省,宣城市,旌德县', '118.542990000000', '30.288980000000', 'Jingde');
INSERT INTO `cf_areas` VALUES ('341881', '宁国市', '341800', '宁国', '3', '0563', '242300', '中国,安徽省,宣城市,宁国市', '118.983490000000', '30.623800000000', 'Ningguo');
INSERT INTO `cf_areas` VALUES ('350000', '福建省', '100000', '福建', '1', '', '', '中国,福建省', '119.306239000000', '26.075302000000', 'Fujian');
INSERT INTO `cf_areas` VALUES ('350100', '福州市', '350000', '福州', '2', '0591', '350001', '中国,福建省,福州市', '119.306239000000', '26.075302000000', 'Fuzhou');
INSERT INTO `cf_areas` VALUES ('350102', '鼓楼区', '350100', '鼓楼', '3', '0591', '350001', '中国,福建省,福州市,鼓楼区', '119.303840000000', '26.082250000000', 'Gulou');
INSERT INTO `cf_areas` VALUES ('350103', '台江区', '350100', '台江', '3', '0591', '350004', '中国,福建省,福州市,台江区', '119.308990000000', '26.062040000000', 'Taijiang');
INSERT INTO `cf_areas` VALUES ('350104', '仓山区', '350100', '仓山', '3', '0591', '350007', '中国,福建省,福州市,仓山区', '119.315430000000', '26.043350000000', 'Cangshan');
INSERT INTO `cf_areas` VALUES ('350105', '马尾区', '350100', '马尾', '3', '0591', '350015', '中国,福建省,福州市,马尾区', '119.455500000000', '25.989420000000', 'Mawei');
INSERT INTO `cf_areas` VALUES ('350111', '晋安区', '350100', '晋安', '3', '0591', '350011', '中国,福建省,福州市,晋安区', '119.328280000000', '26.081800000000', 'Jin\'an');
INSERT INTO `cf_areas` VALUES ('350121', '闽侯县', '350100', '闽侯', '3', '0591', '350100', '中国,福建省,福州市,闽侯县', '119.133880000000', '26.150140000000', 'Minhou');
INSERT INTO `cf_areas` VALUES ('350122', '连江县', '350100', '连江', '3', '0591', '350500', '中国,福建省,福州市,连江县', '119.534330000000', '26.194660000000', 'Lianjiang');
INSERT INTO `cf_areas` VALUES ('350123', '罗源县', '350100', '罗源', '3', '0591', '350600', '中国,福建省,福州市,罗源县', '119.550900000000', '26.487520000000', 'Luoyuan');
INSERT INTO `cf_areas` VALUES ('350124', '闽清县', '350100', '闽清', '3', '0591', '350800', '中国,福建省,福州市,闽清县', '118.862300000000', '26.219010000000', 'Minqing');
INSERT INTO `cf_areas` VALUES ('350125', '永泰县', '350100', '永泰', '3', '0591', '350700', '中国,福建省,福州市,永泰县', '118.936000000000', '25.868160000000', 'Yongtai');
INSERT INTO `cf_areas` VALUES ('350128', '平潭县', '350100', '平潭', '3', '0591', '350400', '中国,福建省,福州市,平潭县', '119.791197000000', '25.503672000000', 'Pingtan');
INSERT INTO `cf_areas` VALUES ('350181', '福清市', '350100', '福清', '3', '0591', '350300', '中国,福建省,福州市,福清市', '119.385070000000', '25.720860000000', 'Fuqing');
INSERT INTO `cf_areas` VALUES ('350182', '长乐市', '350100', '长乐', '3', '0591', '350200', '中国,福建省,福州市,长乐市', '119.523130000000', '25.962760000000', 'Changle');
INSERT INTO `cf_areas` VALUES ('350200', '厦门市', '350000', '厦门', '2', '0592', '361003', '中国,福建省,厦门市', '118.110220000000', '24.490474000000', 'Xiamen');
INSERT INTO `cf_areas` VALUES ('350203', '思明区', '350200', '思明', '3', '0592', '361001', '中国,福建省,厦门市,思明区', '118.082330000000', '24.445430000000', 'Siming');
INSERT INTO `cf_areas` VALUES ('350205', '海沧区', '350200', '海沧', '3', '0592', '361026', '中国,福建省,厦门市,海沧区', '118.032890000000', '24.484610000000', 'Haicang');
INSERT INTO `cf_areas` VALUES ('350206', '湖里区', '350200', '湖里', '3', '0592', '361006', '中国,福建省,厦门市,湖里区', '118.146210000000', '24.512530000000', 'Huli');
INSERT INTO `cf_areas` VALUES ('350211', '集美区', '350200', '集美', '3', '0592', '361021', '中国,福建省,厦门市,集美区', '118.097190000000', '24.575840000000', 'Jimei');
INSERT INTO `cf_areas` VALUES ('350212', '同安区', '350200', '同安', '3', '0592', '361100', '中国,福建省,厦门市,同安区', '118.151970000000', '24.723080000000', 'Tong\'an');
INSERT INTO `cf_areas` VALUES ('350213', '翔安区', '350200', '翔安', '3', '0592', '361101', '中国,福建省,厦门市,翔安区', '118.247830000000', '24.618630000000', 'Xiang\'an');
INSERT INTO `cf_areas` VALUES ('350300', '莆田市', '350000', '莆田', '2', '0594', '351100', '中国,福建省,莆田市', '119.007558000000', '25.431011000000', 'Putian');
INSERT INTO `cf_areas` VALUES ('350302', '城厢区', '350300', '城厢', '3', '0594', '351100', '中国,福建省,莆田市,城厢区', '118.994620000000', '25.418720000000', 'Chengxiang');
INSERT INTO `cf_areas` VALUES ('350303', '涵江区', '350300', '涵江', '3', '0594', '351111', '中国,福建省,莆田市,涵江区', '119.116210000000', '25.458760000000', 'Hanjiang');
INSERT INTO `cf_areas` VALUES ('350304', '荔城区', '350300', '荔城', '3', '0594', '351100', '中国,福建省,莆田市,荔城区', '119.013390000000', '25.433690000000', 'Licheng');
INSERT INTO `cf_areas` VALUES ('350305', '秀屿区', '350300', '秀屿', '3', '0594', '351152', '中国,福建省,莆田市,秀屿区', '119.105530000000', '25.318310000000', 'Xiuyu');
INSERT INTO `cf_areas` VALUES ('350322', '仙游县', '350300', '仙游', '3', '0594', '351200', '中国,福建省,莆田市,仙游县', '118.691770000000', '25.362140000000', 'Xianyou');
INSERT INTO `cf_areas` VALUES ('350400', '三明市', '350000', '三明', '2', '0598', '365000', '中国,福建省,三明市', '117.635001000000', '26.265444000000', 'Sanming');
INSERT INTO `cf_areas` VALUES ('350402', '梅列区', '350400', '梅列', '3', '0598', '365000', '中国,福建省,三明市,梅列区', '117.645850000000', '26.271710000000', 'Meilie');
INSERT INTO `cf_areas` VALUES ('350403', '三元区', '350400', '三元', '3', '0598', '365001', '中国,福建省,三明市,三元区', '117.607880000000', '26.233720000000', 'Sanyuan');
INSERT INTO `cf_areas` VALUES ('350421', '明溪县', '350400', '明溪', '3', '0598', '365200', '中国,福建省,三明市,明溪县', '117.204980000000', '26.352940000000', 'Mingxi');
INSERT INTO `cf_areas` VALUES ('350423', '清流县', '350400', '清流', '3', '0598', '365300', '中国,福建省,三明市,清流县', '116.814600000000', '26.171440000000', 'Qingliu');
INSERT INTO `cf_areas` VALUES ('350424', '宁化县', '350400', '宁化', '3', '0598', '365400', '中国,福建省,三明市,宁化县', '116.661010000000', '26.258740000000', 'Ninghua');
INSERT INTO `cf_areas` VALUES ('350425', '大田县', '350400', '大田', '3', '0598', '366100', '中国,福建省,三明市,大田县', '117.847100000000', '25.692600000000', 'Datian');
INSERT INTO `cf_areas` VALUES ('350426', '尤溪县', '350400', '尤溪', '3', '0598', '365100', '中国,福建省,三明市,尤溪县', '118.190490000000', '26.170020000000', 'Youxi');
INSERT INTO `cf_areas` VALUES ('350427', '沙县', '350400', '沙县', '3', '0598', '365500', '中国,福建省,三明市,沙县', '117.792660000000', '26.396150000000', 'Shaxian');
INSERT INTO `cf_areas` VALUES ('350428', '将乐县', '350400', '将乐', '3', '0598', '353300', '中国,福建省,三明市,将乐县', '117.473170000000', '26.728370000000', 'Jiangle');
INSERT INTO `cf_areas` VALUES ('350429', '泰宁县', '350400', '泰宁', '3', '0598', '354400', '中国,福建省,三明市,泰宁县', '117.175780000000', '26.900100000000', 'Taining');
INSERT INTO `cf_areas` VALUES ('350430', '建宁县', '350400', '建宁', '3', '0598', '354500', '中国,福建省,三明市,建宁县', '116.846030000000', '26.830910000000', 'Jianning');
INSERT INTO `cf_areas` VALUES ('350481', '永安市', '350400', '永安', '3', '0598', '366000', '中国,福建省,三明市,永安市', '117.365170000000', '25.941360000000', 'Yong\'an');
INSERT INTO `cf_areas` VALUES ('350500', '泉州市', '350000', '泉州', '2', '0595', '362000', '中国,福建省,泉州市', '118.589421000000', '24.908853000000', 'Quanzhou');
INSERT INTO `cf_areas` VALUES ('350502', '鲤城区', '350500', '鲤城', '3', '0595', '362000', '中国,福建省,泉州市,鲤城区', '118.565910000000', '24.887410000000', 'Licheng');
INSERT INTO `cf_areas` VALUES ('350503', '丰泽区', '350500', '丰泽', '3', '0595', '362000', '中国,福建省,泉州市,丰泽区', '118.613280000000', '24.891190000000', 'Fengze');
INSERT INTO `cf_areas` VALUES ('350504', '洛江区', '350500', '洛江', '3', '0595', '362011', '中国,福建省,泉州市,洛江区', '118.671110000000', '24.939840000000', 'Luojiang');
INSERT INTO `cf_areas` VALUES ('350505', '泉港区', '350500', '泉港', '3', '0595', '362114', '中国,福建省,泉州市,泉港区', '118.915860000000', '25.120050000000', 'Quangang');
INSERT INTO `cf_areas` VALUES ('350521', '惠安县', '350500', '惠安', '3', '0595', '362100', '中国,福建省,泉州市,惠安县', '118.796870000000', '25.030590000000', 'Hui\'an');
INSERT INTO `cf_areas` VALUES ('350524', '安溪县', '350500', '安溪', '3', '0595', '362400', '中国,福建省,泉州市,安溪县', '118.187190000000', '25.056270000000', 'Anxi');
INSERT INTO `cf_areas` VALUES ('350525', '永春县', '350500', '永春', '3', '0595', '362600', '中国,福建省,泉州市,永春县', '118.294370000000', '25.321830000000', 'Yongchun');
INSERT INTO `cf_areas` VALUES ('350526', '德化县', '350500', '德化', '3', '0595', '362500', '中国,福建省,泉州市,德化县', '118.241760000000', '25.492240000000', 'Dehua');
INSERT INTO `cf_areas` VALUES ('350527', '金门县', '350500', '金门', '3', '', '', '中国,福建省,泉州市,金门县', '118.322630000000', '24.429220000000', 'Jinmen');
INSERT INTO `cf_areas` VALUES ('350581', '石狮市', '350500', '石狮', '3', '0595', '362700', '中国,福建省,泉州市,石狮市', '118.647790000000', '24.732420000000', 'Shishi');
INSERT INTO `cf_areas` VALUES ('350582', '晋江市', '350500', '晋江', '3', '0595', '362200', '中国,福建省,泉州市,晋江市', '118.551940000000', '24.781410000000', 'Jinjiang');
INSERT INTO `cf_areas` VALUES ('350583', '南安市', '350500', '南安', '3', '0595', '362300', '中国,福建省,泉州市,南安市', '118.385890000000', '24.960550000000', 'Nan\'an');
INSERT INTO `cf_areas` VALUES ('350600', '漳州市', '350000', '漳州', '2', '0596', '363005', '中国,福建省,漳州市', '117.661801000000', '24.510897000000', 'Zhangzhou');
INSERT INTO `cf_areas` VALUES ('350602', '芗城区', '350600', '芗城', '3', '0596', '363000', '中国,福建省,漳州市,芗城区', '117.654020000000', '24.510810000000', 'Xiangcheng');
INSERT INTO `cf_areas` VALUES ('350603', '龙文区', '350600', '龙文', '3', '0596', '363005', '中国,福建省,漳州市,龙文区', '117.709710000000', '24.503230000000', 'Longwen');
INSERT INTO `cf_areas` VALUES ('350622', '云霄县', '350600', '云霄', '3', '0596', '363300', '中国,福建省,漳州市,云霄县', '117.340510000000', '23.955340000000', 'Yunxiao');
INSERT INTO `cf_areas` VALUES ('350623', '漳浦县', '350600', '漳浦', '3', '0596', '363200', '中国,福建省,漳州市,漳浦县', '117.613670000000', '24.117060000000', 'Zhangpu');
INSERT INTO `cf_areas` VALUES ('350624', '诏安县', '350600', '诏安', '3', '0596', '363500', '中国,福建省,漳州市,诏安县', '117.175010000000', '23.711480000000', 'Zhao\'an');
INSERT INTO `cf_areas` VALUES ('350625', '长泰县', '350600', '长泰', '3', '0596', '363900', '中国,福建省,漳州市,长泰县', '117.759240000000', '24.625260000000', 'Changtai');
INSERT INTO `cf_areas` VALUES ('350626', '东山县', '350600', '东山', '3', '0596', '363400', '中国,福建省,漳州市,东山县', '117.428220000000', '23.701090000000', 'Dongshan');
INSERT INTO `cf_areas` VALUES ('350627', '南靖县', '350600', '南靖', '3', '0596', '363600', '中国,福建省,漳州市,南靖县', '117.357360000000', '24.514480000000', 'Nanjing');
INSERT INTO `cf_areas` VALUES ('350628', '平和县', '350600', '平和', '3', '0596', '363700', '中国,福建省,漳州市,平和县', '117.312400000000', '24.363950000000', 'Pinghe');
INSERT INTO `cf_areas` VALUES ('350629', '华安县', '350600', '华安', '3', '0596', '363800', '中国,福建省,漳州市,华安县', '117.540770000000', '25.005630000000', 'Hua\'an');
INSERT INTO `cf_areas` VALUES ('350681', '龙海市', '350600', '龙海', '3', '0596', '363100', '中国,福建省,漳州市,龙海市', '117.818020000000', '24.446550000000', 'Longhai');
INSERT INTO `cf_areas` VALUES ('350700', '南平市', '350000', '南平', '2', '0599', '353000', '中国,福建省,南平市', '118.178459000000', '26.635627000000', 'Nanping');
INSERT INTO `cf_areas` VALUES ('350702', '延平区', '350700', '延平', '3', '0600', '353000', '中国,福建省,南平市,延平区', '118.181890000000', '26.637450000000', 'Yanping');
INSERT INTO `cf_areas` VALUES ('350703', '建阳区', '350700', '建阳', '3', '0599', '354200', '中国,福建省,南平市,建阳区', '118.122670000000', '27.332067000000', 'Jianyang');
INSERT INTO `cf_areas` VALUES ('350721', '顺昌县', '350700', '顺昌', '3', '0605', '353200', '中国,福建省,南平市,顺昌县', '117.810300000000', '26.792980000000', 'Shunchang');
INSERT INTO `cf_areas` VALUES ('350722', '浦城县', '350700', '浦城', '3', '0606', '353400', '中国,福建省,南平市,浦城县', '118.540070000000', '27.918880000000', 'Pucheng');
INSERT INTO `cf_areas` VALUES ('350723', '光泽县', '350700', '光泽', '3', '0607', '354100', '中国,福建省,南平市,光泽县', '117.333460000000', '27.542310000000', 'Guangze');
INSERT INTO `cf_areas` VALUES ('350724', '松溪县', '350700', '松溪', '3', '0608', '353500', '中国,福建省,南平市,松溪县', '118.785330000000', '27.526240000000', 'Songxi');
INSERT INTO `cf_areas` VALUES ('350725', '政和县', '350700', '政和', '3', '0609', '353600', '中国,福建省,南平市,政和县', '118.855710000000', '27.367690000000', 'Zhenghe');
INSERT INTO `cf_areas` VALUES ('350781', '邵武市', '350700', '邵武', '3', '0601', '354000', '中国,福建省,南平市,邵武市', '117.492400000000', '27.340330000000', 'Shaowu');
INSERT INTO `cf_areas` VALUES ('350782', '武夷山市', '350700', '武夷山', '3', '0602', '354300', '中国,福建省,南平市,武夷山市', '118.036650000000', '27.755430000000', 'Wuyishan');
INSERT INTO `cf_areas` VALUES ('350783', '建瓯市', '350700', '建瓯', '3', '0603', '353100', '中国,福建省,南平市,建瓯市', '118.297660000000', '27.023010000000', 'Jianou');
INSERT INTO `cf_areas` VALUES ('350800', '龙岩市', '350000', '龙岩', '2', '0597', '364000', '中国,福建省,龙岩市', '117.029780000000', '25.091603000000', 'Longyan');
INSERT INTO `cf_areas` VALUES ('350802', '新罗区', '350800', '新罗', '3', '0597', '364000', '中国,福建省,龙岩市,新罗区', '117.036930000000', '25.098340000000', 'Xinluo');
INSERT INTO `cf_areas` VALUES ('350821', '长汀县', '350800', '长汀', '3', '0597', '366300', '中国,福建省,龙岩市,长汀县', '116.358880000000', '25.827730000000', 'Changting');
INSERT INTO `cf_areas` VALUES ('350822', '永定区', '350800', '永定', '3', '0597', '364100', '中国,福建省,龙岩市,永定区', '116.731990000000', '24.723020000000', 'Yongding');
INSERT INTO `cf_areas` VALUES ('350823', '上杭县', '350800', '上杭', '3', '0597', '364200', '中国,福建省,龙岩市,上杭县', '116.420220000000', '25.049430000000', 'Shanghang');
INSERT INTO `cf_areas` VALUES ('350824', '武平县', '350800', '武平', '3', '0597', '364300', '中国,福建省,龙岩市,武平县', '116.102290000000', '25.092440000000', 'Wuping');
INSERT INTO `cf_areas` VALUES ('350825', '连城县', '350800', '连城', '3', '0597', '366200', '中国,福建省,龙岩市,连城县', '116.754540000000', '25.710300000000', 'Liancheng');
INSERT INTO `cf_areas` VALUES ('350881', '漳平市', '350800', '漳平', '3', '0597', '364400', '中国,福建省,龙岩市,漳平市', '117.419920000000', '25.291090000000', 'Zhangping');
INSERT INTO `cf_areas` VALUES ('350900', '宁德市', '350000', '宁德', '2', '0593', '352100', '中国,福建省,宁德市', '119.527082000000', '26.659240000000', 'Ningde');
INSERT INTO `cf_areas` VALUES ('350902', '蕉城区', '350900', '蕉城', '3', '0593', '352100', '中国,福建省,宁德市,蕉城区', '119.526430000000', '26.660480000000', 'Jiaocheng');
INSERT INTO `cf_areas` VALUES ('350921', '霞浦县', '350900', '霞浦', '3', '0593', '355100', '中国,福建省,宁德市,霞浦县', '119.998930000000', '26.885780000000', 'Xiapu');
INSERT INTO `cf_areas` VALUES ('350922', '古田县', '350900', '古田', '3', '0593', '352200', '中国,福建省,宁德市,古田县', '118.746880000000', '26.576820000000', 'Gutian');
INSERT INTO `cf_areas` VALUES ('350923', '屏南县', '350900', '屏南', '3', '0593', '352300', '中国,福建省,宁德市,屏南县', '118.988610000000', '26.910990000000', 'Pingnan');
INSERT INTO `cf_areas` VALUES ('350924', '寿宁县', '350900', '寿宁', '3', '0593', '355500', '中国,福建省,宁德市,寿宁县', '119.503900000000', '27.459960000000', 'Shouning');
INSERT INTO `cf_areas` VALUES ('350925', '周宁县', '350900', '周宁', '3', '0593', '355400', '中国,福建省,宁德市,周宁县', '119.338370000000', '27.106640000000', 'Zhouning');
INSERT INTO `cf_areas` VALUES ('350926', '柘荣县', '350900', '柘荣', '3', '0593', '355300', '中国,福建省,宁德市,柘荣县', '119.899710000000', '27.235430000000', 'Zherong');
INSERT INTO `cf_areas` VALUES ('350981', '福安市', '350900', '福安', '3', '0593', '355000', '中国,福建省,宁德市,福安市', '119.649500000000', '27.086730000000', 'Fu\'an');
INSERT INTO `cf_areas` VALUES ('350982', '福鼎市', '350900', '福鼎', '3', '0593', '355200', '中国,福建省,宁德市,福鼎市', '120.216640000000', '27.324300000000', 'Fuding');
INSERT INTO `cf_areas` VALUES ('360000', '江西省', '100000', '江西', '1', '', '', '中国,江西省', '115.892151000000', '28.676493000000', 'Jiangxi');
INSERT INTO `cf_areas` VALUES ('360100', '南昌市', '360000', '南昌', '2', '0791', '330008', '中国,江西省,南昌市', '115.892151000000', '28.676493000000', 'Nanchang');
INSERT INTO `cf_areas` VALUES ('360102', '东湖区', '360100', '东湖', '3', '0791', '330006', '中国,江西省,南昌市,东湖区', '115.898800000000', '28.685050000000', 'Donghu');
INSERT INTO `cf_areas` VALUES ('360103', '西湖区', '360100', '西湖', '3', '0791', '330009', '中国,江西省,南昌市,西湖区', '115.877280000000', '28.656880000000', 'Xihu');
INSERT INTO `cf_areas` VALUES ('360104', '青云谱区', '360100', '青云谱', '3', '0791', '330001', '中国,江西省,南昌市,青云谱区', '115.915000000000', '28.631990000000', 'Qingyunpu');
INSERT INTO `cf_areas` VALUES ('360105', '湾里区', '360100', '湾里', '3', '0791', '330004', '中国,江西省,南昌市,湾里区', '115.731040000000', '28.715290000000', 'Wanli');
INSERT INTO `cf_areas` VALUES ('360111', '青山湖区', '360100', '青山湖', '3', '0791', '330029', '中国,江西省,南昌市,青山湖区', '115.961700000000', '28.682060000000', 'Qingshanhu');
INSERT INTO `cf_areas` VALUES ('360121', '南昌县', '360100', '南昌', '3', '0791', '330200', '中国,江西省,南昌市,南昌县', '115.943930000000', '28.545590000000', 'Nanchang');
INSERT INTO `cf_areas` VALUES ('360122', '新建县', '360100', '新建', '3', '0791', '330100', '中国,江西省,南昌市,新建县', '115.815460000000', '28.692480000000', 'Xinjian');
INSERT INTO `cf_areas` VALUES ('360123', '安义县', '360100', '安义', '3', '0791', '330500', '中国,江西省,南昌市,安义县', '115.548790000000', '28.846020000000', 'Anyi');
INSERT INTO `cf_areas` VALUES ('360124', '进贤县', '360100', '进贤', '3', '0791', '331700', '中国,江西省,南昌市,进贤县', '116.240870000000', '28.376790000000', 'Jinxian');
INSERT INTO `cf_areas` VALUES ('360200', '景德镇市', '360000', '景德镇', '2', '0798', '333000', '中国,江西省,景德镇市', '117.214664000000', '29.292560000000', 'Jingdezhen');
INSERT INTO `cf_areas` VALUES ('360202', '昌江区', '360200', '昌江', '3', '0799', '333000', '中国,江西省,景德镇市,昌江区', '117.183590000000', '29.273210000000', 'Changjiang');
INSERT INTO `cf_areas` VALUES ('360203', '珠山区', '360200', '珠山', '3', '0800', '333000', '中国,江西省,景德镇市,珠山区', '117.202330000000', '29.301270000000', 'Zhushan');
INSERT INTO `cf_areas` VALUES ('360222', '浮梁县', '360200', '浮梁', '3', '0802', '333400', '中国,江西省,景德镇市,浮梁县', '117.215170000000', '29.351560000000', 'Fuliang');
INSERT INTO `cf_areas` VALUES ('360281', '乐平市', '360200', '乐平', '3', '0801', '333300', '中国,江西省,景德镇市,乐平市', '117.128870000000', '28.962950000000', 'Leping');
INSERT INTO `cf_areas` VALUES ('360300', '萍乡市', '360000', '萍乡', '2', '0799', '337000', '中国,江西省,萍乡市', '113.852186000000', '27.622946000000', 'Pingxiang');
INSERT INTO `cf_areas` VALUES ('360302', '安源区', '360300', '安源', '3', '0800', '337000', '中国,江西省,萍乡市,安源区', '113.891350000000', '27.616530000000', 'Anyuan');
INSERT INTO `cf_areas` VALUES ('360313', '湘东区', '360300', '湘东', '3', '0801', '337016', '中国,江西省,萍乡市,湘东区', '113.732940000000', '27.640070000000', 'Xiangdong');
INSERT INTO `cf_areas` VALUES ('360321', '莲花县', '360300', '莲花', '3', '0802', '337100', '中国,江西省,萍乡市,莲花县', '113.961420000000', '27.128660000000', 'Lianhua');
INSERT INTO `cf_areas` VALUES ('360322', '上栗县', '360300', '上栗', '3', '0803', '337009', '中国,江西省,萍乡市,上栗县', '113.794030000000', '27.874670000000', 'Shangli');
INSERT INTO `cf_areas` VALUES ('360323', '芦溪县', '360300', '芦溪', '3', '0804', '337053', '中国,江西省,萍乡市,芦溪县', '114.029510000000', '27.630630000000', 'Luxi');
INSERT INTO `cf_areas` VALUES ('360400', '九江市', '360000', '九江', '2', '0792', '332000', '中国,江西省,九江市', '115.992811000000', '29.712034000000', 'Jiujiang');
INSERT INTO `cf_areas` VALUES ('360402', '庐山区', '360400', '庐山', '3', '0792', '332005', '中国,江西省,九江市,庐山区', '115.989040000000', '29.671770000000', 'Lushan');
INSERT INTO `cf_areas` VALUES ('360403', '浔阳区', '360400', '浔阳', '3', '0792', '332000', '中国,江西省,九江市,浔阳区', '115.989860000000', '29.727860000000', 'Xunyang');
INSERT INTO `cf_areas` VALUES ('360421', '九江县', '360400', '九江', '3', '0792', '332100', '中国,江西省,九江市,九江县', '115.911280000000', '29.608520000000', 'Jiujiang');
INSERT INTO `cf_areas` VALUES ('360423', '武宁县', '360400', '武宁', '3', '0792', '332300', '中国,江西省,九江市,武宁县', '115.100610000000', '29.258400000000', 'Wuning');
INSERT INTO `cf_areas` VALUES ('360424', '修水县', '360400', '修水', '3', '0792', '332400', '中国,江西省,九江市,修水县', '114.546840000000', '29.025390000000', 'Xiushui');
INSERT INTO `cf_areas` VALUES ('360425', '永修县', '360400', '永修', '3', '0792', '330300', '中国,江西省,九江市,永修县', '115.809110000000', '29.020930000000', 'Yongxiu');
INSERT INTO `cf_areas` VALUES ('360426', '德安县', '360400', '德安', '3', '0792', '330400', '中国,江西省,九江市,德安县', '115.756010000000', '29.313410000000', 'De\'an');
INSERT INTO `cf_areas` VALUES ('360427', '星子县', '360400', '星子', '3', '0792', '332800', '中国,江西省,九江市,星子县', '116.044920000000', '29.446080000000', 'Xingzi');
INSERT INTO `cf_areas` VALUES ('360428', '都昌县', '360400', '都昌', '3', '0792', '332600', '中国,江西省,九江市,都昌县', '116.204010000000', '29.273270000000', 'Duchang');
INSERT INTO `cf_areas` VALUES ('360429', '湖口县', '360400', '湖口', '3', '0792', '332500', '中国,江西省,九江市,湖口县', '116.218530000000', '29.738180000000', 'Hukou');
INSERT INTO `cf_areas` VALUES ('360430', '彭泽县', '360400', '彭泽', '3', '0792', '332700', '中国,江西省,九江市,彭泽县', '116.550110000000', '29.895890000000', 'Pengze');
INSERT INTO `cf_areas` VALUES ('360481', '瑞昌市', '360400', '瑞昌', '3', '0792', '332200', '中国,江西省,九江市,瑞昌市', '115.667050000000', '29.671830000000', 'Ruichang');
INSERT INTO `cf_areas` VALUES ('360482', '共青城市', '360400', '共青城', '3', '0792', '332020', '中国,江西省,九江市,共青城市', '115.801939000000', '29.238785000000', 'Gongqingcheng');
INSERT INTO `cf_areas` VALUES ('360500', '新余市', '360000', '新余', '2', '0790', '338025', '中国,江西省,新余市', '114.930835000000', '27.810834000000', 'Xinyu');
INSERT INTO `cf_areas` VALUES ('360502', '渝水区', '360500', '渝水', '3', '0790', '338025', '中国,江西省,新余市,渝水区', '114.944000000000', '27.800980000000', 'Yushui');
INSERT INTO `cf_areas` VALUES ('360521', '分宜县', '360500', '分宜', '3', '0790', '336600', '中国,江西省,新余市,分宜县', '114.691890000000', '27.814750000000', 'Fenyi');
INSERT INTO `cf_areas` VALUES ('360600', '鹰潭市', '360000', '鹰潭', '2', '0701', '335000', '中国,江西省,鹰潭市', '117.033838000000', '28.238638000000', 'Yingtan');
INSERT INTO `cf_areas` VALUES ('360602', '月湖区', '360600', '月湖', '3', '0701', '335000', '中国,江西省,鹰潭市,月湖区', '117.037320000000', '28.239130000000', 'Yuehu');
INSERT INTO `cf_areas` VALUES ('360622', '余江县', '360600', '余江', '3', '0701', '335200', '中国,江西省,鹰潭市,余江县', '116.818510000000', '28.210340000000', 'Yujiang');
INSERT INTO `cf_areas` VALUES ('360681', '贵溪市', '360600', '贵溪', '3', '0701', '335400', '中国,江西省,鹰潭市,贵溪市', '117.242460000000', '28.292600000000', 'Guixi');
INSERT INTO `cf_areas` VALUES ('360700', '赣州市', '360000', '赣州', '2', '0797', '341000', '中国,江西省,赣州市', '114.940278000000', '25.850970000000', 'Ganzhou');
INSERT INTO `cf_areas` VALUES ('360702', '章贡区', '360700', '章贡', '3', '0797', '341000', '中国,江西省,赣州市,章贡区', '114.942840000000', '25.862400000000', 'Zhanggong');
INSERT INTO `cf_areas` VALUES ('360703', '南康区', '360700', '南康', '3', '0797', '341400', '中国,江西省,赣州市,南康区', '114.756933000000', '25.661721000000', 'Nankang');
INSERT INTO `cf_areas` VALUES ('360721', '赣县', '360700', '赣县', '3', '0797', '341100', '中国,江西省,赣州市,赣县', '115.011710000000', '25.861490000000', 'Ganxian');
INSERT INTO `cf_areas` VALUES ('360722', '信丰县', '360700', '信丰', '3', '0797', '341600', '中国,江西省,赣州市,信丰县', '114.922790000000', '25.386120000000', 'Xinfeng');
INSERT INTO `cf_areas` VALUES ('360723', '大余县', '360700', '大余', '3', '0797', '341500', '中国,江西省,赣州市,大余县', '114.357570000000', '25.395610000000', 'Dayu');
INSERT INTO `cf_areas` VALUES ('360724', '上犹县', '360700', '上犹', '3', '0797', '341200', '中国,江西省,赣州市,上犹县', '114.541380000000', '25.795670000000', 'Shangyou');
INSERT INTO `cf_areas` VALUES ('360725', '崇义县', '360700', '崇义', '3', '0797', '341300', '中国,江西省,赣州市,崇义县', '114.308350000000', '25.681860000000', 'Chongyi');
INSERT INTO `cf_areas` VALUES ('360726', '安远县', '360700', '安远', '3', '0797', '342100', '中国,江西省,赣州市,安远县', '115.394830000000', '25.137100000000', 'Anyuan');
INSERT INTO `cf_areas` VALUES ('360727', '龙南县', '360700', '龙南', '3', '0797', '341700', '中国,江西省,赣州市,龙南县', '114.789940000000', '24.910860000000', 'Longnan');
INSERT INTO `cf_areas` VALUES ('360728', '定南县', '360700', '定南', '3', '0797', '341900', '中国,江西省,赣州市,定南县', '115.027130000000', '24.783950000000', 'Dingnan');
INSERT INTO `cf_areas` VALUES ('360729', '全南县', '360700', '全南', '3', '0797', '341800', '中国,江西省,赣州市,全南县', '114.529200000000', '24.743240000000', 'Quannan');
INSERT INTO `cf_areas` VALUES ('360730', '宁都县', '360700', '宁都', '3', '0797', '342800', '中国,江西省,赣州市,宁都县', '116.015650000000', '26.472270000000', 'Ningdu');
INSERT INTO `cf_areas` VALUES ('360731', '于都县', '360700', '于都', '3', '0797', '342300', '中国,江西省,赣州市,于都县', '115.414150000000', '25.952570000000', 'Yudu');
INSERT INTO `cf_areas` VALUES ('360732', '兴国县', '360700', '兴国', '3', '0797', '342400', '中国,江西省,赣州市,兴国县', '115.363090000000', '26.337760000000', 'Xingguo');
INSERT INTO `cf_areas` VALUES ('360733', '会昌县', '360700', '会昌', '3', '0797', '342600', '中国,江西省,赣州市,会昌县', '115.785550000000', '25.600680000000', 'Huichang');
INSERT INTO `cf_areas` VALUES ('360734', '寻乌县', '360700', '寻乌', '3', '0797', '342200', '中国,江西省,赣州市,寻乌县', '115.648520000000', '24.955130000000', 'Xunwu');
INSERT INTO `cf_areas` VALUES ('360735', '石城县', '360700', '石城', '3', '0797', '342700', '中国,江西省,赣州市,石城县', '116.344200000000', '26.326170000000', 'Shicheng');
INSERT INTO `cf_areas` VALUES ('360781', '瑞金市', '360700', '瑞金', '3', '0797', '342500', '中国,江西省,赣州市,瑞金市', '116.027030000000', '25.885570000000', 'Ruijin');
INSERT INTO `cf_areas` VALUES ('360800', '吉安市', '360000', '吉安', '2', '0796', '343000', '中国,江西省,吉安市', '114.986373000000', '27.111699000000', 'Ji\'an');
INSERT INTO `cf_areas` VALUES ('360802', '吉州区', '360800', '吉州', '3', '0796', '343000', '中国,江西省,吉安市,吉州区', '114.975980000000', '27.106690000000', 'Jizhou');
INSERT INTO `cf_areas` VALUES ('360803', '青原区', '360800', '青原', '3', '0796', '343009', '中国,江西省,吉安市,青原区', '115.017470000000', '27.105770000000', 'Qingyuan');
INSERT INTO `cf_areas` VALUES ('360821', '吉安县', '360800', '吉安', '3', '0796', '343100', '中国,江西省,吉安市,吉安县', '114.906950000000', '27.040480000000', 'Ji\'an');
INSERT INTO `cf_areas` VALUES ('360822', '吉水县', '360800', '吉水', '3', '0796', '331600', '中国,江西省,吉安市,吉水县', '115.134300000000', '27.210710000000', 'Jishui');
INSERT INTO `cf_areas` VALUES ('360823', '峡江县', '360800', '峡江', '3', '0796', '331409', '中国,江西省,吉安市,峡江县', '115.317230000000', '27.576000000000', 'Xiajiang');
INSERT INTO `cf_areas` VALUES ('360824', '新干县', '360800', '新干', '3', '0796', '331300', '中国,江西省,吉安市,新干县', '115.393060000000', '27.740920000000', 'Xingan');
INSERT INTO `cf_areas` VALUES ('360825', '永丰县', '360800', '永丰', '3', '0796', '331500', '中国,江西省,吉安市,永丰县', '115.442380000000', '27.317850000000', 'Yongfeng');
INSERT INTO `cf_areas` VALUES ('360826', '泰和县', '360800', '泰和', '3', '0796', '343700', '中国,江西省,吉安市,泰和县', '114.907890000000', '26.791130000000', 'Taihe');
INSERT INTO `cf_areas` VALUES ('360827', '遂川县', '360800', '遂川', '3', '0796', '343900', '中国,江西省,吉安市,遂川县', '114.516290000000', '26.325980000000', 'Suichuan');
INSERT INTO `cf_areas` VALUES ('360828', '万安县', '360800', '万安', '3', '0796', '343800', '中国,江西省,吉安市,万安县', '114.786590000000', '26.459310000000', 'Wan\'an');
INSERT INTO `cf_areas` VALUES ('360829', '安福县', '360800', '安福', '3', '0796', '343200', '中国,江西省,吉安市,安福县', '114.619560000000', '27.392760000000', 'Anfu');
INSERT INTO `cf_areas` VALUES ('360830', '永新县', '360800', '永新', '3', '0796', '343400', '中国,江西省,吉安市,永新县', '114.242460000000', '26.944880000000', 'Yongxin');
INSERT INTO `cf_areas` VALUES ('360881', '井冈山市', '360800', '井冈山', '3', '0796', '343600', '中国,江西省,吉安市,井冈山市', '114.289490000000', '26.748040000000', 'Jinggangshan');
INSERT INTO `cf_areas` VALUES ('360900', '宜春市', '360000', '宜春', '2', '0795', '336000', '中国,江西省,宜春市', '114.391136000000', '27.804300000000', 'Yichun');
INSERT INTO `cf_areas` VALUES ('360902', '袁州区', '360900', '袁州', '3', '0795', '336000', '中国,江西省,宜春市,袁州区', '114.382460000000', '27.796490000000', 'Yuanzhou');
INSERT INTO `cf_areas` VALUES ('360921', '奉新县', '360900', '奉新', '3', '0795', '330700', '中国,江西省,宜春市,奉新县', '115.400360000000', '28.687900000000', 'Fengxin');
INSERT INTO `cf_areas` VALUES ('360922', '万载县', '360900', '万载', '3', '0795', '336100', '中国,江西省,宜春市,万载县', '114.445800000000', '28.106560000000', 'Wanzai');
INSERT INTO `cf_areas` VALUES ('360923', '上高县', '360900', '上高', '3', '0795', '336400', '中国,江西省,宜春市,上高县', '114.924590000000', '28.234230000000', 'Shanggao');
INSERT INTO `cf_areas` VALUES ('360924', '宜丰县', '360900', '宜丰', '3', '0795', '336300', '中国,江西省,宜春市,宜丰县', '114.780300000000', '28.385550000000', 'Yifeng');
INSERT INTO `cf_areas` VALUES ('360925', '靖安县', '360900', '靖安', '3', '0795', '330600', '中国,江西省,宜春市,靖安县', '115.362790000000', '28.861670000000', 'Jing\'an');
INSERT INTO `cf_areas` VALUES ('360926', '铜鼓县', '360900', '铜鼓', '3', '0795', '336200', '中国,江西省,宜春市,铜鼓县', '114.370360000000', '28.523110000000', 'Tonggu');
INSERT INTO `cf_areas` VALUES ('360981', '丰城市', '360900', '丰城', '3', '0795', '331100', '中国,江西省,宜春市,丰城市', '115.771140000000', '28.159180000000', 'Fengcheng');
INSERT INTO `cf_areas` VALUES ('360982', '樟树市', '360900', '樟树', '3', '0795', '331200', '中国,江西省,宜春市,樟树市', '115.546500000000', '28.053320000000', 'Zhangshu');
INSERT INTO `cf_areas` VALUES ('360983', '高安市', '360900', '高安', '3', '0795', '330800', '中国,江西省,宜春市,高安市', '115.375300000000', '28.417800000000', 'Gao\'an');
INSERT INTO `cf_areas` VALUES ('361000', '抚州市', '360000', '抚州', '2', '0794', '344000', '中国,江西省,抚州市', '116.358351000000', '27.983850000000', 'Fuzhou');
INSERT INTO `cf_areas` VALUES ('361002', '临川区', '361000', '临川', '3', '0794', '344000', '中国,江西省,抚州市,临川区', '116.359190000000', '27.977210000000', 'Linchuan');
INSERT INTO `cf_areas` VALUES ('361021', '南城县', '361000', '南城', '3', '0794', '344700', '中国,江西省,抚州市,南城县', '116.644190000000', '27.553810000000', 'Nancheng');
INSERT INTO `cf_areas` VALUES ('361022', '黎川县', '361000', '黎川', '3', '0794', '344600', '中国,江西省,抚州市,黎川县', '116.907710000000', '27.282320000000', 'Lichuan');
INSERT INTO `cf_areas` VALUES ('361023', '南丰县', '361000', '南丰', '3', '0794', '344500', '中国,江西省,抚州市,南丰县', '116.525600000000', '27.218420000000', 'Nanfeng');
INSERT INTO `cf_areas` VALUES ('361024', '崇仁县', '361000', '崇仁', '3', '0794', '344200', '中国,江西省,抚州市,崇仁县', '116.060210000000', '27.759620000000', 'Chongren');
INSERT INTO `cf_areas` VALUES ('361025', '乐安县', '361000', '乐安', '3', '0794', '344300', '中国,江西省,抚州市,乐安县', '115.831080000000', '27.428120000000', 'Le\'an');
INSERT INTO `cf_areas` VALUES ('361026', '宜黄县', '361000', '宜黄', '3', '0794', '344400', '中国,江西省,抚州市,宜黄县', '116.236260000000', '27.554870000000', 'Yihuang');
INSERT INTO `cf_areas` VALUES ('361027', '金溪县', '361000', '金溪', '3', '0794', '344800', '中国,江西省,抚州市,金溪县', '116.773920000000', '27.907530000000', 'Jinxi');
INSERT INTO `cf_areas` VALUES ('361028', '资溪县', '361000', '资溪', '3', '0794', '335300', '中国,江西省,抚州市,资溪县', '117.069390000000', '27.704930000000', 'Zixi');
INSERT INTO `cf_areas` VALUES ('361029', '东乡县', '361000', '东乡', '3', '0794', '331800', '中国,江西省,抚州市,东乡县', '116.590390000000', '28.236140000000', 'Dongxiang');
INSERT INTO `cf_areas` VALUES ('361030', '广昌县', '361000', '广昌', '3', '0794', '344900', '中国,江西省,抚州市,广昌县', '116.325470000000', '26.834100000000', 'Guangchang');
INSERT INTO `cf_areas` VALUES ('361100', '上饶市', '360000', '上饶', '2', '0793', '334000', '中国,江西省,上饶市', '117.971185000000', '28.444420000000', 'Shangrao');
INSERT INTO `cf_areas` VALUES ('361102', '信州区', '361100', '信州', '3', '0793', '334000', '中国,江西省,上饶市,信州区', '117.966820000000', '28.431210000000', 'Xinzhou');
INSERT INTO `cf_areas` VALUES ('361121', '上饶县', '361100', '上饶', '3', '0793', '334100', '中国,江西省,上饶市,上饶县', '117.908840000000', '28.448560000000', 'Shangrao');
INSERT INTO `cf_areas` VALUES ('361122', '广丰县', '361100', '广丰', '3', '0793', '334600', '中国,江西省,上饶市,广丰县', '118.191580000000', '28.437660000000', 'Guangfeng');
INSERT INTO `cf_areas` VALUES ('361123', '玉山县', '361100', '玉山', '3', '0793', '334700', '中国,江西省,上饶市,玉山县', '118.244620000000', '28.681800000000', 'Yushan');
INSERT INTO `cf_areas` VALUES ('361124', '铅山县', '361100', '铅山', '3', '0793', '334500', '中国,江西省,上饶市,铅山县', '117.709960000000', '28.315490000000', 'Yanshan');
INSERT INTO `cf_areas` VALUES ('361125', '横峰县', '361100', '横峰', '3', '0793', '334300', '中国,江西省,上饶市,横峰县', '117.596400000000', '28.407160000000', 'Hengfeng');
INSERT INTO `cf_areas` VALUES ('361126', '弋阳县', '361100', '弋阳', '3', '0793', '334400', '中国,江西省,上饶市,弋阳县', '117.459290000000', '28.374510000000', 'Yiyang');
INSERT INTO `cf_areas` VALUES ('361127', '余干县', '361100', '余干', '3', '0793', '335100', '中国,江西省,上饶市,余干县', '116.695550000000', '28.702060000000', 'Yugan');
INSERT INTO `cf_areas` VALUES ('361128', '鄱阳县', '361100', '鄱阳', '3', '0793', '333100', '中国,江西省,上饶市,鄱阳县', '116.699670000000', '29.011800000000', 'Poyang');
INSERT INTO `cf_areas` VALUES ('361129', '万年县', '361100', '万年', '3', '0793', '335500', '中国,江西省,上饶市,万年县', '117.068840000000', '28.695370000000', 'Wannian');
INSERT INTO `cf_areas` VALUES ('361130', '婺源县', '361100', '婺源', '3', '0793', '333200', '中国,江西省,上饶市,婺源县', '117.861050000000', '29.248410000000', 'Wuyuan');
INSERT INTO `cf_areas` VALUES ('361181', '德兴市', '361100', '德兴', '3', '0793', '334200', '中国,江西省,上饶市,德兴市', '117.579190000000', '28.947360000000', 'Dexing');
INSERT INTO `cf_areas` VALUES ('370000', '山东省', '100000', '山东', '1', '', '', '中国,山东省', '117.000923000000', '36.675807000000', 'Shandong');
INSERT INTO `cf_areas` VALUES ('370100', '济南市', '370000', '济南', '2', '0531', '250001', '中国,山东省,济南市', '117.000923000000', '36.675807000000', 'Jinan');
INSERT INTO `cf_areas` VALUES ('370102', '历下区', '370100', '历下', '3', '0531', '250014', '中国,山东省,济南市,历下区', '117.076800000000', '36.666610000000', 'Lixia');
INSERT INTO `cf_areas` VALUES ('370103', '市中区', '370100', '市中区', '3', '0531', '250001', '中国,山东省,济南市,市中区', '116.997410000000', '36.651010000000', 'Shizhongqu');
INSERT INTO `cf_areas` VALUES ('370104', '槐荫区', '370100', '槐荫', '3', '0531', '250117', '中国,山东省,济南市,槐荫区', '116.900750000000', '36.651360000000', 'Huaiyin');
INSERT INTO `cf_areas` VALUES ('370105', '天桥区', '370100', '天桥', '3', '0531', '250031', '中国,山东省,济南市,天桥区', '116.987490000000', '36.678010000000', 'Tianqiao');
INSERT INTO `cf_areas` VALUES ('370112', '历城区', '370100', '历城', '3', '0531', '250100', '中国,山东省,济南市,历城区', '117.065090000000', '36.679950000000', 'Licheng');
INSERT INTO `cf_areas` VALUES ('370113', '长清区', '370100', '长清', '3', '0531', '250300', '中国,山东省,济南市,长清区', '116.751920000000', '36.553520000000', 'Changqing');
INSERT INTO `cf_areas` VALUES ('370124', '平阴县', '370100', '平阴', '3', '0531', '250400', '中国,山东省,济南市,平阴县', '116.455870000000', '36.289550000000', 'Pingyin');
INSERT INTO `cf_areas` VALUES ('370125', '济阳县', '370100', '济阳', '3', '0531', '251400', '中国,山东省,济南市,济阳县', '117.173270000000', '36.978450000000', 'Jiyang');
INSERT INTO `cf_areas` VALUES ('370126', '商河县', '370100', '商河', '3', '0531', '251600', '中国,山东省,济南市,商河县', '117.157220000000', '37.311190000000', 'Shanghe');
INSERT INTO `cf_areas` VALUES ('370181', '章丘市', '370100', '章丘', '3', '0531', '250200', '中国,山东省,济南市,章丘市', '117.536770000000', '36.713920000000', 'Zhangqiu');
INSERT INTO `cf_areas` VALUES ('370200', '青岛市', '370000', '青岛', '2', '0532', '266001', '中国,山东省,青岛市', '120.369557000000', '36.094406000000', 'Qingdao');
INSERT INTO `cf_areas` VALUES ('370202', '市南区', '370200', '市南', '3', '0532', '266001', '中国,山东省,青岛市,市南区', '120.387730000000', '36.066710000000', 'Shinan');
INSERT INTO `cf_areas` VALUES ('370203', '市北区', '370200', '市北', '3', '0532', '266011', '中国,山东省,青岛市,市北区', '120.374690000000', '36.087340000000', 'Shibei');
INSERT INTO `cf_areas` VALUES ('370211', '黄岛区', '370200', '黄岛', '3', '0532', '266500', '中国,山东省,青岛市,黄岛区', '120.197750000000', '35.960650000000', 'Huangdao');
INSERT INTO `cf_areas` VALUES ('370212', '崂山区', '370200', '崂山', '3', '0532', '266100', '中国,山东省,青岛市,崂山区', '120.469230000000', '36.107170000000', 'Laoshan');
INSERT INTO `cf_areas` VALUES ('370213', '李沧区', '370200', '李沧', '3', '0532', '266021', '中国,山东省,青岛市,李沧区', '120.432860000000', '36.145020000000', 'Licang');
INSERT INTO `cf_areas` VALUES ('370214', '城阳区', '370200', '城阳', '3', '0532', '266041', '中国,山东省,青岛市,城阳区', '120.396210000000', '36.307350000000', 'Chengyang');
INSERT INTO `cf_areas` VALUES ('370281', '胶州市', '370200', '胶州', '3', '0532', '266300', '中国,山东省,青岛市,胶州市', '120.033500000000', '36.264420000000', 'Jiaozhou');
INSERT INTO `cf_areas` VALUES ('370282', '即墨市', '370200', '即墨', '3', '0532', '266200', '中国,山东省,青岛市,即墨市', '120.446990000000', '36.389070000000', 'Jimo');
INSERT INTO `cf_areas` VALUES ('370283', '平度市', '370200', '平度', '3', '0532', '266700', '中国,山东省,青岛市,平度市', '119.959960000000', '36.786880000000', 'Pingdu');
INSERT INTO `cf_areas` VALUES ('370285', '莱西市', '370200', '莱西', '3', '0532', '266600', '中国,山东省,青岛市,莱西市', '120.517730000000', '36.888040000000', 'Laixi');
INSERT INTO `cf_areas` VALUES ('370286', '西海岸新区', '370200', '西海岸', '3', '0532', '266500', '中国,山东省,青岛市,西海岸新区', '120.197750000000', '35.960650000000', 'Xihai\'an');
INSERT INTO `cf_areas` VALUES ('370300', '淄博市', '370000', '淄博', '2', '0533', '255039', '中国,山东省,淄博市', '118.047648000000', '36.814939000000', 'Zibo');
INSERT INTO `cf_areas` VALUES ('370302', '淄川区', '370300', '淄川', '3', '0533', '255100', '中国,山东省,淄博市,淄川区', '117.966550000000', '36.643390000000', 'Zichuan');
INSERT INTO `cf_areas` VALUES ('370303', '张店区', '370300', '张店', '3', '0533', '255022', '中国,山东省,淄博市,张店区', '118.017880000000', '36.806760000000', 'Zhangdian');
INSERT INTO `cf_areas` VALUES ('370304', '博山区', '370300', '博山', '3', '0533', '255200', '中国,山东省,淄博市,博山区', '117.861660000000', '36.494690000000', 'Boshan');
INSERT INTO `cf_areas` VALUES ('370305', '临淄区', '370300', '临淄', '3', '0533', '255400', '中国,山东省,淄博市,临淄区', '118.309660000000', '36.825900000000', 'Linzi');
INSERT INTO `cf_areas` VALUES ('370306', '周村区', '370300', '周村', '3', '0533', '255300', '中国,山东省,淄博市,周村区', '117.869690000000', '36.803220000000', 'Zhoucun');
INSERT INTO `cf_areas` VALUES ('370321', '桓台县', '370300', '桓台', '3', '0533', '256400', '中国,山东省,淄博市,桓台县', '118.096980000000', '36.960360000000', 'Huantai');
INSERT INTO `cf_areas` VALUES ('370322', '高青县', '370300', '高青', '3', '0533', '256300', '中国,山东省,淄博市,高青县', '117.827080000000', '37.171970000000', 'Gaoqing');
INSERT INTO `cf_areas` VALUES ('370323', '沂源县', '370300', '沂源', '3', '0533', '256100', '中国,山东省,淄博市,沂源县', '118.171050000000', '36.185360000000', 'Yiyuan');
INSERT INTO `cf_areas` VALUES ('370400', '枣庄市', '370000', '枣庄', '2', '0632', '277101', '中国,山东省,枣庄市', '117.557964000000', '34.856424000000', 'Zaozhuang');
INSERT INTO `cf_areas` VALUES ('370402', '市中区', '370400', '市中区', '3', '0632', '277101', '中国,山东省,枣庄市,市中区', '117.556030000000', '34.863910000000', 'Shizhongqu');
INSERT INTO `cf_areas` VALUES ('370403', '薛城区', '370400', '薛城', '3', '0632', '277000', '中国,山东省,枣庄市,薛城区', '117.263180000000', '34.794980000000', 'Xuecheng');
INSERT INTO `cf_areas` VALUES ('370404', '峄城区', '370400', '峄城', '3', '0632', '277300', '中国,山东省,枣庄市,峄城区', '117.590570000000', '34.772250000000', 'Yicheng');
INSERT INTO `cf_areas` VALUES ('370405', '台儿庄区', '370400', '台儿庄', '3', '0632', '277400', '中国,山东省,枣庄市,台儿庄区', '117.734520000000', '34.563630000000', 'Taierzhuang');
INSERT INTO `cf_areas` VALUES ('370406', '山亭区', '370400', '山亭', '3', '0632', '277200', '中国,山东省,枣庄市,山亭区', '117.466300000000', '35.095410000000', 'Shanting');
INSERT INTO `cf_areas` VALUES ('370481', '滕州市', '370400', '滕州', '3', '0632', '277500', '中国,山东省,枣庄市,滕州市', '117.165000000000', '35.105340000000', 'Tengzhou');
INSERT INTO `cf_areas` VALUES ('370500', '东营市', '370000', '东营', '2', '0546', '257093', '中国,山东省,东营市', '118.496300000000', '37.461266000000', 'Dongying');
INSERT INTO `cf_areas` VALUES ('370502', '东营区', '370500', '东营', '3', '0546', '257029', '中国,山东省,东营市,东营区', '118.581600000000', '37.448750000000', 'Dongying');
INSERT INTO `cf_areas` VALUES ('370503', '河口区', '370500', '河口', '3', '0546', '257200', '中国,山东省,东营市,河口区', '118.524900000000', '37.885410000000', 'Hekou');
INSERT INTO `cf_areas` VALUES ('370521', '垦利县', '370500', '垦利', '3', '0546', '257500', '中国,山东省,东营市,垦利县', '118.548150000000', '37.588250000000', 'Kenli');
INSERT INTO `cf_areas` VALUES ('370522', '利津县', '370500', '利津', '3', '0546', '257400', '中国,山东省,东营市,利津县', '118.256370000000', '37.491570000000', 'Lijin');
INSERT INTO `cf_areas` VALUES ('370523', '广饶县', '370500', '广饶', '3', '0546', '257300', '中国,山东省,东营市,广饶县', '118.407040000000', '37.053810000000', 'Guangrao');
INSERT INTO `cf_areas` VALUES ('370600', '烟台市', '370000', '烟台', '2', '0635', '264010', '中国,山东省,烟台市', '121.391382000000', '37.539297000000', 'Yantai');
INSERT INTO `cf_areas` VALUES ('370602', '芝罘区', '370600', '芝罘', '3', '0635', '264001', '中国,山东省,烟台市,芝罘区', '121.400230000000', '37.540640000000', 'Zhifu');
INSERT INTO `cf_areas` VALUES ('370611', '福山区', '370600', '福山', '3', '0635', '265500', '中国,山东省,烟台市,福山区', '121.268120000000', '37.498410000000', 'Fushan');
INSERT INTO `cf_areas` VALUES ('370612', '牟平区', '370600', '牟平', '3', '0635', '264100', '中国,山东省,烟台市,牟平区', '121.600670000000', '37.388460000000', 'Muping');
INSERT INTO `cf_areas` VALUES ('370613', '莱山区', '370600', '莱山', '3', '0635', '264600', '中国,山东省,烟台市,莱山区', '121.445120000000', '37.511650000000', 'Laishan');
INSERT INTO `cf_areas` VALUES ('370634', '长岛县', '370600', '长岛', '3', '0635', '265800', '中国,山东省,烟台市,长岛县', '120.738000000000', '37.917540000000', 'Changdao');
INSERT INTO `cf_areas` VALUES ('370681', '龙口市', '370600', '龙口', '3', '0635', '265700', '中国,山东省,烟台市,龙口市', '120.506340000000', '37.640640000000', 'Longkou');
INSERT INTO `cf_areas` VALUES ('370682', '莱阳市', '370600', '莱阳', '3', '0635', '265200', '中国,山东省,烟台市,莱阳市', '120.710660000000', '36.980120000000', 'Laiyang');
INSERT INTO `cf_areas` VALUES ('370683', '莱州市', '370600', '莱州', '3', '0635', '261400', '中国,山东省,烟台市,莱州市', '119.941370000000', '37.178060000000', 'Laizhou');
INSERT INTO `cf_areas` VALUES ('370684', '蓬莱市', '370600', '蓬莱', '3', '0635', '265600', '中国,山东省,烟台市,蓬莱市', '120.759880000000', '37.811190000000', 'Penglai');
INSERT INTO `cf_areas` VALUES ('370685', '招远市', '370600', '招远', '3', '0635', '265400', '中国,山东省,烟台市,招远市', '120.404810000000', '37.362690000000', 'Zhaoyuan');
INSERT INTO `cf_areas` VALUES ('370686', '栖霞市', '370600', '栖霞', '3', '0635', '265300', '中国,山东省,烟台市,栖霞市', '120.850250000000', '37.335710000000', 'Qixia');
INSERT INTO `cf_areas` VALUES ('370687', '海阳市', '370600', '海阳', '3', '0635', '265100', '中国,山东省,烟台市,海阳市', '121.159760000000', '36.776220000000', 'Haiyang');
INSERT INTO `cf_areas` VALUES ('370700', '潍坊市', '370000', '潍坊', '2', '0536', '261041', '中国,山东省,潍坊市', '119.107078000000', '36.709250000000', 'Weifang');
INSERT INTO `cf_areas` VALUES ('370702', '潍城区', '370700', '潍城', '3', '0536', '261021', '中国,山东省,潍坊市,潍城区', '119.105820000000', '36.713900000000', 'Weicheng');
INSERT INTO `cf_areas` VALUES ('370703', '寒亭区', '370700', '寒亭', '3', '0536', '261100', '中国,山东省,潍坊市,寒亭区', '119.218320000000', '36.775040000000', 'Hanting');
INSERT INTO `cf_areas` VALUES ('370704', '坊子区', '370700', '坊子', '3', '0536', '261200', '中国,山东省,潍坊市,坊子区', '119.164760000000', '36.652180000000', 'Fangzi');
INSERT INTO `cf_areas` VALUES ('370705', '奎文区', '370700', '奎文', '3', '0536', '261031', '中国,山东省,潍坊市,奎文区', '119.125320000000', '36.707230000000', 'Kuiwen');
INSERT INTO `cf_areas` VALUES ('370724', '临朐县', '370700', '临朐', '3', '0536', '262600', '中国,山东省,潍坊市,临朐县', '118.544000000000', '36.512160000000', 'Linqu');
INSERT INTO `cf_areas` VALUES ('370725', '昌乐县', '370700', '昌乐', '3', '0536', '262400', '中国,山东省,潍坊市,昌乐县', '118.830170000000', '36.707800000000', 'Changle');
INSERT INTO `cf_areas` VALUES ('370781', '青州市', '370700', '青州', '3', '0536', '262500', '中国,山东省,潍坊市,青州市', '118.479150000000', '36.685050000000', 'Qingzhou');
INSERT INTO `cf_areas` VALUES ('370782', '诸城市', '370700', '诸城', '3', '0536', '262200', '中国,山东省,潍坊市,诸城市', '119.409880000000', '35.996620000000', 'Zhucheng');
INSERT INTO `cf_areas` VALUES ('370783', '寿光市', '370700', '寿光', '3', '0536', '262700', '中国,山东省,潍坊市,寿光市', '118.740470000000', '36.881280000000', 'Shouguang');
INSERT INTO `cf_areas` VALUES ('370784', '安丘市', '370700', '安丘', '3', '0536', '262100', '中国,山东省,潍坊市,安丘市', '119.218900000000', '36.478470000000', 'Anqiu');
INSERT INTO `cf_areas` VALUES ('370785', '高密市', '370700', '高密', '3', '0536', '261500', '中国,山东省,潍坊市,高密市', '119.757010000000', '36.383970000000', 'Gaomi');
INSERT INTO `cf_areas` VALUES ('370786', '昌邑市', '370700', '昌邑', '3', '0536', '261300', '中国,山东省,潍坊市,昌邑市', '119.397670000000', '36.860080000000', 'Changyi');
INSERT INTO `cf_areas` VALUES ('370800', '济宁市', '370000', '济宁', '2', '0537', '272119', '中国,山东省,济宁市', '116.587245000000', '35.415393000000', 'Jining');
INSERT INTO `cf_areas` VALUES ('370811', '任城区', '370800', '任城', '3', '0537', '272113', '中国,山东省,济宁市,任城区', '116.595040000000', '35.406590000000', 'Rencheng');
INSERT INTO `cf_areas` VALUES ('370812', '兖州区', '370800', '兖州', '3', '0537', '272000', '中国,山东省,济宁市,兖州区', '116.826546000000', '35.552305000000', 'Yanzhou ');
INSERT INTO `cf_areas` VALUES ('370826', '微山县', '370800', '微山', '3', '0537', '277600', '中国,山东省,济宁市,微山县', '117.128750000000', '34.807120000000', 'Weishan');
INSERT INTO `cf_areas` VALUES ('370827', '鱼台县', '370800', '鱼台', '3', '0537', '272300', '中国,山东省,济宁市,鱼台县', '116.647610000000', '34.996740000000', 'Yutai');
INSERT INTO `cf_areas` VALUES ('370828', '金乡县', '370800', '金乡', '3', '0537', '272200', '中国,山东省,济宁市,金乡县', '116.311460000000', '35.065000000000', 'Jinxiang');
INSERT INTO `cf_areas` VALUES ('370829', '嘉祥县', '370800', '嘉祥', '3', '0537', '272400', '中国,山东省,济宁市,嘉祥县', '116.342490000000', '35.408360000000', 'Jiaxiang');
INSERT INTO `cf_areas` VALUES ('370830', '汶上县', '370800', '汶上', '3', '0537', '272501', '中国,山东省,济宁市,汶上县', '116.487420000000', '35.732950000000', 'Wenshang');
INSERT INTO `cf_areas` VALUES ('370831', '泗水县', '370800', '泗水', '3', '0537', '273200', '中国,山东省,济宁市,泗水县', '117.279480000000', '35.661130000000', 'Sishui');
INSERT INTO `cf_areas` VALUES ('370832', '梁山县', '370800', '梁山', '3', '0537', '272600', '中国,山东省,济宁市,梁山县', '116.096830000000', '35.803220000000', 'Liangshan');
INSERT INTO `cf_areas` VALUES ('370881', '曲阜市', '370800', '曲阜', '3', '0537', '273100', '中国,山东省,济宁市,曲阜市', '116.986450000000', '35.580910000000', 'Qufu');
INSERT INTO `cf_areas` VALUES ('370883', '邹城市', '370800', '邹城', '3', '0537', '273500', '中国,山东省,济宁市,邹城市', '116.973350000000', '35.405310000000', 'Zoucheng');
INSERT INTO `cf_areas` VALUES ('370900', '泰安市', '370000', '泰安', '2', '0538', '271000', '中国,山东省,泰安市', '117.129063000000', '36.194968000000', 'Tai\'an');
INSERT INTO `cf_areas` VALUES ('370902', '泰山区', '370900', '泰山', '3', '0538', '271000', '中国,山东省,泰安市,泰山区', '117.134460000000', '36.194110000000', 'Taishan');
INSERT INTO `cf_areas` VALUES ('370911', '岱岳区', '370900', '岱岳', '3', '0538', '271000', '中国,山东省,泰安市,岱岳区', '117.041740000000', '36.187500000000', 'Daiyue');
INSERT INTO `cf_areas` VALUES ('370921', '宁阳县', '370900', '宁阳', '3', '0538', '271400', '中国,山东省,泰安市,宁阳县', '116.805420000000', '35.759900000000', 'Ningyang');
INSERT INTO `cf_areas` VALUES ('370923', '东平县', '370900', '东平', '3', '0538', '271500', '中国,山东省,泰安市,东平县', '116.471130000000', '35.937920000000', 'Dongping');
INSERT INTO `cf_areas` VALUES ('370982', '新泰市', '370900', '新泰', '3', '0538', '271200', '中国,山东省,泰安市,新泰市', '117.769590000000', '35.908870000000', 'Xintai');
INSERT INTO `cf_areas` VALUES ('370983', '肥城市', '370900', '肥城', '3', '0538', '271600', '中国,山东省,泰安市,肥城市', '116.768150000000', '36.182470000000', 'Feicheng');
INSERT INTO `cf_areas` VALUES ('371000', '威海市', '370000', '威海', '2', '0631', '264200', '中国,山东省,威海市', '122.116394000000', '37.509691000000', 'Weihai');
INSERT INTO `cf_areas` VALUES ('371002', '环翠区', '371000', '环翠', '3', '0631', '264200', '中国,山东省,威海市,环翠区', '122.123440000000', '37.501990000000', 'Huancui');
INSERT INTO `cf_areas` VALUES ('371003', '文登区', '371000', '文登', '3', '0631', '266440', '中国,山东省,威海市,文登区', '122.057139000000', '37.196211000000', 'Wendeng');
INSERT INTO `cf_areas` VALUES ('371082', '荣成市', '371000', '荣成', '3', '0631', '264300', '中国,山东省,威海市,荣成市', '122.487730000000', '37.165200000000', 'Rongcheng');
INSERT INTO `cf_areas` VALUES ('371083', '乳山市', '371000', '乳山', '3', '0631', '264500', '中国,山东省,威海市,乳山市', '121.538140000000', '36.919180000000', 'Rushan');
INSERT INTO `cf_areas` VALUES ('371100', '日照市', '370000', '日照', '2', '0633', '276800', '中国,山东省,日照市', '119.461208000000', '35.428588000000', 'Rizhao');
INSERT INTO `cf_areas` VALUES ('371102', '东港区', '371100', '东港', '3', '0633', '276800', '中国,山东省,日照市,东港区', '119.462370000000', '35.425410000000', 'Donggang');
INSERT INTO `cf_areas` VALUES ('371103', '岚山区', '371100', '岚山', '3', '0633', '276808', '中国,山东省,日照市,岚山区', '119.318840000000', '35.122030000000', 'Lanshan');
INSERT INTO `cf_areas` VALUES ('371121', '五莲县', '371100', '五莲', '3', '0633', '262300', '中国,山东省,日照市,五莲县', '119.207000000000', '35.750040000000', 'Wulian');
INSERT INTO `cf_areas` VALUES ('371122', '莒县', '371100', '莒县', '3', '0633', '276500', '中国,山东省,日照市,莒县', '118.837890000000', '35.580540000000', 'Juxian');
INSERT INTO `cf_areas` VALUES ('371200', '莱芜市', '370000', '莱芜', '2', '0634', '271100', '中国,山东省,莱芜市', '117.677736000000', '36.214397000000', 'Laiwu');
INSERT INTO `cf_areas` VALUES ('371202', '莱城区', '371200', '莱城', '3', '0634', '271199', '中国,山东省,莱芜市,莱城区', '117.659860000000', '36.203200000000', 'Laicheng');
INSERT INTO `cf_areas` VALUES ('371203', '钢城区', '371200', '钢城', '3', '0634', '271100', '中国,山东省,莱芜市,钢城区', '117.804900000000', '36.063190000000', 'Gangcheng');
INSERT INTO `cf_areas` VALUES ('371300', '临沂市', '370000', '临沂', '2', '0539', '253000', '中国,山东省,临沂市', '118.326443000000', '35.065282000000', 'Linyi');
INSERT INTO `cf_areas` VALUES ('371302', '兰山区', '371300', '兰山', '3', '0539', '276002', '中国,山东省,临沂市,兰山区', '118.348170000000', '35.068720000000', 'Lanshan');
INSERT INTO `cf_areas` VALUES ('371311', '罗庄区', '371300', '罗庄', '3', '0539', '276022', '中国,山东省,临沂市,罗庄区', '118.284660000000', '34.996270000000', 'Luozhuang');
INSERT INTO `cf_areas` VALUES ('371312', '河东区', '371300', '河东', '3', '0539', '276034', '中国,山东省,临沂市,河东区', '118.410550000000', '35.088030000000', 'Hedong');
INSERT INTO `cf_areas` VALUES ('371321', '沂南县', '371300', '沂南', '3', '0539', '276300', '中国,山东省,临沂市,沂南县', '118.470610000000', '35.551310000000', 'Yinan');
INSERT INTO `cf_areas` VALUES ('371322', '郯城县', '371300', '郯城', '3', '0539', '276100', '中国,山东省,临沂市,郯城县', '118.367120000000', '34.613540000000', 'Tancheng');
INSERT INTO `cf_areas` VALUES ('371323', '沂水县', '371300', '沂水', '3', '0539', '276400', '中国,山东省,临沂市,沂水县', '118.630090000000', '35.787310000000', 'Yishui');
INSERT INTO `cf_areas` VALUES ('371324', '兰陵县', '371300', '兰陵', '3', '0539', '277700', '中国,山东省,临沂市,兰陵县', '117.856592000000', '34.738315000000', 'Lanling');
INSERT INTO `cf_areas` VALUES ('371325', '费县', '371300', '费县', '3', '0539', '273400', '中国,山东省,临沂市,费县', '117.978360000000', '35.265620000000', 'Feixian');
INSERT INTO `cf_areas` VALUES ('371326', '平邑县', '371300', '平邑', '3', '0539', '273300', '中国,山东省,临沂市,平邑县', '117.638670000000', '35.505730000000', 'Pingyi');
INSERT INTO `cf_areas` VALUES ('371327', '莒南县', '371300', '莒南', '3', '0539', '276600', '中国,山东省,临沂市,莒南县', '118.832270000000', '35.175390000000', 'Junan');
INSERT INTO `cf_areas` VALUES ('371328', '蒙阴县', '371300', '蒙阴', '3', '0539', '276200', '中国,山东省,临沂市,蒙阴县', '117.945920000000', '35.709960000000', 'Mengyin');
INSERT INTO `cf_areas` VALUES ('371329', '临沭县', '371300', '临沭', '3', '0539', '276700', '中国,山东省,临沂市,临沭县', '118.652670000000', '34.920910000000', 'Linshu');
INSERT INTO `cf_areas` VALUES ('371400', '德州市', '370000', '德州', '2', '0534', '253000', '中国,山东省,德州市', '116.307428000000', '37.453968000000', 'Dezhou');
INSERT INTO `cf_areas` VALUES ('371402', '德城区', '371400', '德城', '3', '0534', '253012', '中国,山东省,德州市,德城区', '116.299430000000', '37.451260000000', 'Decheng');
INSERT INTO `cf_areas` VALUES ('371403', '陵城区', '371400', '陵城', '3', '0534', '253500', '中国,山东省,德州市,陵城区', '116.576010000000', '37.335710000000', 'Lingcheng');
INSERT INTO `cf_areas` VALUES ('371422', '宁津县', '371400', '宁津', '3', '0534', '253400', '中国,山东省,德州市,宁津县', '116.797020000000', '37.653010000000', 'Ningjin');
INSERT INTO `cf_areas` VALUES ('371423', '庆云县', '371400', '庆云', '3', '0534', '253700', '中国,山东省,德州市,庆云县', '117.386350000000', '37.776160000000', 'Qingyun');
INSERT INTO `cf_areas` VALUES ('371424', '临邑县', '371400', '临邑', '3', '0534', '251500', '中国,山东省,德州市,临邑县', '116.865470000000', '37.190530000000', 'Linyi');
INSERT INTO `cf_areas` VALUES ('371425', '齐河县', '371400', '齐河', '3', '0534', '251100', '中国,山东省,德州市,齐河县', '116.755150000000', '36.795320000000', 'Qihe');
INSERT INTO `cf_areas` VALUES ('371426', '平原县', '371400', '平原', '3', '0534', '253100', '中国,山东省,德州市,平原县', '116.434320000000', '37.166320000000', 'Pingyuan');
INSERT INTO `cf_areas` VALUES ('371427', '夏津县', '371400', '夏津', '3', '0534', '253200', '中国,山东省,德州市,夏津县', '116.001700000000', '36.948520000000', 'Xiajin');
INSERT INTO `cf_areas` VALUES ('371428', '武城县', '371400', '武城', '3', '0534', '253300', '中国,山东省,德州市,武城县', '116.070090000000', '37.214030000000', 'Wucheng');
INSERT INTO `cf_areas` VALUES ('371481', '乐陵市', '371400', '乐陵', '3', '0534', '253600', '中国,山东省,德州市,乐陵市', '117.231410000000', '37.731640000000', 'Leling');
INSERT INTO `cf_areas` VALUES ('371482', '禹城市', '371400', '禹城', '3', '0534', '251200', '中国,山东省,德州市,禹城市', '116.643090000000', '36.934440000000', 'Yucheng');
INSERT INTO `cf_areas` VALUES ('371500', '聊城市', '370000', '聊城', '2', '0635', '252052', '中国,山东省,聊城市', '115.980367000000', '36.456013000000', 'Liaocheng');
INSERT INTO `cf_areas` VALUES ('371502', '东昌府区', '371500', '东昌府', '3', '0635', '252000', '中国,山东省,聊城市,东昌府区', '115.973830000000', '36.444580000000', 'Dongchangfu');
INSERT INTO `cf_areas` VALUES ('371521', '阳谷县', '371500', '阳谷', '3', '0635', '252300', '中国,山东省,聊城市,阳谷县', '115.791260000000', '36.114440000000', 'Yanggu');
INSERT INTO `cf_areas` VALUES ('371522', '莘县', '371500', '莘县', '3', '0635', '252400', '中国,山东省,聊城市,莘县', '115.669700000000', '36.234230000000', 'Shenxian');
INSERT INTO `cf_areas` VALUES ('371523', '茌平县', '371500', '茌平', '3', '0635', '252100', '中国,山东省,聊城市,茌平县', '116.254910000000', '36.579690000000', 'Chiping');
INSERT INTO `cf_areas` VALUES ('371524', '东阿县', '371500', '东阿', '3', '0635', '252200', '中国,山东省,聊城市,东阿县', '116.250120000000', '36.332090000000', 'Dong\'e');
INSERT INTO `cf_areas` VALUES ('371525', '冠县', '371500', '冠县', '3', '0635', '252500', '中国,山东省,聊城市,冠县', '115.441950000000', '36.484290000000', 'Guanxian');
INSERT INTO `cf_areas` VALUES ('371526', '高唐县', '371500', '高唐', '3', '0635', '252800', '中国,山东省,聊城市,高唐县', '116.231720000000', '36.865350000000', 'Gaotang');
INSERT INTO `cf_areas` VALUES ('371581', '临清市', '371500', '临清', '3', '0635', '252600', '中国,山东省,聊城市,临清市', '115.706290000000', '36.839450000000', 'Linqing');
INSERT INTO `cf_areas` VALUES ('371600', '滨州市', '370000', '滨州', '2', '0543', '256619', '中国,山东省,滨州市', '118.016974000000', '37.383542000000', 'Binzhou');
INSERT INTO `cf_areas` VALUES ('371602', '滨城区', '371600', '滨城', '3', '0543', '256613', '中国,山东省,滨州市,滨城区', '118.020260000000', '37.385240000000', 'Bincheng');
INSERT INTO `cf_areas` VALUES ('371603', '沾化区', '371600', '沾化', '3', '0543', '256800', '中国,山东省,滨州市,沾化区', '118.132140000000', '37.698320000000', 'Zhanhua');
INSERT INTO `cf_areas` VALUES ('371621', '惠民县', '371600', '惠民', '3', '0543', '251700', '中国,山东省,滨州市,惠民县', '117.511130000000', '37.490130000000', 'Huimin');
INSERT INTO `cf_areas` VALUES ('371622', '阳信县', '371600', '阳信', '3', '0543', '251800', '中国,山东省,滨州市,阳信县', '117.581390000000', '37.641980000000', 'Yangxin');
INSERT INTO `cf_areas` VALUES ('371623', '无棣县', '371600', '无棣', '3', '0543', '251900', '中国,山东省,滨州市,无棣县', '117.613950000000', '37.740090000000', 'Wudi');
INSERT INTO `cf_areas` VALUES ('371625', '博兴县', '371600', '博兴', '3', '0543', '256500', '中国,山东省,滨州市,博兴县', '118.133600000000', '37.143160000000', 'Boxing');
INSERT INTO `cf_areas` VALUES ('371626', '邹平县', '371600', '邹平', '3', '0543', '256200', '中国,山东省,滨州市,邹平县', '117.743070000000', '36.862950000000', 'Zouping');
INSERT INTO `cf_areas` VALUES ('371627', '北海新区', '371600', '北海新区', '3', '0543', '256200', '中国,山东省,滨州市,北海新区', '118.016974000000', '37.383542000000', 'Beihaixinqu');
INSERT INTO `cf_areas` VALUES ('371700', '菏泽市', '370000', '菏泽', '2', '0530', '274020', '中国,山东省,菏泽市', '115.469381000000', '35.246531000000', 'Heze');
INSERT INTO `cf_areas` VALUES ('371702', '牡丹区', '371700', '牡丹', '3', '0530', '274009', '中国,山东省,菏泽市,牡丹区', '115.416620000000', '35.250910000000', 'Mudan');
INSERT INTO `cf_areas` VALUES ('371721', '曹县', '371700', '曹县', '3', '0530', '274400', '中国,山东省,菏泽市,曹县', '115.542260000000', '34.826590000000', 'Caoxian');
INSERT INTO `cf_areas` VALUES ('371722', '单县', '371700', '单县', '3', '0530', '273700', '中国,山东省,菏泽市,单县', '116.087030000000', '34.795140000000', 'Shanxian');
INSERT INTO `cf_areas` VALUES ('371723', '成武县', '371700', '成武', '3', '0530', '274200', '中国,山东省,菏泽市,成武县', '115.889700000000', '34.953320000000', 'Chengwu');
INSERT INTO `cf_areas` VALUES ('371724', '巨野县', '371700', '巨野', '3', '0530', '274900', '中国,山东省,菏泽市,巨野县', '116.094970000000', '35.397880000000', 'Juye');
INSERT INTO `cf_areas` VALUES ('371725', '郓城县', '371700', '郓城', '3', '0530', '274700', '中国,山东省,菏泽市,郓城县', '115.944390000000', '35.600440000000', 'Yuncheng');
INSERT INTO `cf_areas` VALUES ('371726', '鄄城县', '371700', '鄄城', '3', '0530', '274600', '中国,山东省,菏泽市,鄄城县', '115.509970000000', '35.564120000000', 'Juancheng');
INSERT INTO `cf_areas` VALUES ('371727', '定陶县', '371700', '定陶', '3', '0530', '274100', '中国,山东省,菏泽市,定陶县', '115.572870000000', '35.071180000000', 'Dingtao');
INSERT INTO `cf_areas` VALUES ('371728', '东明县', '371700', '东明', '3', '0530', '274500', '中国,山东省,菏泽市,东明县', '115.090790000000', '35.289060000000', 'Dongming');
INSERT INTO `cf_areas` VALUES ('410000', '河南省', '100000', '河南', '1', '', '', '中国,河南省', '113.665412000000', '34.757975000000', 'Henan');
INSERT INTO `cf_areas` VALUES ('410100', '郑州市', '410000', '郑州', '2', '0371', '450000', '中国,河南省,郑州市', '113.665412000000', '34.757975000000', 'Zhengzhou');
INSERT INTO `cf_areas` VALUES ('410102', '中原区', '410100', '中原', '3', '0371', '450007', '中国,河南省,郑州市,中原区', '113.613330000000', '34.748270000000', 'Zhongyuan');
INSERT INTO `cf_areas` VALUES ('410103', '二七区', '410100', '二七', '3', '0371', '450052', '中国,河南省,郑州市,二七区', '113.639310000000', '34.723360000000', 'Erqi');
INSERT INTO `cf_areas` VALUES ('410104', '管城回族区', '410100', '管城', '3', '0371', '450000', '中国,河南省,郑州市,管城回族区', '113.677340000000', '34.753830000000', 'Guancheng');
INSERT INTO `cf_areas` VALUES ('410105', '金水区', '410100', '金水', '3', '0371', '450003', '中国,河南省,郑州市,金水区', '113.660570000000', '34.800280000000', 'Jinshui');
INSERT INTO `cf_areas` VALUES ('410106', '上街区', '410100', '上街', '3', '0371', '450041', '中国,河南省,郑州市,上街区', '113.308970000000', '34.802760000000', 'Shangjie');
INSERT INTO `cf_areas` VALUES ('410108', '惠济区', '410100', '惠济', '3', '0371', '450053', '中国,河南省,郑州市,惠济区', '113.616880000000', '34.867350000000', 'Huiji');
INSERT INTO `cf_areas` VALUES ('410122', '中牟县', '410100', '中牟', '3', '0371', '451450', '中国,河南省,郑州市,中牟县', '113.976190000000', '34.718990000000', 'Zhongmu');
INSERT INTO `cf_areas` VALUES ('410181', '巩义市', '410100', '巩义', '3', '0371', '451200', '中国,河南省,郑州市,巩义市', '113.022000000000', '34.747940000000', 'Gongyi');
INSERT INTO `cf_areas` VALUES ('410182', '荥阳市', '410100', '荥阳', '3', '0371', '450100', '中国,河南省,郑州市,荥阳市', '113.383450000000', '34.787590000000', 'Xingyang');
INSERT INTO `cf_areas` VALUES ('410183', '新密市', '410100', '新密', '3', '0371', '452300', '中国,河南省,郑州市,新密市', '113.386900000000', '34.537040000000', 'Xinmi');
INSERT INTO `cf_areas` VALUES ('410184', '新郑市', '410100', '新郑', '3', '0371', '451100', '中国,河南省,郑州市,新郑市', '113.736450000000', '34.395500000000', 'Xinzheng');
INSERT INTO `cf_areas` VALUES ('410185', '登封市', '410100', '登封', '3', '0371', '452470', '中国,河南省,郑州市,登封市', '113.050230000000', '34.453450000000', 'Dengfeng');
INSERT INTO `cf_areas` VALUES ('410200', '开封市', '410000', '开封', '2', '0378', '475001', '中国,河南省,开封市', '114.341447000000', '34.797049000000', 'Kaifeng');
INSERT INTO `cf_areas` VALUES ('410202', '龙亭区', '410200', '龙亭', '3', '0378', '475100', '中国,河南省,开封市,龙亭区', '114.354840000000', '34.799950000000', 'Longting');
INSERT INTO `cf_areas` VALUES ('410203', '顺河回族区', '410200', '顺河', '3', '0378', '475000', '中国,河南省,开封市,顺河回族区', '114.361230000000', '34.795860000000', 'Shunhe');
INSERT INTO `cf_areas` VALUES ('410204', '鼓楼区', '410200', '鼓楼', '3', '0378', '475000', '中国,河南省,开封市,鼓楼区', '114.355590000000', '34.795170000000', 'Gulou');
INSERT INTO `cf_areas` VALUES ('410205', '禹王台区', '410200', '禹王台', '3', '0378', '475003', '中国,河南省,开封市,禹王台区', '114.347870000000', '34.776930000000', 'Yuwangtai');
INSERT INTO `cf_areas` VALUES ('410212', '祥符区', '410200', '祥符', '3', '0378', '475100', '中国,河南省,开封市,祥符区', '114.438590000000', '34.758740000000', 'Xiangfu');
INSERT INTO `cf_areas` VALUES ('410221', '杞县', '410200', '杞县', '3', '0378', '475200', '中国,河南省,开封市,杞县', '114.782800000000', '34.550330000000', 'Qixian');
INSERT INTO `cf_areas` VALUES ('410222', '通许县', '410200', '通许', '3', '0378', '475400', '中国,河南省,开封市,通许县', '114.467160000000', '34.475220000000', 'Tongxu');
INSERT INTO `cf_areas` VALUES ('410223', '尉氏县', '410200', '尉氏', '3', '0378', '475500', '中国,河南省,开封市,尉氏县', '114.192840000000', '34.412230000000', 'Weishi');
INSERT INTO `cf_areas` VALUES ('410225', '兰考县', '410200', '兰考', '3', '0378', '475300', '中国,河南省,开封市,兰考县', '114.819610000000', '34.823500000000', 'Lankao');
INSERT INTO `cf_areas` VALUES ('410300', '洛阳市', '410000', '洛阳', '2', '0379', '471000', '中国,河南省,洛阳市', '112.434468000000', '34.663041000000', 'Luoyang');
INSERT INTO `cf_areas` VALUES ('410302', '老城区', '410300', '老城', '3', '0379', '471002', '中国,河南省,洛阳市,老城区', '112.469020000000', '34.683640000000', 'Laocheng');
INSERT INTO `cf_areas` VALUES ('410303', '西工区', '410300', '西工', '3', '0379', '471000', '中国,河南省,洛阳市,西工区', '112.437100000000', '34.670000000000', 'Xigong');
INSERT INTO `cf_areas` VALUES ('410304', '瀍河回族区', '410300', '瀍河', '3', '0379', '471002', '中国,河南省,洛阳市,瀍河回族区', '112.500180000000', '34.679850000000', 'Chanhe');
INSERT INTO `cf_areas` VALUES ('410305', '涧西区', '410300', '涧西', '3', '0379', '471003', '中国,河南省,洛阳市,涧西区', '112.395880000000', '34.658230000000', 'Jianxi');
INSERT INTO `cf_areas` VALUES ('410306', '吉利区', '410300', '吉利', '3', '0379', '471012', '中国,河南省,洛阳市,吉利区', '112.589050000000', '34.900880000000', 'Jili');
INSERT INTO `cf_areas` VALUES ('410311', '洛龙区', '410300', '洛龙', '3', '0379', '471000', '中国,河南省,洛阳市,洛龙区', '112.464120000000', '34.618660000000', 'Luolong');
INSERT INTO `cf_areas` VALUES ('410322', '孟津县', '410300', '孟津', '3', '0379', '471100', '中国,河南省,洛阳市,孟津县', '112.443510000000', '34.826000000000', 'Mengjin');
INSERT INTO `cf_areas` VALUES ('410323', '新安县', '410300', '新安', '3', '0379', '471800', '中国,河南省,洛阳市,新安县', '112.132380000000', '34.728140000000', 'Xin\'an');
INSERT INTO `cf_areas` VALUES ('410324', '栾川县', '410300', '栾川', '3', '0379', '471500', '中国,河南省,洛阳市,栾川县', '111.617790000000', '33.785760000000', 'Luanchuan');
INSERT INTO `cf_areas` VALUES ('410325', '嵩县', '410300', '嵩县', '3', '0379', '471400', '中国,河南省,洛阳市,嵩县', '112.085260000000', '34.134660000000', 'Songxian');
INSERT INTO `cf_areas` VALUES ('410326', '汝阳县', '410300', '汝阳', '3', '0379', '471200', '中国,河南省,洛阳市,汝阳县', '112.473140000000', '34.153870000000', 'Ruyang');
INSERT INTO `cf_areas` VALUES ('410327', '宜阳县', '410300', '宜阳', '3', '0379', '471600', '中国,河南省,洛阳市,宜阳县', '112.179070000000', '34.515230000000', 'Yiyang');
INSERT INTO `cf_areas` VALUES ('410328', '洛宁县', '410300', '洛宁', '3', '0379', '471700', '中国,河南省,洛阳市,洛宁县', '111.650870000000', '34.389130000000', 'Luoning');
INSERT INTO `cf_areas` VALUES ('410329', '伊川县', '410300', '伊川', '3', '0379', '471300', '中国,河南省,洛阳市,伊川县', '112.429470000000', '34.422050000000', 'Yichuan');
INSERT INTO `cf_areas` VALUES ('410381', '偃师市', '410300', '偃师', '3', '0379', '471900', '中国,河南省,洛阳市,偃师市', '112.792200000000', '34.728100000000', 'Yanshi');
INSERT INTO `cf_areas` VALUES ('410400', '平顶山市', '410000', '平顶山', '2', '0375', '467000', '中国,河南省,平顶山市', '113.307718000000', '33.735241000000', 'Pingdingshan');
INSERT INTO `cf_areas` VALUES ('410402', '新华区', '410400', '新华', '3', '0375', '467002', '中国,河南省,平顶山市,新华区', '113.294020000000', '33.737300000000', 'Xinhua');
INSERT INTO `cf_areas` VALUES ('410403', '卫东区', '410400', '卫东', '3', '0375', '467021', '中国,河南省,平顶山市,卫东区', '113.335110000000', '33.734720000000', 'Weidong');
INSERT INTO `cf_areas` VALUES ('410404', '石龙区', '410400', '石龙', '3', '0375', '467045', '中国,河南省,平顶山市,石龙区', '112.898790000000', '33.898780000000', 'Shilong');
INSERT INTO `cf_areas` VALUES ('410411', '湛河区', '410400', '湛河', '3', '0375', '467000', '中国,河南省,平顶山市,湛河区', '113.292520000000', '33.736200000000', 'Zhanhe');
INSERT INTO `cf_areas` VALUES ('410421', '宝丰县', '410400', '宝丰', '3', '0375', '467400', '中国,河南省,平顶山市,宝丰县', '113.054930000000', '33.869160000000', 'Baofeng');
INSERT INTO `cf_areas` VALUES ('410422', '叶县', '410400', '叶县', '3', '0375', '467200', '中国,河南省,平顶山市,叶县', '113.351040000000', '33.622250000000', 'Yexian');
INSERT INTO `cf_areas` VALUES ('410423', '鲁山县', '410400', '鲁山', '3', '0375', '467300', '中国,河南省,平顶山市,鲁山县', '112.905700000000', '33.738790000000', 'Lushan');
INSERT INTO `cf_areas` VALUES ('410425', '郏县', '410400', '郏县', '3', '0375', '467100', '中国,河南省,平顶山市,郏县', '113.215880000000', '33.970720000000', 'Jiaxian');
INSERT INTO `cf_areas` VALUES ('410481', '舞钢市', '410400', '舞钢', '3', '0375', '462500', '中国,河南省,平顶山市,舞钢市', '113.524170000000', '33.293800000000', 'Wugang');
INSERT INTO `cf_areas` VALUES ('410482', '汝州市', '410400', '汝州', '3', '0375', '467500', '中国,河南省,平顶山市,汝州市', '112.843010000000', '34.161350000000', 'Ruzhou');
INSERT INTO `cf_areas` VALUES ('410500', '安阳市', '410000', '安阳', '2', '0372', '455000', '中国,河南省,安阳市', '114.352482000000', '36.103442000000', 'Anyang');
INSERT INTO `cf_areas` VALUES ('410502', '文峰区', '410500', '文峰', '3', '0372', '455000', '中国,河南省,安阳市,文峰区', '114.357080000000', '36.090460000000', 'Wenfeng');
INSERT INTO `cf_areas` VALUES ('410503', '北关区', '410500', '北关', '3', '0372', '455001', '中国,河南省,安阳市,北关区', '114.357350000000', '36.118720000000', 'Beiguan');
INSERT INTO `cf_areas` VALUES ('410505', '殷都区', '410500', '殷都', '3', '0372', '455004', '中国,河南省,安阳市,殷都区', '114.303400000000', '36.109900000000', 'Yindu');
INSERT INTO `cf_areas` VALUES ('410506', '龙安区', '410500', '龙安', '3', '0372', '455001', '中国,河南省,安阳市,龙安区', '114.348140000000', '36.119040000000', 'Long\'an');
INSERT INTO `cf_areas` VALUES ('410522', '安阳县', '410500', '安阳', '3', '0372', '455000', '中国,河南省,安阳市,安阳县', '114.366050000000', '36.066950000000', 'Anyang');
INSERT INTO `cf_areas` VALUES ('410523', '汤阴县', '410500', '汤阴', '3', '0372', '456150', '中国,河南省,安阳市,汤阴县', '114.358390000000', '35.921520000000', 'Tangyin');
INSERT INTO `cf_areas` VALUES ('410526', '滑县', '410500', '滑县', '3', '0372', '456400', '中国,河南省,安阳市,滑县', '114.520660000000', '35.580700000000', 'Huaxian');
INSERT INTO `cf_areas` VALUES ('410527', '内黄县', '410500', '内黄', '3', '0372', '456350', '中国,河南省,安阳市,内黄县', '114.906730000000', '35.952690000000', 'Neihuang');
INSERT INTO `cf_areas` VALUES ('410581', '林州市', '410500', '林州', '3', '0372', '456550', '中国,河南省,安阳市,林州市', '113.815580000000', '36.078040000000', 'Linzhou');
INSERT INTO `cf_areas` VALUES ('410600', '鹤壁市', '410000', '鹤壁', '2', '0392', '458030', '中国,河南省,鹤壁市', '114.295444000000', '35.748236000000', 'Hebi');
INSERT INTO `cf_areas` VALUES ('410602', '鹤山区', '410600', '鹤山', '3', '0392', '458010', '中国,河南省,鹤壁市,鹤山区', '114.163360000000', '35.954580000000', 'Heshan');
INSERT INTO `cf_areas` VALUES ('410603', '山城区', '410600', '山城', '3', '0392', '458000', '中国,河南省,鹤壁市,山城区', '114.184430000000', '35.897730000000', 'Shancheng');
INSERT INTO `cf_areas` VALUES ('410611', '淇滨区', '410600', '淇滨', '3', '0392', '458000', '中国,河南省,鹤壁市,淇滨区', '114.298670000000', '35.741270000000', 'Qibin');
INSERT INTO `cf_areas` VALUES ('410621', '浚县', '410600', '浚县', '3', '0392', '456250', '中国,河南省,鹤壁市,浚县', '114.548790000000', '35.670850000000', 'Xunxian');
INSERT INTO `cf_areas` VALUES ('410622', '淇县', '410600', '淇县', '3', '0392', '456750', '中国,河南省,鹤壁市,淇县', '114.197600000000', '35.607820000000', 'Qixian');
INSERT INTO `cf_areas` VALUES ('410700', '新乡市', '410000', '新乡', '2', '0373', '453000', '中国,河南省,新乡市', '113.883991000000', '35.302616000000', 'Xinxiang');
INSERT INTO `cf_areas` VALUES ('410702', '红旗区', '410700', '红旗', '3', '0373', '453000', '中国,河南省,新乡市,红旗区', '113.875230000000', '35.303670000000', 'Hongqi');
INSERT INTO `cf_areas` VALUES ('410703', '卫滨区', '410700', '卫滨', '3', '0373', '453000', '中国,河南省,新乡市,卫滨区', '113.865780000000', '35.302110000000', 'Weibin');
INSERT INTO `cf_areas` VALUES ('410704', '凤泉区', '410700', '凤泉', '3', '0373', '453011', '中国,河南省,新乡市,凤泉区', '113.915070000000', '35.383990000000', 'Fengquan');
INSERT INTO `cf_areas` VALUES ('410711', '牧野区', '410700', '牧野', '3', '0373', '453002', '中国,河南省,新乡市,牧野区', '113.908600000000', '35.314900000000', 'Muye');
INSERT INTO `cf_areas` VALUES ('410721', '新乡县', '410700', '新乡', '3', '0373', '453700', '中国,河南省,新乡市,新乡县', '113.805110000000', '35.190750000000', 'Xinxiang');
INSERT INTO `cf_areas` VALUES ('410724', '获嘉县', '410700', '获嘉', '3', '0373', '453800', '中国,河南省,新乡市,获嘉县', '113.661590000000', '35.265210000000', 'Huojia');
INSERT INTO `cf_areas` VALUES ('410725', '原阳县', '410700', '原阳', '3', '0373', '453500', '中国,河南省,新乡市,原阳县', '113.939940000000', '35.065650000000', 'Yuanyang');
INSERT INTO `cf_areas` VALUES ('410726', '延津县', '410700', '延津', '3', '0373', '453200', '中国,河南省,新乡市,延津县', '114.202660000000', '35.143270000000', 'Yanjin');
INSERT INTO `cf_areas` VALUES ('410727', '封丘县', '410700', '封丘', '3', '0373', '453300', '中国,河南省,新乡市,封丘县', '114.419150000000', '35.041660000000', 'Fengqiu');
INSERT INTO `cf_areas` VALUES ('410728', '长垣县', '410700', '长垣', '3', '0373', '453400', '中国,河南省,新乡市,长垣县', '114.668820000000', '35.200460000000', 'Changyuan');
INSERT INTO `cf_areas` VALUES ('410781', '卫辉市', '410700', '卫辉', '3', '0373', '453100', '中国,河南省,新乡市,卫辉市', '114.064540000000', '35.398430000000', 'Weihui');
INSERT INTO `cf_areas` VALUES ('410782', '辉县市', '410700', '辉县', '3', '0373', '453600', '中国,河南省,新乡市,辉县市', '113.806700000000', '35.463070000000', 'Huixian');
INSERT INTO `cf_areas` VALUES ('410800', '焦作市', '410000', '焦作', '2', '0391', '454002', '中国,河南省,焦作市', '113.238266000000', '35.239040000000', 'Jiaozuo');
INSERT INTO `cf_areas` VALUES ('410802', '解放区', '410800', '解放', '3', '0391', '454000', '中国,河南省,焦作市,解放区', '113.229330000000', '35.240230000000', 'Jiefang');
INSERT INTO `cf_areas` VALUES ('410803', '中站区', '410800', '中站', '3', '0391', '454191', '中国,河南省,焦作市,中站区', '113.183150000000', '35.236650000000', 'Zhongzhan');
INSERT INTO `cf_areas` VALUES ('410804', '马村区', '410800', '马村', '3', '0391', '454171', '中国,河南省,焦作市,马村区', '113.318700000000', '35.269080000000', 'Macun');
INSERT INTO `cf_areas` VALUES ('410811', '山阳区', '410800', '山阳', '3', '0391', '454002', '中国,河南省,焦作市,山阳区', '113.254640000000', '35.214360000000', 'Shanyang');
INSERT INTO `cf_areas` VALUES ('410821', '修武县', '410800', '修武', '3', '0391', '454350', '中国,河南省,焦作市,修武县', '113.447750000000', '35.223570000000', 'Xiuwu');
INSERT INTO `cf_areas` VALUES ('410822', '博爱县', '410800', '博爱', '3', '0391', '454450', '中国,河南省,焦作市,博爱县', '113.066980000000', '35.169430000000', 'Boai');
INSERT INTO `cf_areas` VALUES ('410823', '武陟县', '410800', '武陟', '3', '0391', '454950', '中国,河南省,焦作市,武陟县', '113.397180000000', '35.095050000000', 'Wuzhi');
INSERT INTO `cf_areas` VALUES ('410825', '温县', '410800', '温县', '3', '0391', '454850', '中国,河南省,焦作市,温县', '113.080650000000', '34.940220000000', 'Wenxian');
INSERT INTO `cf_areas` VALUES ('410882', '沁阳市', '410800', '沁阳', '3', '0391', '454550', '中国,河南省,焦作市,沁阳市', '112.944940000000', '35.089350000000', 'Qinyang');
INSERT INTO `cf_areas` VALUES ('410883', '孟州市', '410800', '孟州', '3', '0391', '454750', '中国,河南省,焦作市,孟州市', '112.791380000000', '34.907100000000', 'Mengzhou');
INSERT INTO `cf_areas` VALUES ('410900', '濮阳市', '410000', '濮阳', '2', '0393', '457000', '中国,河南省,濮阳市', '115.041299000000', '35.768234000000', 'Puyang');
INSERT INTO `cf_areas` VALUES ('410902', '华龙区', '410900', '华龙', '3', '0393', '457001', '中国,河南省,濮阳市,华龙区', '115.074460000000', '35.777360000000', 'Hualong');
INSERT INTO `cf_areas` VALUES ('410922', '清丰县', '410900', '清丰', '3', '0393', '457300', '中国,河南省,濮阳市,清丰县', '115.104150000000', '35.885070000000', 'Qingfeng');
INSERT INTO `cf_areas` VALUES ('410923', '南乐县', '410900', '南乐', '3', '0393', '457400', '中国,河南省,濮阳市,南乐县', '115.206390000000', '36.076860000000', 'Nanle');
INSERT INTO `cf_areas` VALUES ('410926', '范县', '410900', '范县', '3', '0393', '457500', '中国,河南省,濮阳市,范县', '115.504050000000', '35.851780000000', 'Fanxian');
INSERT INTO `cf_areas` VALUES ('410927', '台前县', '410900', '台前', '3', '0393', '457600', '中国,河南省,濮阳市,台前县', '115.871580000000', '35.969230000000', 'Taiqian');
INSERT INTO `cf_areas` VALUES ('410928', '濮阳县', '410900', '濮阳', '3', '0393', '457100', '中国,河南省,濮阳市,濮阳县', '115.030570000000', '35.707450000000', 'Puyang');
INSERT INTO `cf_areas` VALUES ('411000', '许昌市', '410000', '许昌', '2', '0374', '461000', '中国,河南省,许昌市', '113.826063000000', '34.022956000000', 'Xuchang');
INSERT INTO `cf_areas` VALUES ('411002', '魏都区', '411000', '魏都', '3', '0374', '461000', '中国,河南省,许昌市,魏都区', '113.822700000000', '34.025440000000', 'Weidu');
INSERT INTO `cf_areas` VALUES ('411023', '许昌县', '411000', '许昌', '3', '0374', '461100', '中国,河南省,许昌市,许昌县', '113.847070000000', '34.004060000000', 'Xuchang');
INSERT INTO `cf_areas` VALUES ('411024', '鄢陵县', '411000', '鄢陵', '3', '0374', '461200', '中国,河南省,许昌市,鄢陵县', '114.187950000000', '34.103170000000', 'Yanling');
INSERT INTO `cf_areas` VALUES ('411025', '襄城县', '411000', '襄城', '3', '0374', '461700', '中国,河南省,许昌市,襄城县', '113.481960000000', '33.849280000000', 'Xiangcheng');
INSERT INTO `cf_areas` VALUES ('411081', '禹州市', '411000', '禹州', '3', '0374', '461670', '中国,河南省,许昌市,禹州市', '113.488030000000', '34.140540000000', 'Yuzhou');
INSERT INTO `cf_areas` VALUES ('411082', '长葛市', '411000', '长葛', '3', '0374', '461500', '中国,河南省,许昌市,长葛市', '113.773280000000', '34.218460000000', 'Changge');
INSERT INTO `cf_areas` VALUES ('411100', '漯河市', '410000', '漯河', '2', '0395', '462000', '中国,河南省,漯河市', '114.026405000000', '33.575855000000', 'Luohe');
INSERT INTO `cf_areas` VALUES ('411102', '源汇区', '411100', '源汇', '3', '0395', '462000', '中国,河南省,漯河市,源汇区', '114.006470000000', '33.556270000000', 'Yuanhui');
INSERT INTO `cf_areas` VALUES ('411103', '郾城区', '411100', '郾城', '3', '0395', '462300', '中国,河南省,漯河市,郾城区', '114.006940000000', '33.587230000000', 'Yancheng');
INSERT INTO `cf_areas` VALUES ('411104', '召陵区', '411100', '召陵', '3', '0395', '462300', '中国,河南省,漯河市,召陵区', '114.093990000000', '33.586010000000', 'Zhaoling');
INSERT INTO `cf_areas` VALUES ('411121', '舞阳县', '411100', '舞阳', '3', '0395', '462400', '中国,河南省,漯河市,舞阳县', '113.598480000000', '33.432430000000', 'Wuyang');
INSERT INTO `cf_areas` VALUES ('411122', '临颍县', '411100', '临颍', '3', '0395', '462600', '中国,河南省,漯河市,临颍县', '113.936610000000', '33.811230000000', 'Linying');
INSERT INTO `cf_areas` VALUES ('411200', '三门峡市', '410000', '三门峡', '2', '0398', '472000', '中国,河南省,三门峡市', '111.194099000000', '34.777338000000', 'Sanmenxia');
INSERT INTO `cf_areas` VALUES ('411202', '湖滨区', '411200', '湖滨', '3', '0398', '472000', '中国,河南省,三门峡市,湖滨区', '111.200060000000', '34.778720000000', 'Hubin');
INSERT INTO `cf_areas` VALUES ('411221', '渑池县', '411200', '渑池', '3', '0398', '472400', '中国,河南省,三门峡市,渑池县', '111.761840000000', '34.767250000000', 'Mianchi');
INSERT INTO `cf_areas` VALUES ('411222', '陕县', '411200', '陕县', '3', '0398', '472100', '中国,河南省,三门峡市,陕县', '111.103330000000', '34.720520000000', 'Shanxian');
INSERT INTO `cf_areas` VALUES ('411224', '卢氏县', '411200', '卢氏', '3', '0398', '472200', '中国,河南省,三门峡市,卢氏县', '111.047820000000', '34.054360000000', 'Lushi');
INSERT INTO `cf_areas` VALUES ('411281', '义马市', '411200', '义马', '3', '0398', '472300', '中国,河南省,三门峡市,义马市', '111.874450000000', '34.747210000000', 'Yima');
INSERT INTO `cf_areas` VALUES ('411282', '灵宝市', '411200', '灵宝', '3', '0398', '472500', '中国,河南省,三门峡市,灵宝市', '110.894500000000', '34.516820000000', 'Lingbao');
INSERT INTO `cf_areas` VALUES ('411300', '南阳市', '410000', '南阳', '2', '0377', '473002', '中国,河南省,南阳市', '112.540918000000', '32.999082000000', 'Nanyang');
INSERT INTO `cf_areas` VALUES ('411302', '宛城区', '411300', '宛城', '3', '0377', '473001', '中国,河南省,南阳市,宛城区', '112.539550000000', '33.003780000000', 'Wancheng');
INSERT INTO `cf_areas` VALUES ('411303', '卧龙区', '411300', '卧龙', '3', '0377', '473003', '中国,河南省,南阳市,卧龙区', '112.534790000000', '32.986150000000', 'Wolong');
INSERT INTO `cf_areas` VALUES ('411321', '南召县', '411300', '南召', '3', '0377', '474650', '中国,河南省,南阳市,南召县', '112.431940000000', '33.490980000000', 'Nanzhao');
INSERT INTO `cf_areas` VALUES ('411322', '方城县', '411300', '方城', '3', '0377', '473200', '中国,河南省,南阳市,方城县', '113.012690000000', '33.254530000000', 'Fangcheng');
INSERT INTO `cf_areas` VALUES ('411323', '西峡县', '411300', '西峡', '3', '0377', '474550', '中国,河南省,南阳市,西峡县', '111.481870000000', '33.297720000000', 'Xixia');
INSERT INTO `cf_areas` VALUES ('411324', '镇平县', '411300', '镇平', '3', '0377', '474250', '中国,河南省,南阳市,镇平县', '112.239800000000', '33.036290000000', 'Zhenping');
INSERT INTO `cf_areas` VALUES ('411325', '内乡县', '411300', '内乡', '3', '0377', '474350', '中国,河南省,南阳市,内乡县', '111.849570000000', '33.046710000000', 'Neixiang');
INSERT INTO `cf_areas` VALUES ('411326', '淅川县', '411300', '淅川', '3', '0377', '474450', '中国,河南省,南阳市,淅川县', '111.486630000000', '33.137080000000', 'Xichuan');
INSERT INTO `cf_areas` VALUES ('411327', '社旗县', '411300', '社旗', '3', '0377', '473300', '中国,河南省,南阳市,社旗县', '112.946560000000', '33.055030000000', 'Sheqi');
INSERT INTO `cf_areas` VALUES ('411328', '唐河县', '411300', '唐河', '3', '0377', '473400', '中国,河南省,南阳市,唐河县', '112.836090000000', '32.694530000000', 'Tanghe');
INSERT INTO `cf_areas` VALUES ('411329', '新野县', '411300', '新野', '3', '0377', '473500', '中国,河南省,南阳市,新野县', '112.361510000000', '32.516980000000', 'Xinye');
INSERT INTO `cf_areas` VALUES ('411330', '桐柏县', '411300', '桐柏', '3', '0377', '474750', '中国,河南省,南阳市,桐柏县', '113.428860000000', '32.379170000000', 'Tongbai');
INSERT INTO `cf_areas` VALUES ('411381', '邓州市', '411300', '邓州', '3', '0377', '474150', '中国,河南省,南阳市,邓州市', '112.089600000000', '32.685770000000', 'Dengzhou');
INSERT INTO `cf_areas` VALUES ('411400', '商丘市', '410000', '商丘', '2', '0370', '476000', '中国,河南省,商丘市', '115.650497000000', '34.437054000000', 'Shangqiu');
INSERT INTO `cf_areas` VALUES ('411402', '梁园区', '411400', '梁园', '3', '0370', '476000', '中国,河南省,商丘市,梁园区', '115.644870000000', '34.443410000000', 'Liangyuan');
INSERT INTO `cf_areas` VALUES ('411403', '睢阳区', '411400', '睢阳', '3', '0370', '476100', '中国,河南省,商丘市,睢阳区', '115.653380000000', '34.388040000000', 'Suiyang');
INSERT INTO `cf_areas` VALUES ('411421', '民权县', '411400', '民权', '3', '0370', '476800', '中国,河南省,商丘市,民权县', '115.146210000000', '34.649310000000', 'Minquan');
INSERT INTO `cf_areas` VALUES ('411422', '睢县', '411400', '睢县', '3', '0370', '476900', '中国,河南省,商丘市,睢县', '115.071680000000', '34.445390000000', 'Suixian');
INSERT INTO `cf_areas` VALUES ('411423', '宁陵县', '411400', '宁陵', '3', '0370', '476700', '中国,河南省,商丘市,宁陵县', '115.305110000000', '34.454630000000', 'Ningling');
INSERT INTO `cf_areas` VALUES ('411424', '柘城县', '411400', '柘城', '3', '0370', '476200', '中国,河南省,商丘市,柘城县', '115.305380000000', '34.091100000000', 'Zhecheng');
INSERT INTO `cf_areas` VALUES ('411425', '虞城县', '411400', '虞城', '3', '0370', '476300', '中国,河南省,商丘市,虞城县', '115.863370000000', '34.401890000000', 'Yucheng');
INSERT INTO `cf_areas` VALUES ('411426', '夏邑县', '411400', '夏邑', '3', '0370', '476400', '中国,河南省,商丘市,夏邑县', '116.133480000000', '34.232420000000', 'Xiayi');
INSERT INTO `cf_areas` VALUES ('411481', '永城市', '411400', '永城', '3', '0370', '476600', '中国,河南省,商丘市,永城市', '116.449430000000', '33.929110000000', 'Yongcheng');
INSERT INTO `cf_areas` VALUES ('411500', '信阳市', '410000', '信阳', '2', '0376', '464000', '中国,河南省,信阳市', '114.075031000000', '32.123274000000', 'Xinyang');
INSERT INTO `cf_areas` VALUES ('411502', '浉河区', '411500', '浉河', '3', '0376', '464000', '中国,河南省,信阳市,浉河区', '114.058710000000', '32.116800000000', 'Shihe');
INSERT INTO `cf_areas` VALUES ('411503', '平桥区', '411500', '平桥', '3', '0376', '464100', '中国,河南省,信阳市,平桥区', '114.124350000000', '32.100950000000', 'Pingqiao');
INSERT INTO `cf_areas` VALUES ('411521', '罗山县', '411500', '罗山', '3', '0376', '464200', '中国,河南省,信阳市,罗山县', '114.531400000000', '32.202770000000', 'Luoshan');
INSERT INTO `cf_areas` VALUES ('411522', '光山县', '411500', '光山', '3', '0376', '465450', '中国,河南省,信阳市,光山县', '114.918730000000', '32.009920000000', 'Guangshan');
INSERT INTO `cf_areas` VALUES ('411523', '新县', '411500', '新县', '3', '0376', '465550', '中国,河南省,信阳市,新县', '114.879240000000', '31.643860000000', 'Xinxian');
INSERT INTO `cf_areas` VALUES ('411524', '商城县', '411500', '商城', '3', '0376', '465350', '中国,河南省,信阳市,商城县', '115.408560000000', '31.799860000000', 'Shangcheng');
INSERT INTO `cf_areas` VALUES ('411525', '固始县', '411500', '固始', '3', '0376', '465250', '中国,河南省,信阳市,固始县', '115.682980000000', '32.180110000000', 'Gushi');
INSERT INTO `cf_areas` VALUES ('411526', '潢川县', '411500', '潢川', '3', '0376', '465150', '中国,河南省,信阳市,潢川县', '115.046960000000', '32.137630000000', 'Huangchuan');
INSERT INTO `cf_areas` VALUES ('411527', '淮滨县', '411500', '淮滨', '3', '0376', '464400', '中国,河南省,信阳市,淮滨县', '115.420500000000', '32.466140000000', 'Huaibin');
INSERT INTO `cf_areas` VALUES ('411528', '息县', '411500', '息县', '3', '0376', '464300', '中国,河南省,信阳市,息县', '114.740200000000', '32.342790000000', 'Xixian');
INSERT INTO `cf_areas` VALUES ('411600', '周口市', '410000', '周口', '2', '0394', '466000', '中国,河南省,周口市', '114.649653000000', '33.620357000000', 'Zhoukou');
INSERT INTO `cf_areas` VALUES ('411602', '川汇区', '411600', '川汇', '3', '0394', '466000', '中国,河南省,周口市,川汇区', '114.642020000000', '33.625600000000', 'Chuanhui');
INSERT INTO `cf_areas` VALUES ('411621', '扶沟县', '411600', '扶沟', '3', '0394', '461300', '中国,河南省,周口市,扶沟县', '114.394770000000', '34.059990000000', 'Fugou');
INSERT INTO `cf_areas` VALUES ('411622', '西华县', '411600', '西华', '3', '0394', '466600', '中国,河南省,周口市,西华县', '114.522790000000', '33.785480000000', 'Xihua');
INSERT INTO `cf_areas` VALUES ('411623', '商水县', '411600', '商水', '3', '0394', '466100', '中国,河南省,周口市,商水县', '114.606040000000', '33.539120000000', 'Shangshui');
INSERT INTO `cf_areas` VALUES ('411624', '沈丘县', '411600', '沈丘', '3', '0394', '466300', '中国,河南省,周口市,沈丘县', '115.098510000000', '33.409360000000', 'Shenqiu');
INSERT INTO `cf_areas` VALUES ('411625', '郸城县', '411600', '郸城', '3', '0394', '477150', '中国,河南省,周口市,郸城县', '115.177150000000', '33.644850000000', 'Dancheng');
INSERT INTO `cf_areas` VALUES ('411626', '淮阳县', '411600', '淮阳', '3', '0394', '466700', '中国,河南省,周口市,淮阳县', '114.888480000000', '33.732110000000', 'Huaiyang');
INSERT INTO `cf_areas` VALUES ('411627', '太康县', '411600', '太康', '3', '0394', '461400', '中国,河南省,周口市,太康县', '114.837730000000', '34.063760000000', 'Taikang');
INSERT INTO `cf_areas` VALUES ('411628', '鹿邑县', '411600', '鹿邑', '3', '0394', '477200', '中国,河南省,周口市,鹿邑县', '115.485530000000', '33.859310000000', 'Luyi');
INSERT INTO `cf_areas` VALUES ('411681', '项城市', '411600', '项城', '3', '0394', '466200', '中国,河南省,周口市,项城市', '114.875580000000', '33.467200000000', 'Xiangcheng');
INSERT INTO `cf_areas` VALUES ('411700', '驻马店市', '410000', '驻马店', '2', '0396', '463000', '中国,河南省,驻马店市', '114.024736000000', '32.980169000000', 'Zhumadian');
INSERT INTO `cf_areas` VALUES ('411702', '驿城区', '411700', '驿城', '3', '0396', '463000', '中国,河南省,驻马店市,驿城区', '113.993770000000', '32.973160000000', 'Yicheng');
INSERT INTO `cf_areas` VALUES ('411721', '西平县', '411700', '西平', '3', '0396', '463900', '中国,河南省,驻马店市,西平县', '114.023220000000', '33.384500000000', 'Xiping');
INSERT INTO `cf_areas` VALUES ('411722', '上蔡县', '411700', '上蔡', '3', '0396', '463800', '中国,河南省,驻马店市,上蔡县', '114.268250000000', '33.268250000000', 'Shangcai');
INSERT INTO `cf_areas` VALUES ('411723', '平舆县', '411700', '平舆', '3', '0396', '463400', '中国,河南省,驻马店市,平舆县', '114.635520000000', '32.957270000000', 'Pingyu');
INSERT INTO `cf_areas` VALUES ('411724', '正阳县', '411700', '正阳', '3', '0396', '463600', '中国,河南省,驻马店市,正阳县', '114.389520000000', '32.603900000000', 'Zhengyang');
INSERT INTO `cf_areas` VALUES ('411725', '确山县', '411700', '确山', '3', '0396', '463200', '中国,河南省,驻马店市,确山县', '114.029170000000', '32.802810000000', 'Queshan');
INSERT INTO `cf_areas` VALUES ('411726', '泌阳县', '411700', '泌阳', '3', '0396', '463700', '中国,河南省,驻马店市,泌阳县', '113.326810000000', '32.717810000000', 'Biyang');
INSERT INTO `cf_areas` VALUES ('411727', '汝南县', '411700', '汝南', '3', '0396', '463300', '中国,河南省,驻马店市,汝南县', '114.361380000000', '33.004610000000', 'Runan');
INSERT INTO `cf_areas` VALUES ('411728', '遂平县', '411700', '遂平', '3', '0396', '463100', '中国,河南省,驻马店市,遂平县', '114.012970000000', '33.145710000000', 'Suiping');
INSERT INTO `cf_areas` VALUES ('411729', '新蔡县', '411700', '新蔡', '3', '0396', '463500', '中国,河南省,驻马店市,新蔡县', '114.981990000000', '32.750200000000', 'Xincai');
INSERT INTO `cf_areas` VALUES ('419000', '直辖县级', '410000', ' ', '2', '', '', '中国,河南省,直辖县级', '113.665412000000', '34.757975000000', '');
INSERT INTO `cf_areas` VALUES ('419001', '济源市', '419000', '济源', '3', '0391', '454650', '中国,河南省,直辖县级,济源市', '112.590047000000', '35.090378000000', 'Jiyuan');
INSERT INTO `cf_areas` VALUES ('420000', '湖北省', '100000', '湖北', '1', '', '', '中国,湖北省', '114.298572000000', '30.584355000000', 'Hubei');
INSERT INTO `cf_areas` VALUES ('420100', '武汉市', '420000', '武汉', '2', '', '430014', '中国,湖北省,武汉市', '114.298572000000', '30.584355000000', 'Wuhan');
INSERT INTO `cf_areas` VALUES ('420102', '江岸区', '420100', '江岸', '3', '027', '430014', '中国,湖北省,武汉市,江岸区', '114.309430000000', '30.599820000000', 'Jiang\'an');
INSERT INTO `cf_areas` VALUES ('420103', '江汉区', '420100', '江汉', '3', '027', '430021', '中国,湖北省,武汉市,江汉区', '114.270930000000', '30.601460000000', 'Jianghan');
INSERT INTO `cf_areas` VALUES ('420104', '硚口区', '420100', '硚口', '3', '027', '430033', '中国,湖北省,武汉市,硚口区', '114.264220000000', '30.569450000000', 'Qiaokou');
INSERT INTO `cf_areas` VALUES ('420105', '汉阳区', '420100', '汉阳', '3', '027', '430050', '中国,湖北省,武汉市,汉阳区', '114.274780000000', '30.549150000000', 'Hanyang');
INSERT INTO `cf_areas` VALUES ('420106', '武昌区', '420100', '武昌', '3', '027', '430061', '中国,湖北省,武汉市,武昌区', '114.315890000000', '30.553890000000', 'Wuchang');
INSERT INTO `cf_areas` VALUES ('420107', '青山区', '420100', '青山', '3', '027', '430080', '中国,湖北省,武汉市,青山区', '114.391170000000', '30.634270000000', 'Qingshan');
INSERT INTO `cf_areas` VALUES ('420111', '洪山区', '420100', '洪山', '3', '027', '430070', '中国,湖北省,武汉市,洪山区', '114.343750000000', '30.499890000000', 'Hongshan');
INSERT INTO `cf_areas` VALUES ('420112', '东西湖区', '420100', '东西湖', '3', '027', '430040', '中国,湖北省,武汉市,东西湖区', '114.137080000000', '30.619890000000', 'Dongxihu');
INSERT INTO `cf_areas` VALUES ('420113', '汉南区', '420100', '汉南', '3', '027', '430090', '中国,湖北省,武汉市,汉南区', '114.084620000000', '30.308790000000', 'Hannan');
INSERT INTO `cf_areas` VALUES ('420114', '蔡甸区', '420100', '蔡甸', '3', '027', '430100', '中国,湖北省,武汉市,蔡甸区', '114.029290000000', '30.581970000000', 'Caidian');
INSERT INTO `cf_areas` VALUES ('420115', '江夏区', '420100', '江夏', '3', '027', '430200', '中国,湖北省,武汉市,江夏区', '114.313010000000', '30.346530000000', 'Jiangxia');
INSERT INTO `cf_areas` VALUES ('420116', '黄陂区', '420100', '黄陂', '3', '027', '432200', '中国,湖北省,武汉市,黄陂区', '114.375120000000', '30.881510000000', 'Huangpi');
INSERT INTO `cf_areas` VALUES ('420117', '新洲区', '420100', '新洲', '3', '027', '431400', '中国,湖北省,武汉市,新洲区', '114.801360000000', '30.841450000000', 'Xinzhou');
INSERT INTO `cf_areas` VALUES ('420200', '黄石市', '420000', '黄石', '2', '0714', '435003', '中国,湖北省,黄石市', '115.077048000000', '30.220074000000', 'Huangshi');
INSERT INTO `cf_areas` VALUES ('420202', '黄石港区', '420200', '黄石港', '3', '0714', '435000', '中国,湖北省,黄石市,黄石港区', '115.066040000000', '30.222790000000', 'Huangshigang');
INSERT INTO `cf_areas` VALUES ('420203', '西塞山区', '420200', '西塞山', '3', '0714', '435001', '中国,湖北省,黄石市,西塞山区', '115.110160000000', '30.204870000000', 'Xisaishan');
INSERT INTO `cf_areas` VALUES ('420204', '下陆区', '420200', '下陆', '3', '0714', '435005', '中国,湖北省,黄石市,下陆区', '114.961120000000', '30.173680000000', 'Xialu');
INSERT INTO `cf_areas` VALUES ('420205', '铁山区', '420200', '铁山', '3', '0714', '435006', '中国,湖北省,黄石市,铁山区', '114.901090000000', '30.206780000000', 'Tieshan');
INSERT INTO `cf_areas` VALUES ('420222', '阳新县', '420200', '阳新', '3', '0714', '435200', '中国,湖北省,黄石市,阳新县', '115.215270000000', '29.830380000000', 'Yangxin');
INSERT INTO `cf_areas` VALUES ('420281', '大冶市', '420200', '大冶', '3', '0714', '435100', '中国,湖北省,黄石市,大冶市', '114.971740000000', '30.094380000000', 'Daye');
INSERT INTO `cf_areas` VALUES ('420300', '十堰市', '420000', '十堰', '2', '0719', '442000', '中国,湖北省,十堰市', '110.785239000000', '32.647017000000', 'Shiyan');
INSERT INTO `cf_areas` VALUES ('420302', '茅箭区', '420300', '茅箭', '3', '0719', '442012', '中国,湖北省,十堰市,茅箭区', '110.813410000000', '32.591530000000', 'Maojian');
INSERT INTO `cf_areas` VALUES ('420303', '张湾区', '420300', '张湾', '3', '0719', '442001', '中国,湖北省,十堰市,张湾区', '110.770670000000', '32.651950000000', 'Zhangwan');
INSERT INTO `cf_areas` VALUES ('420304', '郧阳区', '420300', '郧阳', '3', '0719', '442500', '中国,湖北省,十堰市,郧阳区', '110.818540000000', '32.835930000000', 'Yunyang');
INSERT INTO `cf_areas` VALUES ('420322', '郧西县', '420300', '郧西', '3', '0719', '442600', '中国,湖北省,十堰市,郧西县', '110.425560000000', '32.993490000000', 'Yunxi');
INSERT INTO `cf_areas` VALUES ('420323', '竹山县', '420300', '竹山', '3', '0719', '442200', '中国,湖北省,十堰市,竹山县', '110.230710000000', '32.225360000000', 'Zhushan');
INSERT INTO `cf_areas` VALUES ('420324', '竹溪县', '420300', '竹溪', '3', '0719', '442300', '中国,湖北省,十堰市,竹溪县', '109.717980000000', '32.319010000000', 'Zhuxi');
INSERT INTO `cf_areas` VALUES ('420325', '房县', '420300', '房县', '3', '0719', '442100', '中国,湖北省,十堰市,房县', '110.743860000000', '32.057940000000', 'Fangxian');
INSERT INTO `cf_areas` VALUES ('420381', '丹江口市', '420300', '丹江口', '3', '0719', '442700', '中国,湖北省,十堰市,丹江口市', '111.515250000000', '32.540850000000', 'Danjiangkou');
INSERT INTO `cf_areas` VALUES ('420500', '宜昌市', '420000', '宜昌', '2', '0717', '443000', '中国,湖北省,宜昌市', '111.290843000000', '30.702636000000', 'Yichang');
INSERT INTO `cf_areas` VALUES ('420502', '西陵区', '420500', '西陵', '3', '0717', '443000', '中国,湖北省,宜昌市,西陵区', '111.285730000000', '30.710770000000', 'Xiling');
INSERT INTO `cf_areas` VALUES ('420503', '伍家岗区', '420500', '伍家岗', '3', '0717', '443001', '中国,湖北省,宜昌市,伍家岗区', '111.360900000000', '30.644340000000', 'Wujiagang');
INSERT INTO `cf_areas` VALUES ('420504', '点军区', '420500', '点军', '3', '0717', '443006', '中国,湖北省,宜昌市,点军区', '111.268280000000', '30.693400000000', 'Dianjun');
INSERT INTO `cf_areas` VALUES ('420505', '猇亭区', '420500', '猇亭', '3', '0717', '443007', '中国,湖北省,宜昌市,猇亭区', '111.440790000000', '30.526630000000', 'Xiaoting');
INSERT INTO `cf_areas` VALUES ('420506', '夷陵区', '420500', '夷陵', '3', '0717', '443100', '中国,湖北省,宜昌市,夷陵区', '111.326200000000', '30.768810000000', 'Yiling');
INSERT INTO `cf_areas` VALUES ('420525', '远安县', '420500', '远安', '3', '0717', '444200', '中国,湖北省,宜昌市,远安县', '111.641600000000', '31.059890000000', 'Yuan\'an');
INSERT INTO `cf_areas` VALUES ('420526', '兴山县', '420500', '兴山', '3', '0717', '443711', '中国,湖北省,宜昌市,兴山县', '110.749510000000', '31.346860000000', 'Xingshan');
INSERT INTO `cf_areas` VALUES ('420527', '秭归县', '420500', '秭归', '3', '0717', '443600', '中国,湖北省,宜昌市,秭归县', '110.981560000000', '30.827020000000', 'Zigui');
INSERT INTO `cf_areas` VALUES ('420528', '长阳土家族自治县', '420500', '长阳', '3', '0717', '443500', '中国,湖北省,宜昌市,长阳土家族自治县', '111.201050000000', '30.470520000000', 'Changyang');
INSERT INTO `cf_areas` VALUES ('420529', '五峰土家族自治县', '420500', '五峰', '3', '0717', '443413', '中国,湖北省,宜昌市,五峰土家族自治县', '110.674800000000', '30.198560000000', 'Wufeng');
INSERT INTO `cf_areas` VALUES ('420581', '宜都市', '420500', '宜都', '3', '0717', '443300', '中国,湖北省,宜昌市,宜都市', '111.450250000000', '30.378070000000', 'Yidu');
INSERT INTO `cf_areas` VALUES ('420582', '当阳市', '420500', '当阳', '3', '0717', '444100', '中国,湖北省,宜昌市,当阳市', '111.789120000000', '30.820800000000', 'Dangyang');
INSERT INTO `cf_areas` VALUES ('420583', '枝江市', '420500', '枝江', '3', '0717', '443200', '中国,湖北省,宜昌市,枝江市', '111.768550000000', '30.426120000000', 'Zhijiang');
INSERT INTO `cf_areas` VALUES ('420600', '襄阳市', '420000', '襄阳', '2', '0710', '441021', '中国,湖北省,襄阳市', '112.144146000000', '32.042426000000', 'Xiangyang');
INSERT INTO `cf_areas` VALUES ('420602', '襄城区', '420600', '襄城', '3', '0710', '441021', '中国,湖北省,襄阳市,襄城区', '112.133720000000', '32.010170000000', 'Xiangcheng');
INSERT INTO `cf_areas` VALUES ('420606', '樊城区', '420600', '樊城', '3', '0710', '441001', '中国,湖北省,襄阳市,樊城区', '112.135460000000', '32.044820000000', 'Fancheng');
INSERT INTO `cf_areas` VALUES ('420607', '襄州区', '420600', '襄州', '3', '0710', '441100', '中国,湖北省,襄阳市,襄州区', '112.150327000000', '32.015088000000', 'Xiangzhou');
INSERT INTO `cf_areas` VALUES ('420624', '南漳县', '420600', '南漳', '3', '0710', '441500', '中国,湖北省,襄阳市,南漳县', '111.846030000000', '31.776530000000', 'Nanzhang');
INSERT INTO `cf_areas` VALUES ('420625', '谷城县', '420600', '谷城', '3', '0710', '441700', '中国,湖北省,襄阳市,谷城县', '111.652670000000', '32.263770000000', 'Gucheng');
INSERT INTO `cf_areas` VALUES ('420626', '保康县', '420600', '保康', '3', '0710', '441600', '中国,湖北省,襄阳市,保康县', '111.261380000000', '31.878740000000', 'Baokang');
INSERT INTO `cf_areas` VALUES ('420682', '老河口市', '420600', '老河口', '3', '0710', '441800', '中国,湖北省,襄阳市,老河口市', '111.671170000000', '32.384760000000', 'Laohekou');
INSERT INTO `cf_areas` VALUES ('420683', '枣阳市', '420600', '枣阳', '3', '0710', '441200', '中国,湖北省,襄阳市,枣阳市', '112.774440000000', '32.131420000000', 'Zaoyang');
INSERT INTO `cf_areas` VALUES ('420684', '宜城市', '420600', '宜城', '3', '0710', '441400', '中国,湖北省,襄阳市,宜城市', '112.257720000000', '31.719720000000', 'Yicheng');
INSERT INTO `cf_areas` VALUES ('420700', '鄂州市', '420000', '鄂州', '2', '0711', '436000', '中国,湖北省,鄂州市', '114.890593000000', '30.396536000000', 'Ezhou');
INSERT INTO `cf_areas` VALUES ('420702', '梁子湖区', '420700', '梁子湖', '3', '0711', '436064', '中国,湖北省,鄂州市,梁子湖区', '114.684630000000', '30.100030000000', 'Liangzihu');
INSERT INTO `cf_areas` VALUES ('420703', '华容区', '420700', '华容', '3', '0711', '436030', '中国,湖北省,鄂州市,华容区', '114.735680000000', '30.533280000000', 'Huarong');
INSERT INTO `cf_areas` VALUES ('420704', '鄂城区', '420700', '鄂城', '3', '0711', '436000', '中国,湖北省,鄂州市,鄂城区', '114.891580000000', '30.400240000000', 'Echeng');
INSERT INTO `cf_areas` VALUES ('420800', '荆门市', '420000', '荆门', '2', '0724', '448000', '中国,湖北省,荆门市', '112.204251000000', '31.035420000000', 'Jingmen');
INSERT INTO `cf_areas` VALUES ('420802', '东宝区', '420800', '东宝', '3', '0724', '448004', '中国,湖北省,荆门市,东宝区', '112.201470000000', '31.051920000000', 'Dongbao');
INSERT INTO `cf_areas` VALUES ('420804', '掇刀区', '420800', '掇刀', '3', '0724', '448124', '中国,湖北省,荆门市,掇刀区', '112.208000000000', '30.973160000000', 'Duodao');
INSERT INTO `cf_areas` VALUES ('420821', '京山县', '420800', '京山', '3', '0724', '431800', '中国,湖北省,荆门市,京山县', '113.110740000000', '31.022400000000', 'Jingshan');
INSERT INTO `cf_areas` VALUES ('420822', '沙洋县', '420800', '沙洋', '3', '0724', '448200', '中国,湖北省,荆门市,沙洋县', '112.588530000000', '30.709160000000', 'Shayang');
INSERT INTO `cf_areas` VALUES ('420881', '钟祥市', '420800', '钟祥', '3', '0724', '431900', '中国,湖北省,荆门市,钟祥市', '112.589320000000', '31.167800000000', 'Zhongxiang');
INSERT INTO `cf_areas` VALUES ('420900', '孝感市', '420000', '孝感', '2', '0712', '432100', '中国,湖北省,孝感市', '113.926655000000', '30.926423000000', 'Xiaogan');
INSERT INTO `cf_areas` VALUES ('420902', '孝南区', '420900', '孝南', '3', '0712', '432100', '中国,湖北省,孝感市,孝南区', '113.911110000000', '30.916800000000', 'Xiaonan');
INSERT INTO `cf_areas` VALUES ('420921', '孝昌县', '420900', '孝昌', '3', '0712', '432900', '中国,湖北省,孝感市,孝昌县', '113.997950000000', '31.257990000000', 'Xiaochang');
INSERT INTO `cf_areas` VALUES ('420922', '大悟县', '420900', '大悟', '3', '0712', '432800', '中国,湖北省,孝感市,大悟县', '114.125640000000', '31.561760000000', 'Dawu');
INSERT INTO `cf_areas` VALUES ('420923', '云梦县', '420900', '云梦', '3', '0712', '432500', '中国,湖北省,孝感市,云梦县', '113.752890000000', '31.020930000000', 'Yunmeng');
INSERT INTO `cf_areas` VALUES ('420981', '应城市', '420900', '应城', '3', '0712', '432400', '中国,湖北省,孝感市,应城市', '113.572870000000', '30.928340000000', 'Yingcheng');
INSERT INTO `cf_areas` VALUES ('420982', '安陆市', '420900', '安陆', '3', '0712', '432600', '中国,湖北省,孝感市,安陆市', '113.685570000000', '31.256930000000', 'Anlu');
INSERT INTO `cf_areas` VALUES ('420984', '汉川市', '420900', '汉川', '3', '0712', '432300', '中国,湖北省,孝感市,汉川市', '113.838980000000', '30.661170000000', 'Hanchuan');
INSERT INTO `cf_areas` VALUES ('421000', '荆州市', '420000', '荆州', '2', '0716', '434000', '中国,湖北省,荆州市', '112.238130000000', '30.326857000000', 'Jingzhou');
INSERT INTO `cf_areas` VALUES ('421002', '沙市区', '421000', '沙市', '3', '0716', '434000', '中国,湖北省,荆州市,沙市区', '112.255430000000', '30.311070000000', 'Shashi');
INSERT INTO `cf_areas` VALUES ('421003', '荆州区', '421000', '荆州', '3', '0716', '434020', '中国,湖北省,荆州市,荆州区', '112.190060000000', '30.352640000000', 'Jingzhou');
INSERT INTO `cf_areas` VALUES ('421022', '公安县', '421000', '公安', '3', '0716', '434300', '中国,湖北省,荆州市,公安县', '112.232420000000', '30.059020000000', 'Gong\'an');
INSERT INTO `cf_areas` VALUES ('421023', '监利县', '421000', '监利', '3', '0716', '433300', '中国,湖北省,荆州市,监利县', '112.894620000000', '29.814940000000', 'Jianli');
INSERT INTO `cf_areas` VALUES ('421024', '江陵县', '421000', '江陵', '3', '0716', '434101', '中国,湖北省,荆州市,江陵县', '112.424680000000', '30.041740000000', 'Jiangling');
INSERT INTO `cf_areas` VALUES ('421081', '石首市', '421000', '石首', '3', '0716', '434400', '中国,湖北省,荆州市,石首市', '112.426360000000', '29.721270000000', 'Shishou');
INSERT INTO `cf_areas` VALUES ('421083', '洪湖市', '421000', '洪湖', '3', '0716', '433200', '中国,湖北省,荆州市,洪湖市', '113.475980000000', '29.827000000000', 'Honghu');
INSERT INTO `cf_areas` VALUES ('421087', '松滋市', '421000', '松滋', '3', '0716', '434200', '中国,湖北省,荆州市,松滋市', '111.767390000000', '30.169650000000', 'Songzi');
INSERT INTO `cf_areas` VALUES ('421100', '黄冈市', '420000', '黄冈', '2', '0713', '438000', '中国,湖北省,黄冈市', '114.879365000000', '30.447711000000', 'Huanggang');
INSERT INTO `cf_areas` VALUES ('421102', '黄州区', '421100', '黄州', '3', '0713', '438000', '中国,湖北省,黄冈市,黄州区', '114.880080000000', '30.434360000000', 'Huangzhou');
INSERT INTO `cf_areas` VALUES ('421121', '团风县', '421100', '团风', '3', '0713', '438800', '中国,湖北省,黄冈市,团风县', '114.872280000000', '30.643590000000', 'Tuanfeng');
INSERT INTO `cf_areas` VALUES ('421122', '红安县', '421100', '红安', '3', '0713', '438401', '中国,湖北省,黄冈市,红安县', '114.622400000000', '31.286680000000', 'Hong\'an');
INSERT INTO `cf_areas` VALUES ('421123', '罗田县', '421100', '罗田', '3', '0713', '438600', '中国,湖北省,黄冈市,罗田县', '115.399710000000', '30.782550000000', 'Luotian');
INSERT INTO `cf_areas` VALUES ('421124', '英山县', '421100', '英山', '3', '0713', '438700', '中国,湖北省,黄冈市,英山县', '115.681420000000', '30.735160000000', 'Yingshan');
INSERT INTO `cf_areas` VALUES ('421125', '浠水县', '421100', '浠水', '3', '0713', '438200', '中国,湖北省,黄冈市,浠水县', '115.269130000000', '30.452650000000', 'Xishui');
INSERT INTO `cf_areas` VALUES ('421126', '蕲春县', '421100', '蕲春', '3', '0713', '435300', '中国,湖北省,黄冈市,蕲春县', '115.436150000000', '30.226130000000', 'Qichun');
INSERT INTO `cf_areas` VALUES ('421127', '黄梅县', '421100', '黄梅', '3', '0713', '435500', '中国,湖北省,黄冈市,黄梅县', '115.944270000000', '30.070330000000', 'Huangmei');
INSERT INTO `cf_areas` VALUES ('421181', '麻城市', '421100', '麻城', '3', '0713', '438300', '中国,湖北省,黄冈市,麻城市', '115.009880000000', '31.172280000000', 'Macheng');
INSERT INTO `cf_areas` VALUES ('421182', '武穴市', '421100', '武穴', '3', '0713', '435400', '中国,湖北省,黄冈市,武穴市', '115.559750000000', '29.844460000000', 'Wuxue');
INSERT INTO `cf_areas` VALUES ('421200', '咸宁市', '420000', '咸宁', '2', '0715', '437000', '中国,湖北省,咸宁市', '114.328963000000', '29.832798000000', 'Xianning');
INSERT INTO `cf_areas` VALUES ('421202', '咸安区', '421200', '咸安', '3', '0715', '437000', '中国,湖北省,咸宁市,咸安区', '114.298720000000', '29.852900000000', 'Xian\'an');
INSERT INTO `cf_areas` VALUES ('421221', '嘉鱼县', '421200', '嘉鱼', '3', '0715', '437200', '中国,湖北省,咸宁市,嘉鱼县', '113.939270000000', '29.970540000000', 'Jiayu');
INSERT INTO `cf_areas` VALUES ('421222', '通城县', '421200', '通城', '3', '0715', '437400', '中国,湖北省,咸宁市,通城县', '113.815820000000', '29.245680000000', 'Tongcheng');
INSERT INTO `cf_areas` VALUES ('421223', '崇阳县', '421200', '崇阳', '3', '0715', '437500', '中国,湖北省,咸宁市,崇阳县', '114.039820000000', '29.555640000000', 'Chongyang');
INSERT INTO `cf_areas` VALUES ('421224', '通山县', '421200', '通山', '3', '0715', '437600', '中国,湖北省,咸宁市,通山县', '114.482390000000', '29.606300000000', 'Tongshan');
INSERT INTO `cf_areas` VALUES ('421281', '赤壁市', '421200', '赤壁', '3', '0715', '437300', '中国,湖北省,咸宁市,赤壁市', '113.900390000000', '29.724540000000', 'Chibi');
INSERT INTO `cf_areas` VALUES ('421300', '随州市', '420000', '随州', '2', '0722', '441300', '中国,湖北省,随州市', '113.373770000000', '31.717497000000', 'Suizhou');
INSERT INTO `cf_areas` VALUES ('421303', '曾都区', '421300', '曾都', '3', '0722', '441300', '中国,湖北省,随州市,曾都区', '113.371280000000', '31.716140000000', 'Zengdu');
INSERT INTO `cf_areas` VALUES ('421321', '随县', '421300', '随县', '3', '0722', '441309', '中国,湖北省,随州市,随县', '113.826630000000', '31.617900000000', 'Suixian');
INSERT INTO `cf_areas` VALUES ('421381', '广水市', '421300', '广水', '3', '0722', '432700', '中国,湖北省,随州市,广水市', '113.826630000000', '31.617900000000', 'Guangshui');
INSERT INTO `cf_areas` VALUES ('422800', '恩施土家族苗族自治州', '420000', '恩施', '2', '0718', '445000', '中国,湖北省,恩施土家族苗族自治州', '109.486990000000', '30.283114000000', 'Enshi');
INSERT INTO `cf_areas` VALUES ('422801', '恩施市', '422800', '恩施', '3', '0718', '445000', '中国,湖北省,恩施土家族苗族自治州,恩施市', '109.479420000000', '30.295020000000', 'Enshi');
INSERT INTO `cf_areas` VALUES ('422802', '利川市', '422800', '利川', '3', '0718', '445400', '中国,湖北省,恩施土家族苗族自治州,利川市', '108.935910000000', '30.291170000000', 'Lichuan');
INSERT INTO `cf_areas` VALUES ('422822', '建始县', '422800', '建始', '3', '0718', '445300', '中国,湖北省,恩施土家族苗族自治州,建始县', '109.722070000000', '30.602090000000', 'Jianshi');
INSERT INTO `cf_areas` VALUES ('422823', '巴东县', '422800', '巴东', '3', '0718', '444300', '中国,湖北省,恩施土家族苗族自治州,巴东县', '110.340660000000', '31.042330000000', 'Badong');
INSERT INTO `cf_areas` VALUES ('422825', '宣恩县', '422800', '宣恩', '3', '0718', '445500', '中国,湖北省,恩施土家族苗族自治州,宣恩县', '109.491790000000', '29.987140000000', 'Xuanen');
INSERT INTO `cf_areas` VALUES ('422826', '咸丰县', '422800', '咸丰', '3', '0718', '445600', '中国,湖北省,恩施土家族苗族自治州,咸丰县', '109.152000000000', '29.679830000000', 'Xianfeng');
INSERT INTO `cf_areas` VALUES ('422827', '来凤县', '422800', '来凤', '3', '0718', '445700', '中国,湖北省,恩施土家族苗族自治州,来凤县', '109.407160000000', '29.493730000000', 'Laifeng');
INSERT INTO `cf_areas` VALUES ('422828', '鹤峰县', '422800', '鹤峰', '3', '0718', '445800', '中国,湖北省,恩施土家族苗族自治州,鹤峰县', '110.030910000000', '29.890720000000', 'Hefeng');
INSERT INTO `cf_areas` VALUES ('429000', '直辖县级', '420000', ' ', '2', '', '', '中国,湖北省,直辖县级', '114.298572000000', '30.584355000000', '');
INSERT INTO `cf_areas` VALUES ('429004', '仙桃市', '429000', '仙桃', '3', '0728', '433000', '中国,湖北省,直辖县级,仙桃市', '113.453974000000', '30.364953000000', 'Xiantao');
INSERT INTO `cf_areas` VALUES ('429005', '潜江市', '429000', '潜江', '3', '0728', '433100', '中国,湖北省,直辖县级,潜江市', '112.896866000000', '30.421215000000', 'Qianjiang');
INSERT INTO `cf_areas` VALUES ('429006', '天门市', '429000', '天门', '3', '0728', '431700', '中国,湖北省,直辖县级,天门市', '113.165862000000', '30.653061000000', 'Tianmen');
INSERT INTO `cf_areas` VALUES ('429021', '神农架林区', '429000', '神农架', '3', '0719', '442400', '中国,湖北省,直辖县级,神农架林区', '110.671525000000', '31.744449000000', 'Shennongjia');
INSERT INTO `cf_areas` VALUES ('430000', '湖南省', '100000', '湖南', '1', '', '', '中国,湖南省', '112.982279000000', '28.194090000000', 'Hunan');
INSERT INTO `cf_areas` VALUES ('430100', '长沙市', '430000', '长沙', '2', '0731', '410005', '中国,湖南省,长沙市', '112.982279000000', '28.194090000000', 'Changsha');
INSERT INTO `cf_areas` VALUES ('430102', '芙蓉区', '430100', '芙蓉', '3', '0731', '410011', '中国,湖南省,长沙市,芙蓉区', '113.031760000000', '28.184400000000', 'Furong');
INSERT INTO `cf_areas` VALUES ('430103', '天心区', '430100', '天心', '3', '0731', '410004', '中国,湖南省,长沙市,天心区', '112.989910000000', '28.112700000000', 'Tianxin');
INSERT INTO `cf_areas` VALUES ('430104', '岳麓区', '430100', '岳麓', '3', '0731', '410013', '中国,湖南省,长沙市,岳麓区', '112.931330000000', '28.235100000000', 'Yuelu');
INSERT INTO `cf_areas` VALUES ('430105', '开福区', '430100', '开福', '3', '0731', '410008', '中国,湖南省,长沙市,开福区', '112.986230000000', '28.255850000000', 'Kaifu');
INSERT INTO `cf_areas` VALUES ('430111', '雨花区', '430100', '雨花', '3', '0731', '410011', '中国,湖南省,长沙市,雨花区', '113.035670000000', '28.135410000000', 'Yuhua');
INSERT INTO `cf_areas` VALUES ('430112', '望城区', '430100', '望城', '3', '0731', '410200', '中国,湖南省,长沙市,望城区', '112.819549000000', '28.347458000000', 'Wangcheng');
INSERT INTO `cf_areas` VALUES ('430121', '长沙县', '430100', '长沙', '3', '0731', '410100', '中国,湖南省,长沙市,长沙县', '113.080710000000', '28.245950000000', 'Changsha');
INSERT INTO `cf_areas` VALUES ('430124', '宁乡县', '430100', '宁乡', '3', '0731', '410600', '中国,湖南省,长沙市,宁乡县', '112.557490000000', '28.253580000000', 'Ningxiang');
INSERT INTO `cf_areas` VALUES ('430181', '浏阳市', '430100', '浏阳', '3', '0731', '410300', '中国,湖南省,长沙市,浏阳市', '113.643120000000', '28.163750000000', 'Liuyang');
INSERT INTO `cf_areas` VALUES ('430200', '株洲市', '430000', '株洲', '2', '0731', '412000', '中国,湖南省,株洲市', '113.151737000000', '27.835806000000', 'Zhuzhou');
INSERT INTO `cf_areas` VALUES ('430202', '荷塘区', '430200', '荷塘', '3', '0731', '412000', '中国,湖南省,株洲市,荷塘区', '113.173150000000', '27.855690000000', 'Hetang');
INSERT INTO `cf_areas` VALUES ('430203', '芦淞区', '430200', '芦淞', '3', '0731', '412000', '中国,湖南省,株洲市,芦淞区', '113.155620000000', '27.785250000000', 'Lusong');
INSERT INTO `cf_areas` VALUES ('430204', '石峰区', '430200', '石峰', '3', '0731', '412005', '中国,湖南省,株洲市,石峰区', '113.117760000000', '27.875520000000', 'Shifeng');
INSERT INTO `cf_areas` VALUES ('430211', '天元区', '430200', '天元', '3', '0731', '412007', '中国,湖南省,株洲市,天元区', '113.123350000000', '27.831030000000', 'Tianyuan');
INSERT INTO `cf_areas` VALUES ('430221', '株洲县', '430200', '株洲', '3', '0731', '412100', '中国,湖南省,株洲市,株洲县', '113.144280000000', '27.698260000000', 'Zhuzhou');
INSERT INTO `cf_areas` VALUES ('430223', '攸县', '430200', '攸县', '3', '0731', '412300', '中国,湖南省,株洲市,攸县', '113.343650000000', '27.003520000000', 'Youxian');
INSERT INTO `cf_areas` VALUES ('430224', '茶陵县', '430200', '茶陵', '3', '0731', '412400', '中国,湖南省,株洲市,茶陵县', '113.543640000000', '26.791500000000', 'Chaling');
INSERT INTO `cf_areas` VALUES ('430225', '炎陵县', '430200', '炎陵', '3', '0731', '412500', '中国,湖南省,株洲市,炎陵县', '113.771630000000', '26.488180000000', 'Yanling');
INSERT INTO `cf_areas` VALUES ('430281', '醴陵市', '430200', '醴陵', '3', '0731', '412200', '中国,湖南省,株洲市,醴陵市', '113.497040000000', '27.646150000000', 'Liling');
INSERT INTO `cf_areas` VALUES ('430300', '湘潭市', '430000', '湘潭', '2', '0731', '411100', '中国,湖南省,湘潭市', '112.925083000000', '27.846725000000', 'Xiangtan');
INSERT INTO `cf_areas` VALUES ('430302', '雨湖区', '430300', '雨湖', '3', '0731', '411100', '中国,湖南省,湘潭市,雨湖区', '112.903990000000', '27.868590000000', 'Yuhu');
INSERT INTO `cf_areas` VALUES ('430304', '岳塘区', '430300', '岳塘', '3', '0731', '411101', '中国,湖南省,湘潭市,岳塘区', '112.960600000000', '27.857840000000', 'Yuetang');
INSERT INTO `cf_areas` VALUES ('430321', '湘潭县', '430300', '湘潭', '3', '0731', '411228', '中国,湖南省,湘潭市,湘潭县', '112.950800000000', '27.778930000000', 'Xiangtan');
INSERT INTO `cf_areas` VALUES ('430381', '湘乡市', '430300', '湘乡', '3', '0731', '411400', '中国,湖南省,湘潭市,湘乡市', '112.535120000000', '27.735430000000', 'Xiangxiang');
INSERT INTO `cf_areas` VALUES ('430382', '韶山市', '430300', '韶山', '3', '0731', '411300', '中国,湖南省,湘潭市,韶山市', '112.526550000000', '27.915030000000', 'Shaoshan');
INSERT INTO `cf_areas` VALUES ('430400', '衡阳市', '430000', '衡阳', '2', '0734', '421001', '中国,湖南省,衡阳市', '112.607693000000', '26.900358000000', 'Hengyang');
INSERT INTO `cf_areas` VALUES ('430405', '珠晖区', '430400', '珠晖', '3', '0734', '421002', '中国,湖南省,衡阳市,珠晖区', '112.620540000000', '26.893610000000', 'Zhuhui');
INSERT INTO `cf_areas` VALUES ('430406', '雁峰区', '430400', '雁峰', '3', '0734', '421001', '中国,湖南省,衡阳市,雁峰区', '112.616540000000', '26.888660000000', 'Yanfeng');
INSERT INTO `cf_areas` VALUES ('430407', '石鼓区', '430400', '石鼓', '3', '0734', '421005', '中国,湖南省,衡阳市,石鼓区', '112.610690000000', '26.902320000000', 'Shigu');
INSERT INTO `cf_areas` VALUES ('430408', '蒸湘区', '430400', '蒸湘', '3', '0734', '421001', '中国,湖南省,衡阳市,蒸湘区', '112.603300000000', '26.896510000000', 'Zhengxiang');
INSERT INTO `cf_areas` VALUES ('430412', '南岳区', '430400', '南岳', '3', '0734', '421900', '中国,湖南省,衡阳市,南岳区', '112.738400000000', '27.232620000000', 'Nanyue');
INSERT INTO `cf_areas` VALUES ('430421', '衡阳县', '430400', '衡阳', '3', '0734', '421200', '中国,湖南省,衡阳市,衡阳县', '112.370880000000', '26.970600000000', 'Hengyang');
INSERT INTO `cf_areas` VALUES ('430422', '衡南县', '430400', '衡南', '3', '0734', '421131', '中国,湖南省,衡阳市,衡南县', '112.677880000000', '26.738280000000', 'Hengnan');
INSERT INTO `cf_areas` VALUES ('430423', '衡山县', '430400', '衡山', '3', '0734', '421300', '中国,湖南省,衡阳市,衡山县', '112.867760000000', '27.231340000000', 'Hengshan');
INSERT INTO `cf_areas` VALUES ('430424', '衡东县', '430400', '衡东', '3', '0734', '421400', '中国,湖南省,衡阳市,衡东县', '112.948330000000', '27.080930000000', 'Hengdong');
INSERT INTO `cf_areas` VALUES ('430426', '祁东县', '430400', '祁东', '3', '0734', '421600', '中国,湖南省,衡阳市,祁东县', '112.090390000000', '26.799640000000', 'Qidong');
INSERT INTO `cf_areas` VALUES ('430481', '耒阳市', '430400', '耒阳', '3', '0734', '421800', '中国,湖南省,衡阳市,耒阳市', '112.859980000000', '26.421320000000', 'Leiyang');
INSERT INTO `cf_areas` VALUES ('430482', '常宁市', '430400', '常宁', '3', '0734', '421500', '中国,湖南省,衡阳市,常宁市', '112.400900000000', '26.406920000000', 'Changning');
INSERT INTO `cf_areas` VALUES ('430500', '邵阳市', '430000', '邵阳', '2', '0739', '422000', '中国,湖南省,邵阳市', '111.469230000000', '27.237842000000', 'Shaoyang');
INSERT INTO `cf_areas` VALUES ('430502', '双清区', '430500', '双清', '3', '0739', '422001', '中国,湖南省,邵阳市,双清区', '111.497150000000', '27.232910000000', 'Shuangqing');
INSERT INTO `cf_areas` VALUES ('430503', '大祥区', '430500', '大祥', '3', '0739', '422000', '中国,湖南省,邵阳市,大祥区', '111.454120000000', '27.233320000000', 'Daxiang');
INSERT INTO `cf_areas` VALUES ('430511', '北塔区', '430500', '北塔', '3', '0739', '422007', '中国,湖南省,邵阳市,北塔区', '111.452190000000', '27.246480000000', 'Beita');
INSERT INTO `cf_areas` VALUES ('430521', '邵东县', '430500', '邵东', '3', '0739', '422800', '中国,湖南省,邵阳市,邵东县', '111.744410000000', '27.258400000000', 'Shaodong');
INSERT INTO `cf_areas` VALUES ('430522', '新邵县', '430500', '新邵', '3', '0739', '422900', '中国,湖南省,邵阳市,新邵县', '111.460660000000', '27.321690000000', 'Xinshao');
INSERT INTO `cf_areas` VALUES ('430523', '邵阳县', '430500', '邵阳', '3', '0739', '422100', '中国,湖南省,邵阳市,邵阳县', '111.274590000000', '26.991430000000', 'Shaoyang');
INSERT INTO `cf_areas` VALUES ('430524', '隆回县', '430500', '隆回', '3', '0739', '422200', '中国,湖南省,邵阳市,隆回县', '111.032160000000', '27.109370000000', 'Longhui');
INSERT INTO `cf_areas` VALUES ('430525', '洞口县', '430500', '洞口', '3', '0739', '422300', '中国,湖南省,邵阳市,洞口县', '110.573880000000', '27.054620000000', 'Dongkou');
INSERT INTO `cf_areas` VALUES ('430527', '绥宁县', '430500', '绥宁', '3', '0739', '422600', '中国,湖南省,邵阳市,绥宁县', '110.155760000000', '26.586360000000', 'Suining');
INSERT INTO `cf_areas` VALUES ('430528', '新宁县', '430500', '新宁', '3', '0739', '422700', '中国,湖南省,邵阳市,新宁县', '110.851310000000', '26.429360000000', 'Xinning');
INSERT INTO `cf_areas` VALUES ('430529', '城步苗族自治县', '430500', '城步', '3', '0739', '422500', '中国,湖南省,邵阳市,城步苗族自治县', '110.322200000000', '26.390480000000', 'Chengbu');
INSERT INTO `cf_areas` VALUES ('430581', '武冈市', '430500', '武冈', '3', '0739', '422400', '中国,湖南省,邵阳市,武冈市', '110.632810000000', '26.728170000000', 'Wugang');
INSERT INTO `cf_areas` VALUES ('430600', '岳阳市', '430000', '岳阳', '2', '0730', '414000', '中国,湖南省,岳阳市', '113.132855000000', '29.370290000000', 'Yueyang');
INSERT INTO `cf_areas` VALUES ('430602', '岳阳楼区', '430600', '岳阳楼', '3', '0730', '414000', '中国,湖南省,岳阳市,岳阳楼区', '113.129420000000', '29.371900000000', 'Yueyanglou');
INSERT INTO `cf_areas` VALUES ('430603', '云溪区', '430600', '云溪', '3', '0730', '414009', '中国,湖南省,岳阳市,云溪区', '113.277130000000', '29.473570000000', 'Yunxi');
INSERT INTO `cf_areas` VALUES ('430611', '君山区', '430600', '君山', '3', '0730', '414005', '中国,湖南省,岳阳市,君山区', '113.004390000000', '29.459410000000', 'Junshan');
INSERT INTO `cf_areas` VALUES ('430621', '岳阳县', '430600', '岳阳', '3', '0730', '414100', '中国,湖南省,岳阳市,岳阳县', '113.119870000000', '29.143140000000', 'Yueyang');
INSERT INTO `cf_areas` VALUES ('430623', '华容县', '430600', '华容', '3', '0730', '414200', '中国,湖南省,岳阳市,华容县', '112.540890000000', '29.530190000000', 'Huarong');
INSERT INTO `cf_areas` VALUES ('430624', '湘阴县', '430600', '湘阴', '3', '0730', '414600', '中国,湖南省,岳阳市,湘阴县', '112.909110000000', '28.689220000000', 'Xiangyin');
INSERT INTO `cf_areas` VALUES ('430626', '平江县', '430600', '平江', '3', '0730', '414500', '中国,湖南省,岳阳市,平江县', '113.581050000000', '28.706640000000', 'Pingjiang');
INSERT INTO `cf_areas` VALUES ('430681', '汨罗市', '430600', '汨罗', '3', '0730', '414400', '中国,湖南省,岳阳市,汨罗市', '113.067070000000', '28.806310000000', 'Miluo');
INSERT INTO `cf_areas` VALUES ('430682', '临湘市', '430600', '临湘', '3', '0730', '414300', '中国,湖南省,岳阳市,临湘市', '113.450100000000', '29.477010000000', 'Linxiang');
INSERT INTO `cf_areas` VALUES ('430700', '常德市', '430000', '常德', '2', '0736', '415000', '中国,湖南省,常德市', '111.691347000000', '29.040225000000', 'Changde');
INSERT INTO `cf_areas` VALUES ('430702', '武陵区', '430700', '武陵', '3', '0736', '415000', '中国,湖南省,常德市,武陵区', '111.697910000000', '29.028760000000', 'Wuling');
INSERT INTO `cf_areas` VALUES ('430703', '鼎城区', '430700', '鼎城', '3', '0736', '415101', '中国,湖南省,常德市,鼎城区', '111.680780000000', '29.018590000000', 'Dingcheng');
INSERT INTO `cf_areas` VALUES ('430721', '安乡县', '430700', '安乡', '3', '0736', '415600', '中国,湖南省,常德市,安乡县', '112.167320000000', '29.413260000000', 'Anxiang');
INSERT INTO `cf_areas` VALUES ('430722', '汉寿县', '430700', '汉寿', '3', '0736', '415900', '中国,湖南省,常德市,汉寿县', '111.966910000000', '28.902990000000', 'Hanshou');
INSERT INTO `cf_areas` VALUES ('430723', '澧县', '430700', '澧县', '3', '0736', '415500', '中国,湖南省,常德市,澧县', '111.758660000000', '29.633170000000', 'Lixian');
INSERT INTO `cf_areas` VALUES ('430724', '临澧县', '430700', '临澧', '3', '0736', '415200', '中国,湖南省,常德市,临澧县', '111.651610000000', '29.441630000000', 'Linli');
INSERT INTO `cf_areas` VALUES ('430725', '桃源县', '430700', '桃源', '3', '0736', '415700', '中国,湖南省,常德市,桃源县', '111.488920000000', '28.904740000000', 'Taoyuan');
INSERT INTO `cf_areas` VALUES ('430726', '石门县', '430700', '石门', '3', '0736', '415300', '中国,湖南省,常德市,石门县', '111.379660000000', '29.584240000000', 'Shimen');
INSERT INTO `cf_areas` VALUES ('430781', '津市市', '430700', '津市', '3', '0736', '415400', '中国,湖南省,常德市,津市市', '111.877560000000', '29.605630000000', 'Jinshi');
INSERT INTO `cf_areas` VALUES ('430800', '张家界市', '430000', '张家界', '2', '0744', '427000', '中国,湖南省,张家界市', '110.479921000000', '29.127401000000', 'Zhangjiajie');
INSERT INTO `cf_areas` VALUES ('430802', '永定区', '430800', '永定', '3', '0744', '427000', '中国,湖南省,张家界市,永定区', '110.474640000000', '29.133870000000', 'Yongding');
INSERT INTO `cf_areas` VALUES ('430811', '武陵源区', '430800', '武陵源', '3', '0744', '427400', '中国,湖南省,张家界市,武陵源区', '110.550260000000', '29.345740000000', 'Wulingyuan');
INSERT INTO `cf_areas` VALUES ('430821', '慈利县', '430800', '慈利', '3', '0744', '427200', '中国,湖南省,张家界市,慈利县', '111.139460000000', '29.429890000000', 'Cili');
INSERT INTO `cf_areas` VALUES ('430822', '桑植县', '430800', '桑植', '3', '0744', '427100', '中国,湖南省,张家界市,桑植县', '110.163080000000', '29.398150000000', 'Sangzhi');
INSERT INTO `cf_areas` VALUES ('430900', '益阳市', '430000', '益阳', '2', '0737', '413000', '中国,湖南省,益阳市', '112.355042000000', '28.570066000000', 'Yiyang');
INSERT INTO `cf_areas` VALUES ('430902', '资阳区', '430900', '资阳', '3', '0737', '413001', '中国,湖南省,益阳市,资阳区', '112.324470000000', '28.590950000000', 'Ziyang');
INSERT INTO `cf_areas` VALUES ('430903', '赫山区', '430900', '赫山', '3', '0737', '413002', '中国,湖南省,益阳市,赫山区', '112.372650000000', '28.574250000000', 'Heshan');
INSERT INTO `cf_areas` VALUES ('430921', '南县', '430900', '南县', '3', '0737', '413200', '中国,湖南省,益阳市,南县', '112.396300000000', '29.361590000000', 'Nanxian');
INSERT INTO `cf_areas` VALUES ('430922', '桃江县', '430900', '桃江', '3', '0737', '413400', '中国,湖南省,益阳市,桃江县', '112.155700000000', '28.518140000000', 'Taojiang');
INSERT INTO `cf_areas` VALUES ('430923', '安化县', '430900', '安化', '3', '0737', '413500', '中国,湖南省,益阳市,安化县', '111.212980000000', '28.374240000000', 'Anhua');
INSERT INTO `cf_areas` VALUES ('430981', '沅江市', '430900', '沅江', '3', '0737', '413100', '中国,湖南省,益阳市,沅江市', '112.354270000000', '28.844030000000', 'Yuanjiang');
INSERT INTO `cf_areas` VALUES ('431000', '郴州市', '430000', '郴州', '2', '0735', '423000', '中国,湖南省,郴州市', '113.032067000000', '25.793589000000', 'Chenzhou');
INSERT INTO `cf_areas` VALUES ('431002', '北湖区', '431000', '北湖', '3', '0735', '423000', '中国,湖南省,郴州市,北湖区', '113.011030000000', '25.784050000000', 'Beihu');
INSERT INTO `cf_areas` VALUES ('431003', '苏仙区', '431000', '苏仙', '3', '0735', '423000', '中国,湖南省,郴州市,苏仙区', '113.042260000000', '25.800450000000', 'Suxian');
INSERT INTO `cf_areas` VALUES ('431021', '桂阳县', '431000', '桂阳', '3', '0735', '424400', '中国,湖南省,郴州市,桂阳县', '112.733640000000', '25.754060000000', 'Guiyang');
INSERT INTO `cf_areas` VALUES ('431022', '宜章县', '431000', '宜章', '3', '0735', '424200', '中国,湖南省,郴州市,宜章县', '112.951470000000', '25.399310000000', 'Yizhang');
INSERT INTO `cf_areas` VALUES ('431023', '永兴县', '431000', '永兴', '3', '0735', '423300', '中国,湖南省,郴州市,永兴县', '113.112420000000', '26.126460000000', 'Yongxing');
INSERT INTO `cf_areas` VALUES ('431024', '嘉禾县', '431000', '嘉禾', '3', '0735', '424500', '中国,湖南省,郴州市,嘉禾县', '112.369350000000', '25.587950000000', 'Jiahe');
INSERT INTO `cf_areas` VALUES ('431025', '临武县', '431000', '临武', '3', '0735', '424300', '中国,湖南省,郴州市,临武县', '112.563690000000', '25.276020000000', 'Linwu');
INSERT INTO `cf_areas` VALUES ('431026', '汝城县', '431000', '汝城', '3', '0735', '424100', '中国,湖南省,郴州市,汝城县', '113.685820000000', '25.552040000000', 'Rucheng');
INSERT INTO `cf_areas` VALUES ('431027', '桂东县', '431000', '桂东', '3', '0735', '423500', '中国,湖南省,郴州市,桂东县', '113.946800000000', '26.079870000000', 'Guidong');
INSERT INTO `cf_areas` VALUES ('431028', '安仁县', '431000', '安仁', '3', '0735', '423600', '中国,湖南省,郴州市,安仁县', '113.269440000000', '26.709310000000', 'Anren');
INSERT INTO `cf_areas` VALUES ('431081', '资兴市', '431000', '资兴', '3', '0735', '423400', '中国,湖南省,郴州市,资兴市', '113.237240000000', '25.976680000000', 'Zixing');
INSERT INTO `cf_areas` VALUES ('431100', '永州市', '430000', '永州', '2', '0746', '425000', '中国,湖南省,永州市', '111.608019000000', '26.434516000000', 'Yongzhou');
INSERT INTO `cf_areas` VALUES ('431102', '零陵区', '431100', '零陵', '3', '0746', '425100', '中国,湖南省,永州市,零陵区', '111.621030000000', '26.221090000000', 'Lingling');
INSERT INTO `cf_areas` VALUES ('431103', '冷水滩区', '431100', '冷水滩', '3', '0746', '425100', '中国,湖南省,永州市,冷水滩区', '111.592140000000', '26.461070000000', 'Lengshuitan');
INSERT INTO `cf_areas` VALUES ('431121', '祁阳县', '431100', '祁阳', '3', '0746', '426100', '中国,湖南省,永州市,祁阳县', '111.840110000000', '26.580090000000', 'Qiyang');
INSERT INTO `cf_areas` VALUES ('431122', '东安县', '431100', '东安', '3', '0746', '425900', '中国,湖南省,永州市,东安县', '111.316400000000', '26.392020000000', 'Dong\'an');
INSERT INTO `cf_areas` VALUES ('431123', '双牌县', '431100', '双牌', '3', '0746', '425200', '中国,湖南省,永州市,双牌县', '111.659270000000', '25.959880000000', 'Shuangpai');
INSERT INTO `cf_areas` VALUES ('431124', '道县', '431100', '道县', '3', '0746', '425300', '中国,湖南省,永州市,道县', '111.601950000000', '25.527660000000', 'Daoxian');
INSERT INTO `cf_areas` VALUES ('431125', '江永县', '431100', '江永', '3', '0746', '425400', '中国,湖南省,永州市,江永县', '111.340820000000', '25.272330000000', 'Jiangyong');
INSERT INTO `cf_areas` VALUES ('431126', '宁远县', '431100', '宁远', '3', '0746', '425600', '中国,湖南省,永州市,宁远县', '111.946250000000', '25.569130000000', 'Ningyuan');
INSERT INTO `cf_areas` VALUES ('431127', '蓝山县', '431100', '蓝山', '3', '0746', '425800', '中国,湖南省,永州市,蓝山县', '112.193630000000', '25.367940000000', 'Lanshan');
INSERT INTO `cf_areas` VALUES ('431128', '新田县', '431100', '新田', '3', '0746', '425700', '中国,湖南省,永州市,新田县', '112.221030000000', '25.909500000000', 'Xintian');
INSERT INTO `cf_areas` VALUES ('431129', '江华瑶族自治县', '431100', '江华', '3', '0746', '425500', '中国,湖南省,永州市,江华瑶族自治县', '111.588470000000', '25.184500000000', 'Jianghua');
INSERT INTO `cf_areas` VALUES ('431200', '怀化市', '430000', '怀化', '2', '0745', '418000', '中国,湖南省,怀化市', '109.978240000000', '27.550082000000', 'Huaihua');
INSERT INTO `cf_areas` VALUES ('431202', '鹤城区', '431200', '鹤城', '3', '0745', '418000', '中国,湖南省,怀化市,鹤城区', '109.965090000000', '27.549420000000', 'Hecheng');
INSERT INTO `cf_areas` VALUES ('431221', '中方县', '431200', '中方', '3', '0745', '418005', '中国,湖南省,怀化市,中方县', '109.944970000000', '27.439880000000', 'Zhongfang');
INSERT INTO `cf_areas` VALUES ('431222', '沅陵县', '431200', '沅陵', '3', '0745', '419600', '中国,湖南省,怀化市,沅陵县', '110.396330000000', '28.455480000000', 'Yuanling');
INSERT INTO `cf_areas` VALUES ('431223', '辰溪县', '431200', '辰溪', '3', '0745', '419500', '中国,湖南省,怀化市,辰溪县', '110.189420000000', '28.004060000000', 'Chenxi');
INSERT INTO `cf_areas` VALUES ('431224', '溆浦县', '431200', '溆浦', '3', '0745', '419300', '中国,湖南省,怀化市,溆浦县', '110.593840000000', '27.908360000000', 'Xupu');
INSERT INTO `cf_areas` VALUES ('431225', '会同县', '431200', '会同', '3', '0745', '418300', '中国,湖南省,怀化市,会同县', '109.735680000000', '26.887160000000', 'Huitong');
INSERT INTO `cf_areas` VALUES ('431226', '麻阳苗族自治县', '431200', '麻阳', '3', '0745', '419400', '中国,湖南省,怀化市,麻阳苗族自治县', '109.801940000000', '27.866000000000', 'Mayang');
INSERT INTO `cf_areas` VALUES ('431227', '新晃侗族自治县', '431200', '新晃', '3', '0745', '419200', '中国,湖南省,怀化市,新晃侗族自治县', '109.171660000000', '27.359370000000', 'Xinhuang');
INSERT INTO `cf_areas` VALUES ('431228', '芷江侗族自治县', '431200', '芷江', '3', '0745', '419100', '中国,湖南省,怀化市,芷江侗族自治县', '109.684900000000', '27.442970000000', 'Zhijiang');
INSERT INTO `cf_areas` VALUES ('431229', '靖州苗族侗族自治县', '431200', '靖州', '3', '0745', '418400', '中国,湖南省,怀化市,靖州苗族侗族自治县', '109.698210000000', '26.576510000000', 'Jingzhou');
INSERT INTO `cf_areas` VALUES ('431230', '通道侗族自治县', '431200', '通道', '3', '0745', '418500', '中国,湖南省,怀化市,通道侗族自治县', '109.785150000000', '26.157100000000', 'Tongdao');
INSERT INTO `cf_areas` VALUES ('431281', '洪江市', '431200', '洪江', '3', '0745', '418100', '中国,湖南省,怀化市,洪江市', '109.836510000000', '27.209220000000', 'Hongjiang');
INSERT INTO `cf_areas` VALUES ('431300', '娄底市', '430000', '娄底', '2', '0738', '417000', '中国,湖南省,娄底市', '112.008497000000', '27.728136000000', 'Loudi');
INSERT INTO `cf_areas` VALUES ('431302', '娄星区', '431300', '娄星', '3', '0738', '417000', '中国,湖南省,娄底市,娄星区', '112.001930000000', '27.729920000000', 'Louxing');
INSERT INTO `cf_areas` VALUES ('431321', '双峰县', '431300', '双峰', '3', '0738', '417700', '中国,湖南省,娄底市,双峰县', '112.199210000000', '27.454180000000', 'Shuangfeng');
INSERT INTO `cf_areas` VALUES ('431322', '新化县', '431300', '新化', '3', '0738', '417600', '中国,湖南省,娄底市,新化县', '111.327390000000', '27.726600000000', 'Xinhua');
INSERT INTO `cf_areas` VALUES ('431381', '冷水江市', '431300', '冷水江', '3', '0738', '417500', '中国,湖南省,娄底市,冷水江市', '111.435540000000', '27.681470000000', 'Lengshuijiang');
INSERT INTO `cf_areas` VALUES ('431382', '涟源市', '431300', '涟源', '3', '0738', '417100', '中国,湖南省,娄底市,涟源市', '111.672330000000', '27.688310000000', 'Lianyuan');
INSERT INTO `cf_areas` VALUES ('433100', '湘西土家族苗族自治州', '430000', '湘西', '2', '0743', '416000', '中国,湖南省,湘西土家族苗族自治州', '109.739735000000', '28.314296000000', 'Xiangxi');
INSERT INTO `cf_areas` VALUES ('433101', '吉首市', '433100', '吉首', '3', '0743', '416000', '中国,湖南省,湘西土家族苗族自治州,吉首市', '109.697990000000', '28.262470000000', 'Jishou');
INSERT INTO `cf_areas` VALUES ('433122', '泸溪县', '433100', '泸溪', '3', '0743', '416100', '中国,湖南省,湘西土家族苗族自治州,泸溪县', '110.216820000000', '28.220500000000', 'Luxi');
INSERT INTO `cf_areas` VALUES ('433123', '凤凰县', '433100', '凤凰', '3', '0743', '416200', '中国,湖南省,湘西土家族苗族自治州,凤凰县', '109.601560000000', '27.948220000000', 'Fenghuang');
INSERT INTO `cf_areas` VALUES ('433124', '花垣县', '433100', '花垣', '3', '0743', '416400', '中国,湖南省,湘西土家族苗族自治州,花垣县', '109.482170000000', '28.572100000000', 'Huayuan');
INSERT INTO `cf_areas` VALUES ('433125', '保靖县', '433100', '保靖', '3', '0743', '416500', '中国,湖南省,湘西土家族苗族自治州,保靖县', '109.660490000000', '28.699970000000', 'Baojing');
INSERT INTO `cf_areas` VALUES ('433126', '古丈县', '433100', '古丈', '3', '0743', '416300', '中国,湖南省,湘西土家族苗族自治州,古丈县', '109.948120000000', '28.619440000000', 'Guzhang');
INSERT INTO `cf_areas` VALUES ('433127', '永顺县', '433100', '永顺', '3', '0743', '416700', '中国,湖南省,湘西土家族苗族自治州,永顺县', '109.852660000000', '29.001030000000', 'Yongshun');
INSERT INTO `cf_areas` VALUES ('433130', '龙山县', '433100', '龙山', '3', '0743', '416800', '中国,湖南省,湘西土家族苗族自治州,龙山县', '109.443200000000', '29.456930000000', 'Longshan');
INSERT INTO `cf_areas` VALUES ('440000', '广东省', '100000', '广东', '1', '', '', '中国,广东省', '113.280637000000', '23.125178000000', 'Guangdong');
INSERT INTO `cf_areas` VALUES ('440100', '广州市', '440000', '广州', '2', '020', '510032', '中国,广东省,广州市', '113.280637000000', '23.125178000000', 'Guangzhou');
INSERT INTO `cf_areas` VALUES ('440103', '荔湾区', '440100', '荔湾', '3', '020', '510170', '中国,广东省,广州市,荔湾区', '113.244200000000', '23.125920000000', 'Liwan');
INSERT INTO `cf_areas` VALUES ('440104', '越秀区', '440100', '越秀', '3', '020', '510030', '中国,广东省,广州市,越秀区', '113.266830000000', '23.128970000000', 'Yuexiu');
INSERT INTO `cf_areas` VALUES ('440105', '海珠区', '440100', '海珠', '3', '020', '510300', '中国,广东省,广州市,海珠区', '113.261970000000', '23.103790000000', 'Haizhu');
INSERT INTO `cf_areas` VALUES ('440106', '天河区', '440100', '天河', '3', '020', '510665', '中国,广东省,广州市,天河区', '113.361120000000', '23.124670000000', 'Tianhe');
INSERT INTO `cf_areas` VALUES ('440111', '白云区', '440100', '白云', '3', '020', '510405', '中国,广东省,广州市,白云区', '113.273070000000', '23.157870000000', 'Baiyun');
INSERT INTO `cf_areas` VALUES ('440112', '黄埔区', '440100', '黄埔', '3', '020', '510700', '中国,广东省,广州市,黄埔区', '113.458950000000', '23.106420000000', 'Huangpu');
INSERT INTO `cf_areas` VALUES ('440113', '番禺区', '440100', '番禺', '3', '020', '511400', '中国,广东省,广州市,番禺区', '113.383970000000', '22.935990000000', 'Panyu');
INSERT INTO `cf_areas` VALUES ('440114', '花都区', '440100', '花都', '3', '020', '510800', '中国,广东省,广州市,花都区', '113.220330000000', '23.403580000000', 'Huadu');
INSERT INTO `cf_areas` VALUES ('440115', '南沙区', '440100', '南沙', '3', '020', '511458', '中国,广东省,广州市,南沙区', '113.608450000000', '22.771440000000', 'Nansha');
INSERT INTO `cf_areas` VALUES ('440117', '从化区', '440100', '从化', '3', '020', '510900', '中国,广东省,广州市,从化区', '113.587386000000', '23.545283000000', 'Conghua');
INSERT INTO `cf_areas` VALUES ('440118', '增城区', '440100', '增城', '3', '020', '511300', '中国,广东省,广州市,增城区', '113.829579000000', '23.290497000000', 'Zengcheng');
INSERT INTO `cf_areas` VALUES ('440200', '韶关市', '440000', '韶关', '2', '0751', '512002', '中国,广东省,韶关市', '113.591544000000', '24.801322000000', 'Shaoguan');
INSERT INTO `cf_areas` VALUES ('440203', '武江区', '440200', '武江', '3', '0751', '512026', '中国,广东省,韶关市,武江区', '113.587670000000', '24.792640000000', 'Wujiang');
INSERT INTO `cf_areas` VALUES ('440204', '浈江区', '440200', '浈江', '3', '0751', '512023', '中国,广东省,韶关市,浈江区', '113.611090000000', '24.804380000000', 'Zhenjiang');
INSERT INTO `cf_areas` VALUES ('440205', '曲江区', '440200', '曲江', '3', '0751', '512101', '中国,广东省,韶关市,曲江区', '113.601650000000', '24.679150000000', 'Qujiang');
INSERT INTO `cf_areas` VALUES ('440222', '始兴县', '440200', '始兴', '3', '0751', '512500', '中国,广东省,韶关市,始兴县', '114.067990000000', '24.947590000000', 'Shixing');
INSERT INTO `cf_areas` VALUES ('440224', '仁化县', '440200', '仁化', '3', '0751', '512300', '中国,广东省,韶关市,仁化县', '113.747370000000', '25.087420000000', 'Renhua');
INSERT INTO `cf_areas` VALUES ('440229', '翁源县', '440200', '翁源', '3', '0751', '512600', '中国,广东省,韶关市,翁源县', '114.133850000000', '24.349500000000', 'Wengyuan');
INSERT INTO `cf_areas` VALUES ('440232', '乳源瑶族自治县', '440200', '乳源', '3', '0751', '512700', '中国,广东省,韶关市,乳源瑶族自治县', '113.277340000000', '24.778030000000', 'Ruyuan');
INSERT INTO `cf_areas` VALUES ('440233', '新丰县', '440200', '新丰', '3', '0751', '511100', '中国,广东省,韶关市,新丰县', '114.207880000000', '24.059240000000', 'Xinfeng');
INSERT INTO `cf_areas` VALUES ('440281', '乐昌市', '440200', '乐昌', '3', '0751', '512200', '中国,广东省,韶关市,乐昌市', '113.356530000000', '25.127990000000', 'Lechang');
INSERT INTO `cf_areas` VALUES ('440282', '南雄市', '440200', '南雄', '3', '0751', '512400', '中国,广东省,韶关市,南雄市', '114.309660000000', '25.117060000000', 'Nanxiong');
INSERT INTO `cf_areas` VALUES ('440300', '深圳市', '440000', '深圳', '2', '0755', '518035', '中国,广东省,深圳市', '114.085947000000', '22.547000000000', 'Shenzhen');
INSERT INTO `cf_areas` VALUES ('440303', '罗湖区', '440300', '罗湖', '3', '0755', '518021', '中国,广东省,深圳市,罗湖区', '114.131160000000', '22.548360000000', 'Luohu');
INSERT INTO `cf_areas` VALUES ('440304', '福田区', '440300', '福田', '3', '0755', '518048', '中国,广东省,深圳市,福田区', '114.055710000000', '22.522450000000', 'Futian');
INSERT INTO `cf_areas` VALUES ('440305', '南山区', '440300', '南山', '3', '0755', '518051', '中国,广东省,深圳市,南山区', '113.930290000000', '22.532910000000', 'Nanshan');
INSERT INTO `cf_areas` VALUES ('440306', '宝安区', '440300', '宝安', '3', '0755', '518101', '中国,广东省,深圳市,宝安区', '113.883110000000', '22.553710000000', 'Bao\'an');
INSERT INTO `cf_areas` VALUES ('440307', '龙岗区', '440300', '龙岗', '3', '0755', '518172', '中国,广东省,深圳市,龙岗区', '114.247710000000', '22.719860000000', 'Longgang');
INSERT INTO `cf_areas` VALUES ('440308', '盐田区', '440300', '盐田', '3', '0755', '518081', '中国,广东省,深圳市,盐田区', '114.237330000000', '22.557800000000', 'Yantian');
INSERT INTO `cf_areas` VALUES ('440309', '光明新区', '440300', '光明新区', '3', '0755', '518100', '中国,广东省,深圳市,光明新区', '113.896026000000', '22.777292000000', 'Guangmingxinqu');
INSERT INTO `cf_areas` VALUES ('440310', '坪山新区', '440300', '坪山新区', '3', '0755', '518000', '中国,广东省,深圳市,坪山新区', '114.346370000000', '22.690529000000', 'Pingshanxinqu');
INSERT INTO `cf_areas` VALUES ('440311', '大鹏新区', '440300', '大鹏新区', '3', '0755', '518000', '中国,广东省,深圳市,大鹏新区', '114.479901000000', '22.587862000000', 'Dapengxinqu');
INSERT INTO `cf_areas` VALUES ('440312', '龙华新区', '440300', '龙华新区', '3', '0755', '518100', '中国,广东省,深圳市,龙华新区', '114.036585000000', '22.686950000000', 'Longhuaxinqu');
INSERT INTO `cf_areas` VALUES ('440400', '珠海市', '440000', '珠海', '2', '0756', '519000', '中国,广东省,珠海市', '113.552724000000', '22.255899000000', 'Zhuhai');
INSERT INTO `cf_areas` VALUES ('440402', '香洲区', '440400', '香洲', '3', '0756', '519000', '中国,广东省,珠海市,香洲区', '113.543500000000', '22.266540000000', 'Xiangzhou');
INSERT INTO `cf_areas` VALUES ('440403', '斗门区', '440400', '斗门', '3', '0756', '519110', '中国,广东省,珠海市,斗门区', '113.296440000000', '22.208980000000', 'Doumen');
INSERT INTO `cf_areas` VALUES ('440404', '金湾区', '440400', '金湾', '3', '0756', '519040', '中国,广东省,珠海市,金湾区', '113.363610000000', '22.146910000000', 'Jinwan');
INSERT INTO `cf_areas` VALUES ('440500', '汕头市', '440000', '汕头', '2', '0754', '515041', '中国,广东省,汕头市', '116.708463000000', '23.371020000000', 'Shantou');
INSERT INTO `cf_areas` VALUES ('440507', '龙湖区', '440500', '龙湖', '3', '0754', '515041', '中国,广东省,汕头市,龙湖区', '116.716410000000', '23.371660000000', 'Longhu');
INSERT INTO `cf_areas` VALUES ('440511', '金平区', '440500', '金平', '3', '0754', '515041', '中国,广东省,汕头市,金平区', '116.703640000000', '23.366370000000', 'Jinping');
INSERT INTO `cf_areas` VALUES ('440512', '濠江区', '440500', '濠江', '3', '0754', '515071', '中国,广东省,汕头市,濠江区', '116.726590000000', '23.285880000000', 'Haojiang');
INSERT INTO `cf_areas` VALUES ('440513', '潮阳区', '440500', '潮阳', '3', '0754', '515100', '中国,广东省,汕头市,潮阳区', '116.601500000000', '23.264850000000', 'Chaoyang');
INSERT INTO `cf_areas` VALUES ('440514', '潮南区', '440500', '潮南', '3', '0754', '515144', '中国,广东省,汕头市,潮南区', '116.431880000000', '23.250000000000', 'Chaonan');
INSERT INTO `cf_areas` VALUES ('440515', '澄海区', '440500', '澄海', '3', '0754', '515800', '中国,广东省,汕头市,澄海区', '116.755890000000', '23.467280000000', 'Chenghai');
INSERT INTO `cf_areas` VALUES ('440523', '南澳县', '440500', '南澳', '3', '0754', '515900', '中国,广东省,汕头市,南澳县', '117.018890000000', '23.422300000000', 'Nanao');
INSERT INTO `cf_areas` VALUES ('440600', '佛山市', '440000', '佛山', '2', '0757', '528000', '中国,广东省,佛山市', '113.122717000000', '23.028762000000', 'Foshan');
INSERT INTO `cf_areas` VALUES ('440604', '禅城区', '440600', '禅城', '3', '0757', '528000', '中国,广东省,佛山市,禅城区', '113.122800000000', '23.008420000000', 'Chancheng');
INSERT INTO `cf_areas` VALUES ('440605', '南海区', '440600', '南海', '3', '0757', '528251', '中国,广东省,佛山市,南海区', '113.142990000000', '23.028770000000', 'Nanhai');
INSERT INTO `cf_areas` VALUES ('440606', '顺德区', '440600', '顺德', '3', '0757', '528300', '中国,广东省,佛山市,顺德区', '113.293940000000', '22.804520000000', 'Shunde');
INSERT INTO `cf_areas` VALUES ('440607', '三水区', '440600', '三水', '3', '0757', '528133', '中国,广东省,佛山市,三水区', '112.897030000000', '23.155640000000', 'Sanshui');
INSERT INTO `cf_areas` VALUES ('440608', '高明区', '440600', '高明', '3', '0757', '528500', '中国,广东省,佛山市,高明区', '112.892540000000', '22.900220000000', 'Gaoming');
INSERT INTO `cf_areas` VALUES ('440700', '江门市', '440000', '江门', '2', '0750', '529000', '中国,广东省,江门市', '113.094942000000', '22.590431000000', 'Jiangmen');
INSERT INTO `cf_areas` VALUES ('440703', '蓬江区', '440700', '蓬江', '3', '0750', '529000', '中国,广东省,江门市,蓬江区', '113.078490000000', '22.595150000000', 'Pengjiang');
INSERT INTO `cf_areas` VALUES ('440704', '江海区', '440700', '江海', '3', '0750', '529040', '中国,广东省,江门市,江海区', '113.110990000000', '22.560240000000', 'Jianghai');
INSERT INTO `cf_areas` VALUES ('440705', '新会区', '440700', '新会', '3', '0750', '529100', '中国,广东省,江门市,新会区', '113.032250000000', '22.458760000000', 'Xinhui');
INSERT INTO `cf_areas` VALUES ('440781', '台山市', '440700', '台山', '3', '0750', '529200', '中国,广东省,江门市,台山市', '112.793820000000', '22.251500000000', 'Taishan');
INSERT INTO `cf_areas` VALUES ('440783', '开平市', '440700', '开平', '3', '0750', '529337', '中国,广东省,江门市,开平市', '112.698420000000', '22.376220000000', 'Kaiping');
INSERT INTO `cf_areas` VALUES ('440784', '鹤山市', '440700', '鹤山', '3', '0750', '529700', '中国,广东省,江门市,鹤山市', '112.964290000000', '22.765230000000', 'Heshan');
INSERT INTO `cf_areas` VALUES ('440785', '恩平市', '440700', '恩平', '3', '0750', '529400', '中国,广东省,江门市,恩平市', '112.304960000000', '22.182880000000', 'Enping');
INSERT INTO `cf_areas` VALUES ('440800', '湛江市', '440000', '湛江', '2', '0759', '524047', '中国,广东省,湛江市', '110.405529000000', '21.195338000000', 'Zhanjiang');
INSERT INTO `cf_areas` VALUES ('440802', '赤坎区', '440800', '赤坎', '3', '0759', '524033', '中国,广东省,湛江市,赤坎区', '110.365920000000', '21.266060000000', 'Chikan');
INSERT INTO `cf_areas` VALUES ('440803', '霞山区', '440800', '霞山', '3', '0759', '524011', '中国,广东省,湛江市,霞山区', '110.398220000000', '21.191810000000', 'Xiashan');
INSERT INTO `cf_areas` VALUES ('440804', '坡头区', '440800', '坡头', '3', '0759', '524057', '中国,广东省,湛江市,坡头区', '110.455330000000', '21.244720000000', 'Potou');
INSERT INTO `cf_areas` VALUES ('440811', '麻章区', '440800', '麻章', '3', '0759', '524094', '中国,广东省,湛江市,麻章区', '110.334200000000', '21.263330000000', 'Mazhang');
INSERT INTO `cf_areas` VALUES ('440823', '遂溪县', '440800', '遂溪', '3', '0759', '524300', '中国,广东省,湛江市,遂溪县', '110.250030000000', '21.377210000000', 'Suixi');
INSERT INTO `cf_areas` VALUES ('440825', '徐闻县', '440800', '徐闻', '3', '0759', '524100', '中国,广东省,湛江市,徐闻县', '110.173790000000', '20.328120000000', 'Xuwen');
INSERT INTO `cf_areas` VALUES ('440881', '廉江市', '440800', '廉江', '3', '0759', '524400', '中国,广东省,湛江市,廉江市', '110.284420000000', '21.609170000000', 'Lianjiang');
INSERT INTO `cf_areas` VALUES ('440882', '雷州市', '440800', '雷州', '3', '0759', '524200', '中国,广东省,湛江市,雷州市', '110.100920000000', '20.914280000000', 'Leizhou');
INSERT INTO `cf_areas` VALUES ('440883', '吴川市', '440800', '吴川', '3', '0759', '524500', '中国,广东省,湛江市,吴川市', '110.777030000000', '21.445840000000', 'Wuchuan');
INSERT INTO `cf_areas` VALUES ('440900', '茂名市', '440000', '茂名', '2', '0668', '525000', '中国,广东省,茂名市', '110.919229000000', '21.659751000000', 'Maoming');
INSERT INTO `cf_areas` VALUES ('440902', '茂南区', '440900', '茂南', '3', '0668', '525000', '中国,广东省,茂名市,茂南区', '110.918700000000', '21.641030000000', 'Maonan');
INSERT INTO `cf_areas` VALUES ('440904', '电白区', '440900', '电白', '3', '0668', '525400', '中国,广东省,茂名市,电白区', '111.007264000000', '21.507219000000', 'Dianbai');
INSERT INTO `cf_areas` VALUES ('440981', '高州市', '440900', '高州', '3', '0668', '525200', '中国,广东省,茂名市,高州市', '110.855190000000', '21.920570000000', 'Gaozhou');
INSERT INTO `cf_areas` VALUES ('440982', '化州市', '440900', '化州', '3', '0668', '525100', '中国,广东省,茂名市,化州市', '110.639490000000', '21.663940000000', 'Huazhou');
INSERT INTO `cf_areas` VALUES ('440983', '信宜市', '440900', '信宜', '3', '0668', '525300', '中国,广东省,茂名市,信宜市', '110.946470000000', '22.353510000000', 'Xinyi');
INSERT INTO `cf_areas` VALUES ('441200', '肇庆市', '440000', '肇庆', '2', '0758', '526040', '中国,广东省,肇庆市', '112.472529000000', '23.051546000000', 'Zhaoqing');
INSERT INTO `cf_areas` VALUES ('441202', '端州区', '441200', '端州', '3', '0758', '526060', '中国,广东省,肇庆市,端州区', '112.484950000000', '23.051900000000', 'Duanzhou');
INSERT INTO `cf_areas` VALUES ('441203', '鼎湖区', '441200', '鼎湖', '3', '0758', '526070', '中国,广东省,肇庆市,鼎湖区', '112.566430000000', '23.158460000000', 'Dinghu');
INSERT INTO `cf_areas` VALUES ('441223', '广宁县', '441200', '广宁', '3', '0758', '526300', '中国,广东省,肇庆市,广宁县', '112.440640000000', '23.634600000000', 'Guangning');
INSERT INTO `cf_areas` VALUES ('441224', '怀集县', '441200', '怀集', '3', '0758', '526400', '中国,广东省,肇庆市,怀集县', '112.183960000000', '23.909180000000', 'Huaiji');
INSERT INTO `cf_areas` VALUES ('441225', '封开县', '441200', '封开', '3', '0758', '526500', '中国,广东省,肇庆市,封开县', '111.503320000000', '23.435710000000', 'Fengkai');
INSERT INTO `cf_areas` VALUES ('441226', '德庆县', '441200', '德庆', '3', '0758', '526600', '中国,广东省,肇庆市,德庆县', '111.785550000000', '23.143710000000', 'Deqing');
INSERT INTO `cf_areas` VALUES ('441283', '高要市', '441200', '高要', '3', '0758', '526100', '中国,广东省,肇庆市,高要市', '112.458340000000', '23.025770000000', 'Gaoyao');
INSERT INTO `cf_areas` VALUES ('441284', '四会市', '441200', '四会', '3', '0758', '526200', '中国,广东省,肇庆市,四会市', '112.734160000000', '23.326860000000', 'Sihui');
INSERT INTO `cf_areas` VALUES ('441300', '惠州市', '440000', '惠州', '2', '0752', '516000', '中国,广东省,惠州市', '114.412599000000', '23.079404000000', 'Huizhou');
INSERT INTO `cf_areas` VALUES ('441302', '惠城区', '441300', '惠城', '3', '0752', '516008', '中国,广东省,惠州市,惠城区', '114.382800000000', '23.083770000000', 'Huicheng');
INSERT INTO `cf_areas` VALUES ('441303', '惠阳区', '441300', '惠阳', '3', '0752', '516211', '中国,广东省,惠州市,惠阳区', '114.456390000000', '22.788450000000', 'Huiyang');
INSERT INTO `cf_areas` VALUES ('441322', '博罗县', '441300', '博罗', '3', '0752', '516100', '中国,广东省,惠州市,博罗县', '114.289640000000', '23.173070000000', 'Boluo');
INSERT INTO `cf_areas` VALUES ('441323', '惠东县', '441300', '惠东', '3', '0752', '516300', '中国,广东省,惠州市,惠东县', '114.720090000000', '22.984840000000', 'Huidong');
INSERT INTO `cf_areas` VALUES ('441324', '龙门县', '441300', '龙门', '3', '0752', '516800', '中国,广东省,惠州市,龙门县', '114.254790000000', '23.727580000000', 'Longmen');
INSERT INTO `cf_areas` VALUES ('441400', '梅州市', '440000', '梅州', '2', '0753', '514021', '中国,广东省,梅州市', '116.117582000000', '24.299112000000', 'Meizhou');
INSERT INTO `cf_areas` VALUES ('441402', '梅江区', '441400', '梅江', '3', '0753', '514000', '中国,广东省,梅州市,梅江区', '116.116630000000', '24.310620000000', 'Meijiang');
INSERT INTO `cf_areas` VALUES ('441403', '梅县区', '441400', '梅县', '3', '0753', '514787', '中国,广东省,梅州市,梅县区', '116.097753000000', '24.286739000000', 'Meixian');
INSERT INTO `cf_areas` VALUES ('441422', '大埔县', '441400', '大埔', '3', '0753', '514200', '中国,广东省,梅州市,大埔县', '116.696620000000', '24.353250000000', 'Dabu');
INSERT INTO `cf_areas` VALUES ('441423', '丰顺县', '441400', '丰顺', '3', '0753', '514300', '中国,广东省,梅州市,丰顺县', '116.182190000000', '23.740940000000', 'Fengshun');
INSERT INTO `cf_areas` VALUES ('441424', '五华县', '441400', '五华', '3', '0753', '514400', '中国,广东省,梅州市,五华县', '115.778930000000', '23.924170000000', 'Wuhua');
INSERT INTO `cf_areas` VALUES ('441426', '平远县', '441400', '平远', '3', '0753', '514600', '中国,广东省,梅州市,平远县', '115.895560000000', '24.571160000000', 'Pingyuan');
INSERT INTO `cf_areas` VALUES ('441427', '蕉岭县', '441400', '蕉岭', '3', '0753', '514100', '中国,广东省,梅州市,蕉岭县', '116.170890000000', '24.657320000000', 'Jiaoling');
INSERT INTO `cf_areas` VALUES ('441481', '兴宁市', '441400', '兴宁', '3', '0753', '514500', '中国,广东省,梅州市,兴宁市', '115.731410000000', '24.140010000000', 'Xingning');
INSERT INTO `cf_areas` VALUES ('441500', '汕尾市', '440000', '汕尾', '2', '0660', '516600', '中国,广东省,汕尾市', '115.364238000000', '22.774485000000', 'Shanwei');
INSERT INTO `cf_areas` VALUES ('441502', '城区', '441500', '城区', '3', '0660', '516600', '中国,广东省,汕尾市,城区', '115.365030000000', '22.778900000000', 'Chengqu');
INSERT INTO `cf_areas` VALUES ('441521', '海丰县', '441500', '海丰', '3', '0660', '516400', '中国,广东省,汕尾市,海丰县', '115.323360000000', '22.966530000000', 'Haifeng');
INSERT INTO `cf_areas` VALUES ('441523', '陆河县', '441500', '陆河', '3', '0660', '516700', '中国,广东省,汕尾市,陆河县', '115.655970000000', '23.303650000000', 'Luhe');
INSERT INTO `cf_areas` VALUES ('441581', '陆丰市', '441500', '陆丰', '3', '0660', '516500', '中国,广东省,汕尾市,陆丰市', '115.648130000000', '22.943350000000', 'Lufeng');
INSERT INTO `cf_areas` VALUES ('441600', '河源市', '440000', '河源', '2', '0762', '517000', '中国,广东省,河源市', '114.697802000000', '23.746266000000', 'Heyuan');
INSERT INTO `cf_areas` VALUES ('441602', '源城区', '441600', '源城', '3', '0762', '517000', '中国,广东省,河源市,源城区', '114.702420000000', '23.734100000000', 'Yuancheng');
INSERT INTO `cf_areas` VALUES ('441621', '紫金县', '441600', '紫金', '3', '0762', '517400', '中国,广东省,河源市,紫金县', '115.183650000000', '23.638670000000', 'Zijin');
INSERT INTO `cf_areas` VALUES ('441622', '龙川县', '441600', '龙川', '3', '0762', '517300', '中国,广东省,河源市,龙川县', '115.260250000000', '24.101420000000', 'Longchuan');
INSERT INTO `cf_areas` VALUES ('441623', '连平县', '441600', '连平', '3', '0762', '517100', '中国,广东省,河源市,连平县', '114.490260000000', '24.371560000000', 'Lianping');
INSERT INTO `cf_areas` VALUES ('441624', '和平县', '441600', '和平', '3', '0762', '517200', '中国,广东省,河源市,和平县', '114.938410000000', '24.443190000000', 'Heping');
INSERT INTO `cf_areas` VALUES ('441625', '东源县', '441600', '东源', '3', '0762', '517583', '中国,广东省,河源市,东源县', '114.746330000000', '23.788350000000', 'Dongyuan');
INSERT INTO `cf_areas` VALUES ('441700', '阳江市', '440000', '阳江', '2', '0662', '529500', '中国,广东省,阳江市', '111.975107000000', '21.859222000000', 'Yangjiang');
INSERT INTO `cf_areas` VALUES ('441702', '江城区', '441700', '江城', '3', '0662', '529500', '中国,广东省,阳江市,江城区', '111.954880000000', '21.861930000000', 'Jiangcheng');
INSERT INTO `cf_areas` VALUES ('441704', '阳东区', '441700', '阳东', '3', '0662', '529900', '中国,广东省,阳江市,阳东区', '112.014670000000', '21.873980000000', 'Yangdong');
INSERT INTO `cf_areas` VALUES ('441721', '阳西县', '441700', '阳西', '3', '0662', '529800', '中国,广东省,阳江市,阳西县', '111.617850000000', '21.752340000000', 'Yangxi');
INSERT INTO `cf_areas` VALUES ('441781', '阳春市', '441700', '阳春', '3', '0662', '529600', '中国,广东省,阳江市,阳春市', '111.788540000000', '22.172320000000', 'Yangchun');
INSERT INTO `cf_areas` VALUES ('441800', '清远市', '440000', '清远', '2', '0763', '511500', '中国,广东省,清远市', '113.036779000000', '23.704188000000', 'Qingyuan');
INSERT INTO `cf_areas` VALUES ('441802', '清城区', '441800', '清城', '3', '0763', '511515', '中国,广东省,清远市,清城区', '113.062650000000', '23.697840000000', 'Qingcheng');
INSERT INTO `cf_areas` VALUES ('441803', '清新区', '441800', '清新', '3', '0763', '511810', '中国,广东省,清远市,清新区', '113.015203000000', '23.736949000000', 'Qingxin');
INSERT INTO `cf_areas` VALUES ('441821', '佛冈县', '441800', '佛冈', '3', '0763', '511600', '中国,广东省,清远市,佛冈县', '113.532860000000', '23.872310000000', 'Fogang');
INSERT INTO `cf_areas` VALUES ('441823', '阳山县', '441800', '阳山', '3', '0763', '513100', '中国,广东省,清远市,阳山县', '112.641290000000', '24.465160000000', 'Yangshan');
INSERT INTO `cf_areas` VALUES ('441825', '连山壮族瑶族自治县', '441800', '连山', '3', '0763', '513200', '中国,广东省,清远市,连山壮族瑶族自治县', '112.080200000000', '24.568070000000', 'Lianshan');
INSERT INTO `cf_areas` VALUES ('441826', '连南瑶族自治县', '441800', '连南', '3', '0763', '513300', '中国,广东省,清远市,连南瑶族自治县', '112.288420000000', '24.717260000000', 'Liannan');
INSERT INTO `cf_areas` VALUES ('441881', '英德市', '441800', '英德', '3', '0763', '513000', '中国,广东省,清远市,英德市', '113.415000000000', '24.185710000000', 'Yingde');
INSERT INTO `cf_areas` VALUES ('441882', '连州市', '441800', '连州', '3', '0763', '513400', '中国,广东省,清远市,连州市', '112.381530000000', '24.779130000000', 'Lianzhou');
INSERT INTO `cf_areas` VALUES ('441900', '东莞市', '440000', '东莞', '2', '0769', '523888', '中国,广东省,东莞市', '113.760234000000', '23.048884000000', 'Dongguan');
INSERT INTO `cf_areas` VALUES ('441901', '莞城区', '441900', '莞城', '3', '0769', '523128', '中国,广东省,东莞市,莞城区', '113.751043000000', '23.053412000000', 'Guancheng');
INSERT INTO `cf_areas` VALUES ('441902', '南城区', '441900', '南城', '3', '0769', '523617', '中国,广东省,东莞市,南城区', '113.752125000000', '23.020180000000', 'Nancheng');
INSERT INTO `cf_areas` VALUES ('441904', '万江区', '441900', '万江', '3', '0769', '523039', '中国,广东省,东莞市,万江区', '113.739053000000', '23.043842000000', 'Wanjiang');
INSERT INTO `cf_areas` VALUES ('441905', '石碣镇', '441900', '石碣', '3', '0769', '523290', '中国,广东省,东莞市,石碣镇', '113.802170000000', '23.098990000000', 'Shijie');
INSERT INTO `cf_areas` VALUES ('441906', '石龙镇', '441900', '石龙', '3', '0769', '523326', '中国,广东省,东莞市,石龙镇', '113.876381000000', '23.107444000000', 'Shilong');
INSERT INTO `cf_areas` VALUES ('441907', '茶山镇', '441900', '茶山', '3', '0769', '523380', '中国,广东省,东莞市,茶山镇', '113.883526000000', '23.062375000000', 'Chashan');
INSERT INTO `cf_areas` VALUES ('441908', '石排镇', '441900', '石排', '3', '0769', '523346', '中国,广东省,东莞市,石排镇', '113.919859000000', '23.086300000000', 'Shipai');
INSERT INTO `cf_areas` VALUES ('441909', '企石镇', '441900', '企石', '3', '0769', '523507', '中国,广东省,东莞市,企石镇', '114.013233000000', '23.066044000000', 'Qishi');
INSERT INTO `cf_areas` VALUES ('441910', '横沥镇', '441900', '横沥', '3', '0769', '523471', '中国,广东省,东莞市,横沥镇', '113.957436000000', '23.025732000000', 'Hengli');
INSERT INTO `cf_areas` VALUES ('441911', '桥头镇', '441900', '桥头', '3', '0769', '523520', '中国,广东省,东莞市,桥头镇', '114.013850000000', '22.939727000000', 'Qiaotou');
INSERT INTO `cf_areas` VALUES ('441912', '谢岗镇', '441900', '谢岗', '3', '0769', '523592', '中国,广东省,东莞市,谢岗镇', '114.141396000000', '22.959664000000', 'Xiegang');
INSERT INTO `cf_areas` VALUES ('441913', '东坑镇', '441900', '东坑', '3', '0769', '523451', '中国,广东省,东莞市,东坑镇', '113.939835000000', '22.992804000000', 'Dongkeng');
INSERT INTO `cf_areas` VALUES ('441914', '常平镇', '441900', '常平', '3', '0769', '523560', '中国,广东省,东莞市,常平镇', '114.029627000000', '23.016116000000', 'Changping');
INSERT INTO `cf_areas` VALUES ('441915', '寮步镇', '441900', '寮步', '3', '0769', '523411', '中国,广东省,东莞市,寮步镇', '113.884745000000', '22.991738000000', 'Liaobu');
INSERT INTO `cf_areas` VALUES ('441916', '大朗镇', '441900', '大朗', '3', '0769', '523770', '中国,广东省,东莞市,大朗镇', '113.927100000000', '22.965748000000', 'Dalang');
INSERT INTO `cf_areas` VALUES ('441917', '麻涌镇', '441900', '麻涌', '3', '0769', '523143', '中国,广东省,东莞市,麻涌镇', '113.546177000000', '23.045315000000', 'Machong');
INSERT INTO `cf_areas` VALUES ('441918', '中堂镇', '441900', '中堂', '3', '0769', '523233', '中国,广东省,东莞市,中堂镇', '113.654422000000', '23.090164000000', 'Zhongtang');
INSERT INTO `cf_areas` VALUES ('441919', '高埗镇', '441900', '高埗', '3', '0769', '523282', '中国,广东省,东莞市,高埗镇', '113.735917000000', '23.068415000000', 'Gaobu');
INSERT INTO `cf_areas` VALUES ('441920', '樟木头镇', '441900', '樟木头', '3', '0769', '523619', '中国,广东省,东莞市,樟木头镇', '114.066298000000', '22.956682000000', 'Zhangmutou');
INSERT INTO `cf_areas` VALUES ('441921', '大岭山镇', '441900', '大岭山', '3', '0769', '523835', '中国,广东省,东莞市,大岭山镇', '113.782955000000', '22.885366000000', 'Dalingshan');
INSERT INTO `cf_areas` VALUES ('441922', '望牛墩镇', '441900', '望牛墩', '3', '0769', '523203', '中国,广东省,东莞市,望牛墩镇', '113.658847000000', '23.055018000000', 'Wangniudun');
INSERT INTO `cf_areas` VALUES ('441923', '黄江镇', '441900', '黄江', '3', '0769', '523755', '中国,广东省,东莞市,黄江镇', '113.992635000000', '22.877536000000', 'Huangjiang');
INSERT INTO `cf_areas` VALUES ('441924', '洪梅镇', '441900', '洪梅', '3', '0769', '523163', '中国,广东省,东莞市,洪梅镇', '113.613081000000', '22.992675000000', 'Hongmei');
INSERT INTO `cf_areas` VALUES ('441925', '清溪镇', '441900', '清溪', '3', '0769', '523660', '中国,广东省,东莞市,清溪镇', '114.155796000000', '22.844456000000', 'Qingxi');
INSERT INTO `cf_areas` VALUES ('441926', '沙田镇', '441900', '沙田', '3', '0769', '523988', '中国,广东省,东莞市,沙田镇', '113.760234000000', '23.048884000000', 'Shatian');
INSERT INTO `cf_areas` VALUES ('441927', '道滘镇', '441900', '道滘', '3', '0769', '523171', '中国,广东省,东莞市,道滘镇', '113.760234000000', '23.048884000000', 'Daojiao');
INSERT INTO `cf_areas` VALUES ('441928', '塘厦镇', '441900', '塘厦', '3', '0769', '523713', '中国,广东省,东莞市,塘厦镇', '114.107650000000', '22.822862000000', 'Tangxia');
INSERT INTO `cf_areas` VALUES ('441929', '虎门镇', '441900', '虎门', '3', '0769', '523932', '中国,广东省,东莞市,虎门镇', '113.711180000000', '22.826150000000', 'Humen');
INSERT INTO `cf_areas` VALUES ('441930', '厚街镇', '441900', '厚街', '3', '0769', '523960', '中国,广东省,东莞市,厚街镇', '113.673010000000', '22.940815000000', 'Houjie');
INSERT INTO `cf_areas` VALUES ('441931', '凤岗镇', '441900', '凤岗', '3', '0769', '523690', '中国,广东省,东莞市,凤岗镇', '114.141194000000', '22.744598000000', 'Fenggang');
INSERT INTO `cf_areas` VALUES ('441932', '长安镇', '441900', '长安', '3', '0769', '523850', '中国,广东省,东莞市,长安镇', '113.803939000000', '22.816644000000', 'Chang\'an');
INSERT INTO `cf_areas` VALUES ('442000', '中山市', '440000', '中山', '2', '0760', '528403', '中国,广东省,中山市', '113.382391000000', '22.521113000000', 'Zhongshan');
INSERT INTO `cf_areas` VALUES ('442001', '石岐区', '442000', '石岐', '3', '0760', '528400', '中国,广东省,中山市,石岐区', '113.378835000000', '22.525220000000', 'Shiqi');
INSERT INTO `cf_areas` VALUES ('442004', '南区', '442000', '南区', '3', '0760', '528400', '中国,广东省,中山市,南区', '113.355896000000', '22.486568000000', 'Nanqu');
INSERT INTO `cf_areas` VALUES ('442005', '五桂山区', '442000', '五桂山', '3', '0760', '528458', '中国,广东省,中山市,五桂山区', '113.410790000000', '22.519680000000', 'Wuguishan');
INSERT INTO `cf_areas` VALUES ('442006', '火炬开发区', '442000', '火炬', '3', '0760', '528437', '中国,广东省,中山市,火炬开发区', '113.480523000000', '22.566082000000', 'Huoju');
INSERT INTO `cf_areas` VALUES ('442007', '黄圃镇', '442000', '黄圃', '3', '0760', '528429', '中国,广东省,中山市,黄圃镇', '113.342359000000', '22.715116000000', 'Huangpu');
INSERT INTO `cf_areas` VALUES ('442008', '南头镇', '442000', '南头', '3', '0760', '528421', '中国,广东省,中山市,南头镇', '113.296358000000', '22.713907000000', 'Nantou');
INSERT INTO `cf_areas` VALUES ('442009', '东凤镇', '442000', '东凤', '3', '0760', '528425', '中国,广东省,中山市,东凤镇', '113.261140000000', '22.687750000000', 'Dongfeng');
INSERT INTO `cf_areas` VALUES ('442010', '阜沙镇', '442000', '阜沙', '3', '0760', '528434', '中国,广东省,中山市,阜沙镇', '113.353024000000', '22.666364000000', 'Fusha');
INSERT INTO `cf_areas` VALUES ('442011', '小榄镇', '442000', '小榄', '3', '0760', '528415', '中国,广东省,中山市,小榄镇', '113.244235000000', '22.666951000000', 'Xiaolan');
INSERT INTO `cf_areas` VALUES ('442012', '东升镇', '442000', '东升', '3', '0760', '528400', '中国,广东省,中山市,东升镇', '113.296298000000', '22.614003000000', 'Dongsheng');
INSERT INTO `cf_areas` VALUES ('442013', '古镇镇', '442000', '古镇', '3', '0760', '528422', '中国,广东省,中山市,古镇镇', '113.179745000000', '22.611019000000', 'Guzhen');
INSERT INTO `cf_areas` VALUES ('442014', '横栏镇', '442000', '横栏', '3', '0760', '528478', '中国,广东省,中山市,横栏镇', '113.265845000000', '22.523202000000', 'Henglan');
INSERT INTO `cf_areas` VALUES ('442015', '三角镇', '442000', '三角', '3', '0760', '528422', '中国,广东省,中山市,三角镇', '113.423624000000', '22.677033000000', 'Sanjiao');
INSERT INTO `cf_areas` VALUES ('442016', '民众镇', '442000', '民众', '3', '0760', '528441', '中国,广东省,中山市,民众镇', '113.486025000000', '22.623468000000', 'Minzhong');
INSERT INTO `cf_areas` VALUES ('442017', '南朗镇', '442000', '南朗', '3', '0760', '528454', '中国,广东省,中山市,南朗镇', '113.533939000000', '22.492378000000', 'Nanlang');
INSERT INTO `cf_areas` VALUES ('442018', '港口镇', '442000', '港口', '3', '0760', '528447', '中国,广东省,中山市,港口镇', '113.382391000000', '22.521113000000', 'Gangkou');
INSERT INTO `cf_areas` VALUES ('442019', '大涌镇', '442000', '大涌', '3', '0760', '528476', '中国,广东省,中山市,大涌镇', '113.291708000000', '22.467712000000', 'Dayong');
INSERT INTO `cf_areas` VALUES ('442020', '沙溪镇', '442000', '沙溪', '3', '0760', '528471', '中国,广东省,中山市,沙溪镇', '113.328369000000', '22.526325000000', 'Shaxi');
INSERT INTO `cf_areas` VALUES ('442021', '三乡镇', '442000', '三乡', '3', '0760', '528463', '中国,广东省,中山市,三乡镇', '113.433400000000', '22.352494000000', 'Sanxiang');
INSERT INTO `cf_areas` VALUES ('442022', '板芙镇', '442000', '板芙', '3', '0760', '528459', '中国,广东省,中山市,板芙镇', '113.320346000000', '22.415674000000', 'Banfu');
INSERT INTO `cf_areas` VALUES ('442023', '神湾镇', '442000', '神湾', '3', '0760', '528462', '中国,广东省,中山市,神湾镇', '113.359387000000', '22.312476000000', 'Shenwan');
INSERT INTO `cf_areas` VALUES ('442024', '坦洲镇', '442000', '坦洲', '3', '0760', '528467', '中国,广东省,中山市,坦洲镇', '113.485677000000', '22.261269000000', 'Tanzhou');
INSERT INTO `cf_areas` VALUES ('445100', '潮州市', '440000', '潮州', '2', '0768', '521000', '中国,广东省,潮州市', '116.632301000000', '23.661701000000', 'Chaozhou');
INSERT INTO `cf_areas` VALUES ('445102', '湘桥区', '445100', '湘桥', '3', '0768', '521000', '中国,广东省,潮州市,湘桥区', '116.628050000000', '23.674510000000', 'Xiangqiao');
INSERT INTO `cf_areas` VALUES ('445103', '潮安区', '445100', '潮安', '3', '0768', '515638', '中国,广东省,潮州市,潮安区', '116.592895000000', '23.643656000000', 'Chao\'an');
INSERT INTO `cf_areas` VALUES ('445122', '饶平县', '445100', '饶平', '3', '0768', '515700', '中国,广东省,潮州市,饶平县', '117.006920000000', '23.669940000000', 'Raoping');
INSERT INTO `cf_areas` VALUES ('445200', '揭阳市', '440000', '揭阳', '2', '0633', '522000', '中国,广东省,揭阳市', '116.355733000000', '23.543778000000', 'Jieyang');
INSERT INTO `cf_areas` VALUES ('445202', '榕城区', '445200', '榕城', '3', '0633', '522000', '中国,广东省,揭阳市,榕城区', '116.367100000000', '23.525080000000', 'Rongcheng');
INSERT INTO `cf_areas` VALUES ('445203', '揭东区', '445200', '揭东', '3', '0633', '515500', '中国,广东省,揭阳市,揭东区', '116.412947000000', '23.569887000000', 'Jiedong');
INSERT INTO `cf_areas` VALUES ('445222', '揭西县', '445200', '揭西', '3', '0633', '515400', '中国,广东省,揭阳市,揭西县', '115.838830000000', '23.427140000000', 'Jiexi');
INSERT INTO `cf_areas` VALUES ('445224', '惠来县', '445200', '惠来', '3', '0633', '515200', '中国,广东省,揭阳市,惠来县', '116.295990000000', '23.032890000000', 'Huilai');
INSERT INTO `cf_areas` VALUES ('445281', '普宁市', '445200', '普宁', '3', '0633', '515300', '中国,广东省,揭阳市,普宁市', '116.165640000000', '23.297320000000', 'Puning');
INSERT INTO `cf_areas` VALUES ('445300', '云浮市', '440000', '云浮', '2', '0766', '527300', '中国,广东省,云浮市', '112.044439000000', '22.929801000000', 'Yunfu');
INSERT INTO `cf_areas` VALUES ('445302', '云城区', '445300', '云城', '3', '0766', '527300', '中国,广东省,云浮市,云城区', '112.039080000000', '22.929960000000', 'Yuncheng');
INSERT INTO `cf_areas` VALUES ('445303', '云安区', '445300', '云安', '3', '0766', '527500', '中国,广东省,云浮市,云安区', '112.009360000000', '23.077790000000', 'Yun\'an');
INSERT INTO `cf_areas` VALUES ('445321', '新兴县', '445300', '新兴', '3', '0766', '527400', '中国,广东省,云浮市,新兴县', '112.230190000000', '22.697340000000', 'Xinxing');
INSERT INTO `cf_areas` VALUES ('445322', '郁南县', '445300', '郁南', '3', '0766', '527100', '中国,广东省,云浮市,郁南县', '111.533870000000', '23.233070000000', 'Yunan');
INSERT INTO `cf_areas` VALUES ('445381', '罗定市', '445300', '罗定', '3', '0766', '527200', '中国,广东省,云浮市,罗定市', '111.569790000000', '22.769670000000', 'Luoding');
INSERT INTO `cf_areas` VALUES ('450000', '广西壮族自治区', '100000', '广西', '1', '', '', '中国,广西壮族自治区', '108.320004000000', '22.824020000000', 'Guangxi');
INSERT INTO `cf_areas` VALUES ('450100', '南宁市', '450000', '南宁', '2', '0771', '530028', '中国,广西壮族自治区,南宁市', '108.320004000000', '22.824020000000', 'Nanning');
INSERT INTO `cf_areas` VALUES ('450102', '兴宁区', '450100', '兴宁', '3', '0771', '530023', '中国,广西壮族自治区,南宁市,兴宁区', '108.366940000000', '22.853550000000', 'Xingning');
INSERT INTO `cf_areas` VALUES ('450103', '青秀区', '450100', '青秀', '3', '0771', '530213', '中国,广西壮族自治区,南宁市,青秀区', '108.495450000000', '22.785110000000', 'Qingxiu');
INSERT INTO `cf_areas` VALUES ('450105', '江南区', '450100', '江南', '3', '0771', '530031', '中国,广西壮族自治区,南宁市,江南区', '108.273250000000', '22.781270000000', 'Jiangnan');
INSERT INTO `cf_areas` VALUES ('450107', '西乡塘区', '450100', '西乡塘', '3', '0771', '530001', '中国,广西壮族自治区,南宁市,西乡塘区', '108.313470000000', '22.833860000000', 'Xixiangtang');
INSERT INTO `cf_areas` VALUES ('450108', '良庆区', '450100', '良庆', '3', '0771', '530219', '中国,广西壮族自治区,南宁市,良庆区', '108.412840000000', '22.749140000000', 'Liangqing');
INSERT INTO `cf_areas` VALUES ('450109', '邕宁区', '450100', '邕宁', '3', '0771', '530200', '中国,广西壮族自治区,南宁市,邕宁区', '108.486840000000', '22.756280000000', 'Yongning');
INSERT INTO `cf_areas` VALUES ('450122', '武鸣县', '450100', '武鸣', '3', '0771', '530100', '中国,广西壮族自治区,南宁市,武鸣县', '108.277190000000', '23.156430000000', 'Wuming');
INSERT INTO `cf_areas` VALUES ('450123', '隆安县', '450100', '隆安', '3', '0771', '532700', '中国,广西壮族自治区,南宁市,隆安县', '107.691920000000', '23.173360000000', 'Long\'an');
INSERT INTO `cf_areas` VALUES ('450124', '马山县', '450100', '马山', '3', '0771', '530600', '中国,广西壮族自治区,南宁市,马山县', '108.176970000000', '23.709310000000', 'Mashan');
INSERT INTO `cf_areas` VALUES ('450125', '上林县', '450100', '上林', '3', '0771', '530500', '中国,广西壮族自治区,南宁市,上林县', '108.605220000000', '23.432000000000', 'Shanglin');
INSERT INTO `cf_areas` VALUES ('450126', '宾阳县', '450100', '宾阳', '3', '0771', '530400', '中国,广西壮族自治区,南宁市,宾阳县', '108.811850000000', '23.219600000000', 'Binyang');
INSERT INTO `cf_areas` VALUES ('450127', '横县', '450100', '横县', '3', '0771', '530300', '中国,广西壮族自治区,南宁市,横县', '109.266080000000', '22.684480000000', 'Hengxian');
INSERT INTO `cf_areas` VALUES ('450128', '埌东新区', '450100', '埌东', '3', '0771', '530000', '中国,广西壮族自治区,南宁市,埌东新区', '108.419094000000', '22.812976000000', 'Langdong');
INSERT INTO `cf_areas` VALUES ('450200', '柳州市', '450000', '柳州', '2', '0772', '545001', '中国,广西壮族自治区,柳州市', '109.411703000000', '24.314617000000', 'Liuzhou');
INSERT INTO `cf_areas` VALUES ('450202', '城中区', '450200', '城中', '3', '0772', '545001', '中国,广西壮族自治区,柳州市,城中区', '109.410820000000', '24.315430000000', 'Chengzhong');
INSERT INTO `cf_areas` VALUES ('450203', '鱼峰区', '450200', '鱼峰', '3', '0772', '545005', '中国,广西壮族自治区,柳州市,鱼峰区', '109.453300000000', '24.318680000000', 'Yufeng');
INSERT INTO `cf_areas` VALUES ('450204', '柳南区', '450200', '柳南', '3', '0772', '545007', '中国,广西壮族自治区,柳州市,柳南区', '109.385480000000', '24.335990000000', 'Liunan');
INSERT INTO `cf_areas` VALUES ('450205', '柳北区', '450200', '柳北', '3', '0772', '545002', '中国,广西壮族自治区,柳州市,柳北区', '109.402020000000', '24.362670000000', 'Liubei');
INSERT INTO `cf_areas` VALUES ('450221', '柳江县', '450200', '柳江', '3', '0772', '545100', '中国,广西壮族自治区,柳州市,柳江县', '109.332730000000', '24.255960000000', 'Liujiang');
INSERT INTO `cf_areas` VALUES ('450222', '柳城县', '450200', '柳城', '3', '0772', '545200', '中国,广西壮族自治区,柳州市,柳城县', '109.238770000000', '24.649510000000', 'Liucheng');
INSERT INTO `cf_areas` VALUES ('450223', '鹿寨县', '450200', '鹿寨', '3', '0772', '545600', '中国,广西壮族自治区,柳州市,鹿寨县', '109.751770000000', '24.473060000000', 'Luzhai');
INSERT INTO `cf_areas` VALUES ('450224', '融安县', '450200', '融安', '3', '0772', '545400', '中国,广西壮族自治区,柳州市,融安县', '109.397610000000', '25.224650000000', 'Rong\'an');
INSERT INTO `cf_areas` VALUES ('450225', '融水苗族自治县', '450200', '融水', '3', '0772', '545300', '中国,广西壮族自治区,柳州市,融水苗族自治县', '109.256340000000', '25.066280000000', 'Rongshui');
INSERT INTO `cf_areas` VALUES ('450226', '三江侗族自治县', '450200', '三江', '3', '0772', '545500', '中国,广西壮族自治区,柳州市,三江侗族自治县', '109.604460000000', '25.784280000000', 'Sanjiang');
INSERT INTO `cf_areas` VALUES ('450227', '柳东新区', '450200', '柳东', '3', '0772', '545000', '中国,广西壮族自治区,柳州市,柳东新区', '109.437053000000', '24.329204000000', 'Liudong');
INSERT INTO `cf_areas` VALUES ('450300', '桂林市', '450000', '桂林', '2', '0773', '541100', '中国,广西壮族自治区,桂林市', '110.299121000000', '25.274215000000', 'Guilin');
INSERT INTO `cf_areas` VALUES ('450302', '秀峰区', '450300', '秀峰', '3', '0773', '541001', '中国,广西壮族自治区,桂林市,秀峰区', '110.289150000000', '25.282490000000', 'Xiufeng');
INSERT INTO `cf_areas` VALUES ('450303', '叠彩区', '450300', '叠彩', '3', '0773', '541001', '中国,广西壮族自治区,桂林市,叠彩区', '110.301950000000', '25.313810000000', 'Diecai');
INSERT INTO `cf_areas` VALUES ('450304', '象山区', '450300', '象山', '3', '0773', '541002', '中国,广西壮族自治区,桂林市,象山区', '110.281080000000', '25.261680000000', 'Xiangshan');
INSERT INTO `cf_areas` VALUES ('450305', '七星区', '450300', '七星', '3', '0773', '541004', '中国,广西壮族自治区,桂林市,七星区', '110.317930000000', '25.252500000000', 'Qixing');
INSERT INTO `cf_areas` VALUES ('450311', '雁山区', '450300', '雁山', '3', '0773', '541006', '中国,广西壮族自治区,桂林市,雁山区', '110.309110000000', '25.060380000000', 'Yanshan');
INSERT INTO `cf_areas` VALUES ('450312', '临桂区', '450300', '临桂', '3', '0773', '541100', '中国,广西壮族自治区,桂林市,临桂区', '110.205487000000', '25.246257000000', 'Lingui');
INSERT INTO `cf_areas` VALUES ('450321', '阳朔县', '450300', '阳朔', '3', '0773', '541900', '中国,广西壮族自治区,桂林市,阳朔县', '110.494750000000', '24.775790000000', 'Yangshuo');
INSERT INTO `cf_areas` VALUES ('450323', '灵川县', '450300', '灵川', '3', '0773', '541200', '中国,广西壮族自治区,桂林市,灵川县', '110.329490000000', '25.412920000000', 'Lingchuan');
INSERT INTO `cf_areas` VALUES ('450324', '全州县', '450300', '全州', '3', '0773', '541503', '中国,广西壮族自治区,桂林市,全州县', '111.072110000000', '25.927990000000', 'Quanzhou');
INSERT INTO `cf_areas` VALUES ('450325', '兴安县', '450300', '兴安', '3', '0773', '541300', '中国,广西壮族自治区,桂林市,兴安县', '110.671440000000', '25.611670000000', 'Xing\'an');
INSERT INTO `cf_areas` VALUES ('450326', '永福县', '450300', '永福', '3', '0773', '541800', '中国,广西壮族自治区,桂林市,永福县', '109.983330000000', '24.980040000000', 'Yongfu');
INSERT INTO `cf_areas` VALUES ('450327', '灌阳县', '450300', '灌阳', '3', '0773', '541600', '中国,广西壮族自治区,桂林市,灌阳县', '111.159540000000', '25.488030000000', 'Guanyang');
INSERT INTO `cf_areas` VALUES ('450328', '龙胜各族自治县', '450300', '龙胜', '3', '0773', '541700', '中国,广西壮族自治区,桂林市,龙胜各族自治县', '110.012260000000', '25.796140000000', 'Longsheng');
INSERT INTO `cf_areas` VALUES ('450329', '资源县', '450300', '资源', '3', '0773', '541400', '中国,广西壮族自治区,桂林市,资源县', '110.652550000000', '26.042370000000', 'Ziyuan');
INSERT INTO `cf_areas` VALUES ('450330', '平乐县', '450300', '平乐', '3', '0773', '542400', '中国,广西壮族自治区,桂林市,平乐县', '110.641750000000', '24.632420000000', 'Pingle');
INSERT INTO `cf_areas` VALUES ('450331', '荔浦县', '450300', '荔浦', '3', '0773', '546600', '中国,广西壮族自治区,桂林市,荔浦县', '110.397100000000', '24.495890000000', 'Lipu');
INSERT INTO `cf_areas` VALUES ('450332', '恭城瑶族自治县', '450300', '恭城', '3', '0773', '542500', '中国,广西壮族自治区,桂林市,恭城瑶族自治县', '110.830350000000', '24.832860000000', 'Gongcheng');
INSERT INTO `cf_areas` VALUES ('450400', '梧州市', '450000', '梧州', '2', '0774', '543002', '中国,广西壮族自治区,梧州市', '111.316229000000', '23.472309000000', 'Wuzhou');
INSERT INTO `cf_areas` VALUES ('450403', '万秀区', '450400', '万秀', '3', '0774', '543000', '中国,广西壮族自治区,梧州市,万秀区', '111.320520000000', '23.472980000000', 'Wanxiu');
INSERT INTO `cf_areas` VALUES ('450405', '长洲区', '450400', '长洲', '3', '0774', '543003', '中国,广西壮族自治区,梧州市,长洲区', '111.274940000000', '23.485730000000', 'Changzhou');
INSERT INTO `cf_areas` VALUES ('450406', '龙圩区', '450400', '龙圩', '3', '0774', '543002', '中国,广西壮族自治区,梧州市,龙圩区', '111.316229000000', '23.472309000000', 'Longxu');
INSERT INTO `cf_areas` VALUES ('450421', '苍梧县', '450400', '苍梧', '3', '0774', '543100', '中国,广西壮族自治区,梧州市,苍梧县', '111.245330000000', '23.420490000000', 'Cangwu');
INSERT INTO `cf_areas` VALUES ('450422', '藤县', '450400', '藤县', '3', '0774', '543300', '中国,广西壮族自治区,梧州市,藤县', '110.914180000000', '23.376050000000', 'Tengxian');
INSERT INTO `cf_areas` VALUES ('450423', '蒙山县', '450400', '蒙山', '3', '0774', '546700', '中国,广西壮族自治区,梧州市,蒙山县', '110.522210000000', '24.201680000000', 'Mengshan');
INSERT INTO `cf_areas` VALUES ('450481', '岑溪市', '450400', '岑溪', '3', '0774', '543200', '中国,广西壮族自治区,梧州市,岑溪市', '110.995940000000', '22.919100000000', 'Cenxi');
INSERT INTO `cf_areas` VALUES ('450500', '北海市', '450000', '北海', '2', '0779', '536000', '中国,广西壮族自治区,北海市', '109.119254000000', '21.473343000000', 'Beihai');
INSERT INTO `cf_areas` VALUES ('450502', '海城区', '450500', '海城', '3', '0779', '536000', '中国,广西壮族自治区,北海市,海城区', '109.117440000000', '21.475010000000', 'Haicheng');
INSERT INTO `cf_areas` VALUES ('450503', '银海区', '450500', '银海', '3', '0779', '536000', '中国,广西壮族自治区,北海市,银海区', '109.130290000000', '21.478300000000', 'Yinhai');
INSERT INTO `cf_areas` VALUES ('450512', '铁山港区', '450500', '铁山港', '3', '0779', '536017', '中国,广西壮族自治区,北海市,铁山港区', '109.455780000000', '21.596610000000', 'Tieshangang');
INSERT INTO `cf_areas` VALUES ('450521', '合浦县', '450500', '合浦', '3', '0779', '536100', '中国,广西壮族自治区,北海市,合浦县', '109.200680000000', '21.666010000000', 'Hepu');
INSERT INTO `cf_areas` VALUES ('450600', '防城港市', '450000', '防城港', '2', '0770', '538001', '中国,广西壮族自治区,防城港市', '108.345478000000', '21.614631000000', 'Fangchenggang');
INSERT INTO `cf_areas` VALUES ('450602', '港口区', '450600', '港口', '3', '0770', '538001', '中国,广西壮族自治区,防城港市,港口区', '108.380220000000', '21.643420000000', 'Gangkou');
INSERT INTO `cf_areas` VALUES ('450603', '防城区', '450600', '防城', '3', '0770', '538021', '中国,广西壮族自治区,防城港市,防城区', '108.357260000000', '21.764640000000', 'Fangcheng');
INSERT INTO `cf_areas` VALUES ('450621', '上思县', '450600', '上思', '3', '0770', '535500', '中国,广西壮族自治区,防城港市,上思县', '107.982300000000', '22.149570000000', 'Shangsi');
INSERT INTO `cf_areas` VALUES ('450681', '东兴市', '450600', '东兴', '3', '0770', '538100', '中国,广西壮族自治区,防城港市,东兴市', '107.972040000000', '21.547130000000', 'Dongxing');
INSERT INTO `cf_areas` VALUES ('450700', '钦州市', '450000', '钦州', '2', '0777', '535099', '中国,广西壮族自治区,钦州市', '108.624175000000', '21.967127000000', 'Qinzhou');
INSERT INTO `cf_areas` VALUES ('450702', '钦南区', '450700', '钦南', '3', '0777', '535099', '中国,广西壮族自治区,钦州市,钦南区', '108.617750000000', '21.951370000000', 'Qinnan');
INSERT INTO `cf_areas` VALUES ('450703', '钦北区', '450700', '钦北', '3', '0777', '535099', '中国,广西壮族自治区,钦州市,钦北区', '108.630370000000', '21.951270000000', 'Qinbei');
INSERT INTO `cf_areas` VALUES ('450721', '灵山县', '450700', '灵山', '3', '0777', '535099', '中国,广西壮族自治区,钦州市,灵山县', '109.291530000000', '22.416500000000', 'Lingshan');
INSERT INTO `cf_areas` VALUES ('450722', '浦北县', '450700', '浦北', '3', '0777', '535099', '中国,广西壮族自治区,钦州市,浦北县', '109.555720000000', '22.268880000000', 'Pubei');
INSERT INTO `cf_areas` VALUES ('450800', '贵港市', '450000', '贵港', '2', '0775', '537100', '中国,广西壮族自治区,贵港市', '109.602146000000', '23.093600000000', 'Guigang');
INSERT INTO `cf_areas` VALUES ('450802', '港北区', '450800', '港北', '3', '0775', '537100', '中国,广西壮族自治区,贵港市,港北区', '109.572240000000', '23.111530000000', 'Gangbei');
INSERT INTO `cf_areas` VALUES ('450803', '港南区', '450800', '港南', '3', '0775', '537100', '中国,广西壮族自治区,贵港市,港南区', '109.606170000000', '23.072260000000', 'Gangnan');
INSERT INTO `cf_areas` VALUES ('450804', '覃塘区', '450800', '覃塘', '3', '0775', '537121', '中国,广西壮族自治区,贵港市,覃塘区', '109.442930000000', '23.126770000000', 'Qintang');
INSERT INTO `cf_areas` VALUES ('450821', '平南县', '450800', '平南', '3', '0775', '537300', '中国,广西壮族自治区,贵港市,平南县', '110.390620000000', '23.542010000000', 'Pingnan');
INSERT INTO `cf_areas` VALUES ('450881', '桂平市', '450800', '桂平', '3', '0775', '537200', '中国,广西壮族自治区,贵港市,桂平市', '110.081050000000', '23.393390000000', 'Guiping');
INSERT INTO `cf_areas` VALUES ('450900', '玉林市', '450000', '玉林', '2', '0775', '537000', '中国,广西壮族自治区,玉林市', '110.154393000000', '22.631360000000', 'Yulin');
INSERT INTO `cf_areas` VALUES ('450902', '玉州区', '450900', '玉州', '3', '0775', '537000', '中国,广西壮族自治区,玉林市,玉州区', '110.151140000000', '22.628100000000', 'Yuzhou');
INSERT INTO `cf_areas` VALUES ('450903', '福绵区', '450900', '福绵', '3', '0775', '537023', '中国,广西壮族自治区,玉林市,福绵区', '110.064816000000', '22.583057000000', 'Fumian');
INSERT INTO `cf_areas` VALUES ('450904', '玉东新区', '450900', '玉东', '3', '0775', '537000', '中国,广西壮族自治区,玉林市,玉东新区', '110.154393000000', '22.631360000000', 'Yudong');
INSERT INTO `cf_areas` VALUES ('450921', '容县', '450900', '容县', '3', '0775', '537500', '中国,广西壮族自治区,玉林市,容县', '110.555930000000', '22.857010000000', 'Rongxian');
INSERT INTO `cf_areas` VALUES ('450922', '陆川县', '450900', '陆川', '3', '0775', '537700', '中国,广西壮族自治区,玉林市,陆川县', '110.264130000000', '22.324540000000', 'Luchuan');
INSERT INTO `cf_areas` VALUES ('450923', '博白县', '450900', '博白', '3', '0775', '537600', '中国,广西壮族自治区,玉林市,博白县', '109.977440000000', '22.272860000000', 'Bobai');
INSERT INTO `cf_areas` VALUES ('450924', '兴业县', '450900', '兴业', '3', '0775', '537800', '中国,广西壮族自治区,玉林市,兴业县', '109.876120000000', '22.742370000000', 'Xingye');
INSERT INTO `cf_areas` VALUES ('450981', '北流市', '450900', '北流', '3', '0775', '537400', '中国,广西壮族自治区,玉林市,北流市', '110.353020000000', '22.708170000000', 'Beiliu');
INSERT INTO `cf_areas` VALUES ('451000', '百色市', '450000', '百色', '2', '0776', '533000', '中国,广西壮族自治区,百色市', '106.616285000000', '23.897742000000', 'Baise');
INSERT INTO `cf_areas` VALUES ('451002', '右江区', '451000', '右江', '3', '0776', '533000', '中国,广西壮族自治区,百色市,右江区', '106.617640000000', '23.900900000000', 'Youjiang');
INSERT INTO `cf_areas` VALUES ('451021', '田阳县', '451000', '田阳', '3', '0776', '533600', '中国,广西壮族自治区,百色市,田阳县', '106.915580000000', '23.735350000000', 'Tianyang');
INSERT INTO `cf_areas` VALUES ('451022', '田东县', '451000', '田东', '3', '0776', '531500', '中国,广西壮族自治区,百色市,田东县', '107.124320000000', '23.600030000000', 'Tiandong');
INSERT INTO `cf_areas` VALUES ('451023', '平果县', '451000', '平果', '3', '0776', '531400', '中国,广西壮族自治区,百色市,平果县', '107.590450000000', '23.329690000000', 'Pingguo');
INSERT INTO `cf_areas` VALUES ('451024', '德保县', '451000', '德保', '3', '0776', '533700', '中国,广西壮族自治区,百色市,德保县', '106.619170000000', '23.325150000000', 'Debao');
INSERT INTO `cf_areas` VALUES ('451025', '靖西县', '451000', '靖西', '3', '0776', '533800', '中国,广西壮族自治区,百色市,靖西县', '106.417660000000', '23.134250000000', 'Jingxi');
INSERT INTO `cf_areas` VALUES ('451026', '那坡县', '451000', '那坡', '3', '0776', '533900', '中国,广西壮族自治区,百色市,那坡县', '105.841910000000', '23.406490000000', 'Napo');
INSERT INTO `cf_areas` VALUES ('451027', '凌云县', '451000', '凌云', '3', '0776', '533100', '中国,广西壮族自治区,百色市,凌云县', '106.561550000000', '24.347470000000', 'Lingyun');
INSERT INTO `cf_areas` VALUES ('451028', '乐业县', '451000', '乐业', '3', '0776', '533200', '中国,广西壮族自治区,百色市,乐业县', '106.561240000000', '24.782950000000', 'Leye');
INSERT INTO `cf_areas` VALUES ('451029', '田林县', '451000', '田林', '3', '0776', '533300', '中国,广西壮族自治区,百色市,田林县', '106.228820000000', '24.292070000000', 'Tianlin');
INSERT INTO `cf_areas` VALUES ('451030', '西林县', '451000', '西林', '3', '0776', '533500', '中国,广西壮族自治区,百色市,西林县', '105.097220000000', '24.489660000000', 'Xilin');
INSERT INTO `cf_areas` VALUES ('451031', '隆林各族自治县', '451000', '隆林', '3', '0776', '533400', '中国,广西壮族自治区,百色市,隆林各族自治县', '105.342950000000', '24.770360000000', 'Longlin');
INSERT INTO `cf_areas` VALUES ('451100', '贺州市', '450000', '贺州', '2', '0774', '542800', '中国,广西壮族自治区,贺州市', '111.552056000000', '24.414141000000', 'Hezhou');
INSERT INTO `cf_areas` VALUES ('451102', '八步区', '451100', '八步', '3', '0774', '542800', '中国,广西壮族自治区,贺州市,八步区', '111.552250000000', '24.411790000000', 'Babu');
INSERT INTO `cf_areas` VALUES ('451121', '昭平县', '451100', '昭平', '3', '0774', '546800', '中国,广西壮族自治区,贺州市,昭平县', '110.810820000000', '24.170100000000', 'Zhaoping');
INSERT INTO `cf_areas` VALUES ('451122', '钟山县', '451100', '钟山', '3', '0774', '542600', '中国,广西壮族自治区,贺州市,钟山县', '111.304590000000', '24.524820000000', 'Zhongshan');
INSERT INTO `cf_areas` VALUES ('451123', '富川瑶族自治县', '451100', '富川', '3', '0774', '542700', '中国,广西壮族自治区,贺州市,富川瑶族自治县', '111.277670000000', '24.814310000000', 'Fuchuan');
INSERT INTO `cf_areas` VALUES ('451124', '平桂管理区', '451100', '平桂', '3', '0774', '542800', '中国,广西壮族自治区,贺州市,平桂管理区', '111.485651000000', '24.458041000000', 'Pingui');
INSERT INTO `cf_areas` VALUES ('451200', '河池市', '450000', '河池', '2', '0778', '547000', '中国,广西壮族自治区,河池市', '108.062105000000', '24.695899000000', 'Hechi');
INSERT INTO `cf_areas` VALUES ('451202', '金城江区', '451200', '金城江', '3', '0779', '547000', '中国,广西壮族自治区,河池市,金城江区', '108.037270000000', '24.689700000000', 'Jinchengjiang');
INSERT INTO `cf_areas` VALUES ('451221', '南丹县', '451200', '南丹', '3', '0781', '547200', '中国,广西壮族自治区,河池市,南丹县', '107.545620000000', '24.977600000000', 'Nandan');
INSERT INTO `cf_areas` VALUES ('451222', '天峨县', '451200', '天峨', '3', '0782', '547300', '中国,广西壮族自治区,河池市,天峨县', '107.172050000000', '24.995930000000', 'Tiane');
INSERT INTO `cf_areas` VALUES ('451223', '凤山县', '451200', '凤山', '3', '0783', '547600', '中国,广西壮族自治区,河池市,凤山县', '107.048920000000', '24.542150000000', 'Fengshan');
INSERT INTO `cf_areas` VALUES ('451224', '东兰县', '451200', '东兰', '3', '0784', '547400', '中国,广西壮族自治区,河池市,东兰县', '107.375270000000', '24.510530000000', 'Donglan');
INSERT INTO `cf_areas` VALUES ('451225', '罗城仫佬族自治县', '451200', '罗城', '3', '0785', '546400', '中国,广西壮族自治区,河池市,罗城仫佬族自治县', '108.907770000000', '24.779230000000', 'Luocheng');
INSERT INTO `cf_areas` VALUES ('451226', '环江毛南族自治县', '451200', '环江', '3', '0786', '547100', '中国,广西壮族自治区,河池市,环江毛南族自治县', '108.260550000000', '24.829160000000', 'Huanjiang');
INSERT INTO `cf_areas` VALUES ('451227', '巴马瑶族自治县', '451200', '巴马', '3', '0787', '547500', '中国,广西壮族自治区,河池市,巴马瑶族自治县', '107.253080000000', '24.141350000000', 'Bama');
INSERT INTO `cf_areas` VALUES ('451228', '都安瑶族自治县', '451200', '都安', '3', '0788', '530700', '中国,广西壮族自治区,河池市,都安瑶族自治县', '108.101160000000', '23.932450000000', 'Du\'an');
INSERT INTO `cf_areas` VALUES ('451229', '大化瑶族自治县', '451200', '大化', '3', '0789', '530800', '中国,广西壮族自治区,河池市,大化瑶族自治县', '107.998500000000', '23.744870000000', 'Dahua');
INSERT INTO `cf_areas` VALUES ('451281', '宜州市', '451200', '宜州', '3', '0780', '546300', '中国,广西壮族自治区,河池市,宜州市', '108.653040000000', '24.493910000000', 'Yizhou');
INSERT INTO `cf_areas` VALUES ('451300', '来宾市', '450000', '来宾', '2', '0772', '546100', '中国,广西壮族自治区,来宾市', '109.229772000000', '23.733766000000', 'Laibin');
INSERT INTO `cf_areas` VALUES ('451302', '兴宾区', '451300', '兴宾', '3', '0772', '546100', '中国,广西壮族自治区,来宾市,兴宾区', '109.234710000000', '23.727310000000', 'Xingbin');
INSERT INTO `cf_areas` VALUES ('451321', '忻城县', '451300', '忻城', '3', '0772', '546200', '中国,广西壮族自治区,来宾市,忻城县', '108.663570000000', '24.068620000000', 'Xincheng');
INSERT INTO `cf_areas` VALUES ('451322', '象州县', '451300', '象州', '3', '0772', '545800', '中国,广西壮族自治区,来宾市,象州县', '109.699400000000', '23.973550000000', 'Xiangzhou');
INSERT INTO `cf_areas` VALUES ('451323', '武宣县', '451300', '武宣', '3', '0772', '545900', '中国,广西壮族自治区,来宾市,武宣县', '109.662840000000', '23.594740000000', 'Wuxuan');
INSERT INTO `cf_areas` VALUES ('451324', '金秀瑶族自治县', '451300', '金秀', '3', '0772', '545799', '中国,广西壮族自治区,来宾市,金秀瑶族自治县', '110.190790000000', '24.129290000000', 'Jinxiu');
INSERT INTO `cf_areas` VALUES ('451381', '合山市', '451300', '合山', '3', '0772', '546500', '中国,广西壮族自治区,来宾市,合山市', '108.885860000000', '23.806190000000', 'Heshan');
INSERT INTO `cf_areas` VALUES ('451400', '崇左市', '450000', '崇左', '2', '0771', '532299', '中国,广西壮族自治区,崇左市', '107.353926000000', '22.404108000000', 'Chongzuo');
INSERT INTO `cf_areas` VALUES ('451402', '江州区', '451400', '江州', '3', '0771', '532299', '中国,广西壮族自治区,崇左市,江州区', '107.347470000000', '22.411350000000', 'Jiangzhou');
INSERT INTO `cf_areas` VALUES ('451421', '扶绥县', '451400', '扶绥', '3', '0771', '532199', '中国,广西壮族自治区,崇左市,扶绥县', '107.904050000000', '22.634130000000', 'Fusui');
INSERT INTO `cf_areas` VALUES ('451422', '宁明县', '451400', '宁明', '3', '0771', '532599', '中国,广西壮族自治区,崇左市,宁明县', '107.072990000000', '22.136550000000', 'Ningming');
INSERT INTO `cf_areas` VALUES ('451423', '龙州县', '451400', '龙州', '3', '0771', '532499', '中国,广西壮族自治区,崇左市,龙州县', '106.854150000000', '22.339370000000', 'Longzhou');
INSERT INTO `cf_areas` VALUES ('451424', '大新县', '451400', '大新', '3', '0771', '532399', '中国,广西壮族自治区,崇左市,大新县', '107.198210000000', '22.834120000000', 'Daxin');
INSERT INTO `cf_areas` VALUES ('451425', '天等县', '451400', '天等', '3', '0771', '532899', '中国,广西壮族自治区,崇左市,天等县', '107.139980000000', '23.077000000000', 'Tiandeng');
INSERT INTO `cf_areas` VALUES ('451481', '凭祥市', '451400', '凭祥', '3', '0771', '532699', '中国,广西壮族自治区,崇左市,凭祥市', '106.755340000000', '22.105730000000', 'Pingxiang');
INSERT INTO `cf_areas` VALUES ('460000', '海南省', '100000', '海南', '1', '', '', '中国,海南省', '110.331190000000', '20.031971000000', 'Hainan');
INSERT INTO `cf_areas` VALUES ('460100', '海口市', '460000', '海口', '2', '0898', '570000', '中国,海南省,海口市', '110.331190000000', '20.031971000000', 'Haikou');
INSERT INTO `cf_areas` VALUES ('460105', '秀英区', '460100', '秀英', '3', '0898', '570311', '中国,海南省,海口市,秀英区', '110.293450000000', '20.007520000000', 'Xiuying');
INSERT INTO `cf_areas` VALUES ('460106', '龙华区', '460100', '龙华', '3', '0898', '570145', '中国,海南省,海口市,龙华区', '110.301940000000', '20.028660000000', 'Longhua');
INSERT INTO `cf_areas` VALUES ('460107', '琼山区', '460100', '琼山', '3', '0898', '571100', '中国,海南省,海口市,琼山区', '110.354180000000', '20.003210000000', 'Qiongshan');
INSERT INTO `cf_areas` VALUES ('460108', '美兰区', '460100', '美兰', '3', '0898', '570203', '中国,海南省,海口市,美兰区', '110.369080000000', '20.028640000000', 'Meilan');
INSERT INTO `cf_areas` VALUES ('460200', '三亚市', '460000', '三亚', '2', '0898', '572000', '中国,海南省,三亚市', '109.508268000000', '18.247872000000', 'Sanya');
INSERT INTO `cf_areas` VALUES ('460202', '海棠区', '460200', '海棠', '3', '0898', '572000', '中国,海南省,三亚市,海棠区', '109.508268000000', '18.247872000000', 'Haitang');
INSERT INTO `cf_areas` VALUES ('460203', '吉阳区', '460200', '吉阳', '3', '0898', '572000', '中国,海南省,三亚市,吉阳区', '109.508268000000', '18.247872000000', 'Jiyang');
INSERT INTO `cf_areas` VALUES ('460204', '天涯区', '460200', '天涯', '3', '0898', '572000', '中国,海南省,三亚市,天涯区', '109.508268000000', '18.247872000000', 'Tianya');
INSERT INTO `cf_areas` VALUES ('460205', '崖州区', '460200', '崖州', '3', '0898', '572000', '中国,海南省,三亚市,崖州区', '109.508268000000', '18.247872000000', 'Yazhou');
INSERT INTO `cf_areas` VALUES ('460300', '三沙市', '460000', '三沙', '2', '0898', '573199', '中国,海南省,三沙市', '112.348820000000', '16.831039000000', 'Sansha');
INSERT INTO `cf_areas` VALUES ('460321', '西沙群岛', '460300', '西沙', '3', '0898', '572000', '中国,海南省,三沙市,西沙群岛', '112.025528000000', '16.331342000000', 'Xisha Islands');
INSERT INTO `cf_areas` VALUES ('460322', '南沙群岛', '460300', '南沙', '3', '0898', '573100', '中国,海南省,三沙市,南沙群岛', '116.749998000000', '11.471888000000', 'Nansha Islands');
INSERT INTO `cf_areas` VALUES ('460323', '中沙群岛', '460300', '中沙', '3', '0898', '573100', '中国,海南省,三沙市,中沙群岛', '117.740071000000', '15.112856000000', 'Zhongsha Islands');
INSERT INTO `cf_areas` VALUES ('469000', '直辖县级', '460000', ' ', '2', '', '', '中国,海南省,直辖县级', '109.503479000000', '18.739906000000', '');
INSERT INTO `cf_areas` VALUES ('469001', '五指山市', '469000', '五指山', '3', '0898', '572200', '中国,海南省,直辖县级,五指山市', '109.516662000000', '18.776921000000', 'Wuzhishan');
INSERT INTO `cf_areas` VALUES ('469002', '琼海市', '469000', '琼海', '3', '0898', '571400', '中国,海南省,直辖县级,琼海市', '110.466785000000', '19.246011000000', 'Qionghai');
INSERT INTO `cf_areas` VALUES ('469003', '儋州市', '469000', '儋州', '3', '0898', '571700', '中国,海南省,直辖县级,儋州市', '109.576782000000', '19.517486000000', 'Danzhou');
INSERT INTO `cf_areas` VALUES ('469005', '文昌市', '469000', '文昌', '3', '0898', '571339', '中国,海南省,直辖县级,文昌市', '110.753975000000', '19.612986000000', 'Wenchang');
INSERT INTO `cf_areas` VALUES ('469006', '万宁市', '469000', '万宁', '3', '0898', '571500', '中国,海南省,直辖县级,万宁市', '110.388793000000', '18.796216000000', 'Wanning');
INSERT INTO `cf_areas` VALUES ('469007', '东方市', '469000', '东方', '3', '0898', '572600', '中国,海南省,直辖县级,东方市', '108.653789000000', '19.101980000000', 'Dongfang');
INSERT INTO `cf_areas` VALUES ('469021', '定安县', '469000', '定安', '3', '0898', '571200', '中国,海南省,直辖县级,定安县', '110.323959000000', '19.699211000000', 'Ding\'an');
INSERT INTO `cf_areas` VALUES ('469022', '屯昌县', '469000', '屯昌', '3', '0898', '571600', '中国,海南省,直辖县级,屯昌县', '110.102773000000', '19.362916000000', 'Tunchang');
INSERT INTO `cf_areas` VALUES ('469023', '澄迈县', '469000', '澄迈', '3', '0898', '571900', '中国,海南省,直辖县级,澄迈县', '110.007147000000', '19.737095000000', 'Chengmai');
INSERT INTO `cf_areas` VALUES ('469024', '临高县', '469000', '临高', '3', '0898', '571800', '中国,海南省,直辖县级,临高县', '109.687697000000', '19.908293000000', 'Lingao');
INSERT INTO `cf_areas` VALUES ('469025', '白沙黎族自治县', '469000', '白沙', '3', '0898', '572800', '中国,海南省,直辖县级,白沙黎族自治县', '109.452606000000', '19.224584000000', 'Baisha');
INSERT INTO `cf_areas` VALUES ('469026', '昌江黎族自治县', '469000', '昌江', '3', '0898', '572700', '中国,海南省,直辖县级,昌江黎族自治县', '109.053351000000', '19.260968000000', 'Changjiang');
INSERT INTO `cf_areas` VALUES ('469027', '乐东黎族自治县', '469000', '乐东', '3', '0898', '572500', '中国,海南省,直辖县级,乐东黎族自治县', '109.175444000000', '18.747580000000', 'Ledong');
INSERT INTO `cf_areas` VALUES ('469028', '陵水黎族自治县', '469000', '陵水', '3', '0898', '572400', '中国,海南省,直辖县级,陵水黎族自治县', '110.037218000000', '18.505006000000', 'Lingshui');
INSERT INTO `cf_areas` VALUES ('469029', '保亭黎族苗族自治县', '469000', '保亭', '3', '0898', '572300', '中国,海南省,直辖县级,保亭黎族苗族自治县', '109.702450000000', '18.636371000000', 'Baoting');
INSERT INTO `cf_areas` VALUES ('469030', '琼中黎族苗族自治县', '469000', '琼中', '3', '0898', '572900', '中国,海南省,直辖县级,琼中黎族苗族自治县', '109.839996000000', '19.035570000000', 'Qiongzhong');
INSERT INTO `cf_areas` VALUES ('500000', '重庆', '100000', '重庆', '1', '', '', '中国,重庆', '106.504962000000', '29.533155000000', 'Chongqing');
INSERT INTO `cf_areas` VALUES ('500100', '重庆市', '500000', '重庆', '2', '023', '400000', '中国,重庆,重庆市', '106.504962000000', '29.533155000000', 'Chongqing');
INSERT INTO `cf_areas` VALUES ('500101', '万州区', '500100', '万州', '3', '023', '404000', '中国,重庆,重庆市,万州区', '108.408690000000', '30.807880000000', 'Wanzhou');
INSERT INTO `cf_areas` VALUES ('500102', '涪陵区', '500100', '涪陵', '3', '023', '408000', '中国,重庆,重庆市,涪陵区', '107.390070000000', '29.702920000000', 'Fuling');
INSERT INTO `cf_areas` VALUES ('500103', '渝中区', '500100', '渝中', '3', '023', '400010', '中国,重庆,重庆市,渝中区', '106.569010000000', '29.552790000000', 'Yuzhong');
INSERT INTO `cf_areas` VALUES ('500104', '大渡口区', '500100', '大渡口', '3', '023', '400080', '中国,重庆,重庆市,大渡口区', '106.482620000000', '29.484470000000', 'Dadukou');
INSERT INTO `cf_areas` VALUES ('500105', '江北区', '500100', '江北', '3', '023', '400020', '中国,重庆,重庆市,江北区', '106.574340000000', '29.606580000000', 'Jiangbei');
INSERT INTO `cf_areas` VALUES ('500106', '沙坪坝区', '500100', '沙坪坝', '3', '023', '400030', '中国,重庆,重庆市,沙坪坝区', '106.457520000000', '29.541130000000', 'Shapingba');
INSERT INTO `cf_areas` VALUES ('500107', '九龙坡区', '500100', '九龙坡', '3', '023', '400050', '中国,重庆,重庆市,九龙坡区', '106.511070000000', '29.501970000000', 'Jiulongpo');
INSERT INTO `cf_areas` VALUES ('500108', '南岸区', '500100', '南岸', '3', '023', '400064', '中国,重庆,重庆市,南岸区', '106.563470000000', '29.523110000000', 'Nan\'an');
INSERT INTO `cf_areas` VALUES ('500109', '北碚区', '500100', '北碚', '3', '023', '400700', '中国,重庆,重庆市,北碚区', '106.396140000000', '29.805740000000', 'Beibei');
INSERT INTO `cf_areas` VALUES ('500110', '綦江区', '500100', '綦江', '3', '023', '400800', '中国,重庆,重庆市,綦江区', '106.926779000000', '28.960656000000', 'Qijiang');
INSERT INTO `cf_areas` VALUES ('500111', '大足区', '500100', '大足', '3', '023', '400900', '中国,重庆,重庆市,大足区', '105.768121000000', '29.484025000000', 'Dazu');
INSERT INTO `cf_areas` VALUES ('500112', '渝北区', '500100', '渝北', '3', '023', '401120', '中国,重庆,重庆市,渝北区', '106.630700000000', '29.718200000000', 'Yubei');
INSERT INTO `cf_areas` VALUES ('500113', '巴南区', '500100', '巴南', '3', '023', '401320', '中国,重庆,重庆市,巴南区', '106.523650000000', '29.383110000000', 'Banan');
INSERT INTO `cf_areas` VALUES ('500114', '黔江区', '500100', '黔江', '3', '023', '409700', '中国,重庆,重庆市,黔江区', '108.770900000000', '29.533200000000', 'Qianjiang');
INSERT INTO `cf_areas` VALUES ('500115', '长寿区', '500100', '长寿', '3', '023', '401220', '中国,重庆,重庆市,长寿区', '107.081660000000', '29.853590000000', 'Changshou');
INSERT INTO `cf_areas` VALUES ('500116', '江津区', '500100', '江津', '3', '023', '402260', '中国,重庆,重庆市,江津区', '106.259120000000', '29.290080000000', 'Jiangjin');
INSERT INTO `cf_areas` VALUES ('500117', '合川区', '500100', '合川', '3', '023', '401520', '中国,重庆,重庆市,合川区', '106.276330000000', '29.972270000000', 'Hechuan');
INSERT INTO `cf_areas` VALUES ('500118', '永川区', '500100', '永川', '3', '023', '402160', '中国,重庆,重庆市,永川区', '105.927000000000', '29.355930000000', 'Yongchuan');
INSERT INTO `cf_areas` VALUES ('500119', '南川区', '500100', '南川', '3', '023', '408400', '中国,重庆,重庆市,南川区', '107.099360000000', '29.157510000000', 'Nanchuan');
INSERT INTO `cf_areas` VALUES ('500120', '璧山区', '500100', '璧山', '3', '023', '402760', '中国,重庆,重庆市,璧山区', '106.231126000000', '29.593581000000', 'Bishan');
INSERT INTO `cf_areas` VALUES ('500151', '铜梁区', '500100', '铜梁', '3', '023', '402560', '中国,重庆,重庆市,铜梁区', '106.054948000000', '29.839944000000', 'Tongliang');
INSERT INTO `cf_areas` VALUES ('500223', '潼南县', '500100', '潼南', '3', '023', '402660', '中国,重庆,重庆市,潼南县', '105.840050000000', '30.191200000000', 'Tongnan');
INSERT INTO `cf_areas` VALUES ('500226', '荣昌县', '500100', '荣昌', '3', '023', '402460', '中国,重庆,重庆市,荣昌县', '105.594420000000', '29.404880000000', 'Rongchang');
INSERT INTO `cf_areas` VALUES ('500228', '梁平县', '500100', '梁平', '3', '023', '405200', '中国,重庆,重庆市,梁平县', '107.799980000000', '30.675450000000', 'Liangping');
INSERT INTO `cf_areas` VALUES ('500229', '城口县', '500100', '城口', '3', '023', '405900', '中国,重庆,重庆市,城口县', '108.665130000000', '31.948010000000', 'Chengkou');
INSERT INTO `cf_areas` VALUES ('500230', '丰都县', '500100', '丰都', '3', '023', '408200', '中国,重庆,重庆市,丰都县', '107.730980000000', '29.863480000000', 'Fengdu');
INSERT INTO `cf_areas` VALUES ('500231', '垫江县', '500100', '垫江', '3', '023', '408300', '中国,重庆,重庆市,垫江县', '107.354460000000', '30.333590000000', 'Dianjiang');
INSERT INTO `cf_areas` VALUES ('500232', '武隆县', '500100', '武隆', '3', '023', '408500', '中国,重庆,重庆市,武隆县', '107.760100000000', '29.325480000000', 'Wulong');
INSERT INTO `cf_areas` VALUES ('500233', '忠县', '500100', '忠县', '3', '023', '404300', '中国,重庆,重庆市,忠县', '108.036890000000', '30.288980000000', 'Zhongxian');
INSERT INTO `cf_areas` VALUES ('500234', '开县', '500100', '开县', '3', '023', '405400', '中国,重庆,重庆市,开县', '108.393060000000', '31.160950000000', 'Kaixian');
INSERT INTO `cf_areas` VALUES ('500235', '云阳县', '500100', '云阳', '3', '023', '404500', '中国,重庆,重庆市,云阳县', '108.697260000000', '30.930620000000', 'Yunyang');
INSERT INTO `cf_areas` VALUES ('500236', '奉节县', '500100', '奉节', '3', '023', '404600', '中国,重庆,重庆市,奉节县', '109.464780000000', '31.018250000000', 'Fengjie');
INSERT INTO `cf_areas` VALUES ('500237', '巫山县', '500100', '巫山', '3', '023', '404700', '中国,重庆,重庆市,巫山县', '109.878140000000', '31.074580000000', 'Wushan');
INSERT INTO `cf_areas` VALUES ('500238', '巫溪县', '500100', '巫溪', '3', '023', '405800', '中国,重庆,重庆市,巫溪县', '109.631280000000', '31.397560000000', 'Wuxi');
INSERT INTO `cf_areas` VALUES ('500240', '石柱土家族自治县', '500100', '石柱', '3', '023', '409100', '中国,重庆,重庆市,石柱土家族自治县', '108.113890000000', '30.000540000000', 'Shizhu');
INSERT INTO `cf_areas` VALUES ('500241', '秀山土家族苗族自治县', '500100', '秀山', '3', '023', '409900', '中国,重庆,重庆市,秀山土家族苗族自治县', '108.988610000000', '28.450620000000', 'Xiushan');
INSERT INTO `cf_areas` VALUES ('500242', '酉阳土家族苗族自治县', '500100', '酉阳', '3', '023', '409800', '中国,重庆,重庆市,酉阳土家族苗族自治县', '108.772120000000', '28.844600000000', 'Youyang');
INSERT INTO `cf_areas` VALUES ('500243', '彭水苗族土家族自治县', '500100', '彭水', '3', '023', '409600', '中国,重庆,重庆市,彭水苗族土家族自治县', '108.166380000000', '29.295160000000', 'Pengshui');
INSERT INTO `cf_areas` VALUES ('500300', '两江新区', '500000', '两江新区', '2', '023', '400000', '中国,重庆,两江新区', '106.463344000000', '29.729153000000', 'Liangjiangxinqu');
INSERT INTO `cf_areas` VALUES ('500301', '北部新区', '500300', '北部新区', '3', '023', '400000', '中国,重庆,两江新区,北部新区', '106.488841000000', '29.667062000000', 'Beibuxinqu');
INSERT INTO `cf_areas` VALUES ('500302', '保税港区', '500300', '保税港区', '3', '023', '400000', '中国,重庆,两江新区,保税港区', '106.638184000000', '29.716311000000', 'Baoshuigangqu');
INSERT INTO `cf_areas` VALUES ('500303', '工业园区', '500300', '工业园区', '3', '023', '400000', '中国,重庆,两江新区,工业园区', '106.626434000000', '29.555540000000', 'Gongyeyuanqu');
INSERT INTO `cf_areas` VALUES ('510000', '四川省', '100000', '四川', '1', '', '', '中国,四川省', '104.065735000000', '30.659462000000', 'Sichuan');
INSERT INTO `cf_areas` VALUES ('510100', '成都市', '510000', '成都', '2', '028', '610015', '中国,四川省,成都市', '104.065735000000', '30.659462000000', 'Chengdu');
INSERT INTO `cf_areas` VALUES ('510104', '锦江区', '510100', '锦江', '3', '028', '610021', '中国,四川省,成都市,锦江区', '104.083470000000', '30.656140000000', 'Jinjiang');
INSERT INTO `cf_areas` VALUES ('510105', '青羊区', '510100', '青羊', '3', '028', '610031', '中国,四川省,成都市,青羊区', '104.061510000000', '30.673870000000', 'Qingyang');
INSERT INTO `cf_areas` VALUES ('510106', '金牛区', '510100', '金牛', '3', '028', '610036', '中国,四川省,成都市,金牛区', '104.051140000000', '30.691260000000', 'Jinniu');
INSERT INTO `cf_areas` VALUES ('510107', '武侯区', '510100', '武侯', '3', '028', '610041', '中国,四川省,成都市,武侯区', '104.043030000000', '30.642350000000', 'Wuhou');
INSERT INTO `cf_areas` VALUES ('510108', '成华区', '510100', '成华', '3', '028', '610066', '中国,四川省,成都市,成华区', '104.101930000000', '30.659930000000', 'Chenghua');
INSERT INTO `cf_areas` VALUES ('510112', '龙泉驿区', '510100', '龙泉驿', '3', '028', '610100', '中国,四川省,成都市,龙泉驿区', '104.274620000000', '30.556580000000', 'Longquanyi');
INSERT INTO `cf_areas` VALUES ('510113', '青白江区', '510100', '青白江', '3', '028', '610300', '中国,四川省,成都市,青白江区', '104.251000000000', '30.878410000000', 'Qingbaijiang');
INSERT INTO `cf_areas` VALUES ('510114', '新都区', '510100', '新都', '3', '028', '610500', '中国,四川省,成都市,新都区', '104.159210000000', '30.823140000000', 'Xindu');
INSERT INTO `cf_areas` VALUES ('510115', '温江区', '510100', '温江', '3', '028', '611130', '中国,四川省,成都市,温江区', '103.848810000000', '30.684440000000', 'Wenjiang');
INSERT INTO `cf_areas` VALUES ('510121', '金堂县', '510100', '金堂', '3', '028', '610400', '中国,四川省,成都市,金堂县', '104.411950000000', '30.861950000000', 'Jintang');
INSERT INTO `cf_areas` VALUES ('510122', '双流县', '510100', '双流', '3', '028', '610200', '中国,四川省,成都市,双流县', '103.923730000000', '30.574440000000', 'Shuangliu');
INSERT INTO `cf_areas` VALUES ('510124', '郫县', '510100', '郫县', '3', '028', '611730', '中国,四川省,成都市,郫县', '103.887170000000', '30.810540000000', 'Pixian');
INSERT INTO `cf_areas` VALUES ('510129', '大邑县', '510100', '大邑', '3', '028', '611330', '中国,四川省,成都市,大邑县', '103.520750000000', '30.587380000000', 'Dayi');
INSERT INTO `cf_areas` VALUES ('510131', '蒲江县', '510100', '蒲江', '3', '028', '611630', '中国,四川省,成都市,蒲江县', '103.506160000000', '30.196670000000', 'Pujiang');
INSERT INTO `cf_areas` VALUES ('510132', '新津县', '510100', '新津', '3', '028', '611430', '中国,四川省,成都市,新津县', '103.811400000000', '30.409830000000', 'Xinjin');
INSERT INTO `cf_areas` VALUES ('510181', '都江堰市', '510100', '都江堰', '3', '028', '611830', '中国,四川省,成都市,都江堰市', '103.619410000000', '30.998250000000', 'Dujiangyan');
INSERT INTO `cf_areas` VALUES ('510182', '彭州市', '510100', '彭州', '3', '028', '611930', '中国,四川省,成都市,彭州市', '103.958000000000', '30.990110000000', 'Pengzhou');
INSERT INTO `cf_areas` VALUES ('510183', '邛崃市', '510100', '邛崃', '3', '028', '611530', '中国,四川省,成都市,邛崃市', '103.462830000000', '30.414890000000', 'Qionglai');
INSERT INTO `cf_areas` VALUES ('510184', '崇州市', '510100', '崇州', '3', '028', '611230', '中国,四川省,成都市,崇州市', '103.672850000000', '30.630140000000', 'Chongzhou');
INSERT INTO `cf_areas` VALUES ('510300', '自贡市', '510000', '自贡', '2', '0813', '643000', '中国,四川省,自贡市', '104.773447000000', '29.352765000000', 'Zigong');
INSERT INTO `cf_areas` VALUES ('510302', '自流井区', '510300', '自流井', '3', '0813', '643000', '中国,四川省,自贡市,自流井区', '104.777190000000', '29.337450000000', 'Ziliujing');
INSERT INTO `cf_areas` VALUES ('510303', '贡井区', '510300', '贡井', '3', '0813', '643020', '中国,四川省,自贡市,贡井区', '104.715360000000', '29.345760000000', 'Gongjing');
INSERT INTO `cf_areas` VALUES ('510304', '大安区', '510300', '大安', '3', '0813', '643010', '中国,四川省,自贡市,大安区', '104.773830000000', '29.363640000000', 'Da\'an');
INSERT INTO `cf_areas` VALUES ('510311', '沿滩区', '510300', '沿滩', '3', '0813', '643030', '中国,四川省,自贡市,沿滩区', '104.880120000000', '29.266110000000', 'Yantan');
INSERT INTO `cf_areas` VALUES ('510321', '荣县', '510300', '荣县', '3', '0813', '643100', '中国,四川省,自贡市,荣县', '104.417600000000', '29.444450000000', 'Rongxian');
INSERT INTO `cf_areas` VALUES ('510322', '富顺县', '510300', '富顺', '3', '0813', '643200', '中国,四川省,自贡市,富顺县', '104.974910000000', '29.181230000000', 'Fushun');
INSERT INTO `cf_areas` VALUES ('510400', '攀枝花市', '510000', '攀枝花', '2', '0812', '617000', '中国,四川省,攀枝花市', '101.716007000000', '26.580446000000', 'Panzhihua');
INSERT INTO `cf_areas` VALUES ('510402', '东区', '510400', '东区', '3', '0812', '617067', '中国,四川省,攀枝花市,东区', '101.705200000000', '26.546770000000', 'Dongqu');
INSERT INTO `cf_areas` VALUES ('510403', '西区', '510400', '西区', '3', '0812', '617068', '中国,四川省,攀枝花市,西区', '101.630580000000', '26.597530000000', 'Xiqu');
INSERT INTO `cf_areas` VALUES ('510411', '仁和区', '510400', '仁和', '3', '0812', '617061', '中国,四川省,攀枝花市,仁和区', '101.738120000000', '26.498410000000', 'Renhe');
INSERT INTO `cf_areas` VALUES ('510421', '米易县', '510400', '米易', '3', '0812', '617200', '中国,四川省,攀枝花市,米易县', '102.111320000000', '26.887180000000', 'Miyi');
INSERT INTO `cf_areas` VALUES ('510422', '盐边县', '510400', '盐边', '3', '0812', '617100', '中国,四川省,攀枝花市,盐边县', '101.854460000000', '26.688470000000', 'Yanbian');
INSERT INTO `cf_areas` VALUES ('510500', '泸州市', '510000', '泸州', '2', '0830', '646000', '中国,四川省,泸州市', '105.443348000000', '28.889138000000', 'Luzhou');
INSERT INTO `cf_areas` VALUES ('510502', '江阳区', '510500', '江阳', '3', '0830', '646000', '中国,四川省,泸州市,江阳区', '105.453360000000', '28.889340000000', 'Jiangyang');
INSERT INTO `cf_areas` VALUES ('510503', '纳溪区', '510500', '纳溪', '3', '0830', '646300', '中国,四川省,泸州市,纳溪区', '105.372550000000', '28.773430000000', 'Naxi');
INSERT INTO `cf_areas` VALUES ('510504', '龙马潭区', '510500', '龙马潭', '3', '0830', '646000', '中国,四川省,泸州市,龙马潭区', '105.437740000000', '28.913080000000', 'Longmatan');
INSERT INTO `cf_areas` VALUES ('510521', '泸县', '510500', '泸县', '3', '0830', '646106', '中国,四川省,泸州市,泸县', '105.381920000000', '29.150410000000', 'Luxian');
INSERT INTO `cf_areas` VALUES ('510522', '合江县', '510500', '合江', '3', '0830', '646200', '中国,四川省,泸州市,合江县', '105.835200000000', '28.810050000000', 'Hejiang');
INSERT INTO `cf_areas` VALUES ('510524', '叙永县', '510500', '叙永', '3', '0830', '646400', '中国,四川省,泸州市,叙永县', '105.444730000000', '28.155860000000', 'Xuyong');
INSERT INTO `cf_areas` VALUES ('510525', '古蔺县', '510500', '古蔺', '3', '0830', '646500', '中国,四川省,泸州市,古蔺县', '105.813470000000', '28.038670000000', 'Gulin');
INSERT INTO `cf_areas` VALUES ('510600', '德阳市', '510000', '德阳', '2', '0838', '618000', '中国,四川省,德阳市', '104.398651000000', '31.127991000000', 'Deyang');
INSERT INTO `cf_areas` VALUES ('510603', '旌阳区', '510600', '旌阳', '3', '0838', '618000', '中国,四川省,德阳市,旌阳区', '104.393670000000', '31.139060000000', 'Jingyang');
INSERT INTO `cf_areas` VALUES ('510623', '中江县', '510600', '中江', '3', '0838', '618100', '中国,四川省,德阳市,中江县', '104.678610000000', '31.032970000000', 'Zhongjiang');
INSERT INTO `cf_areas` VALUES ('510626', '罗江县', '510600', '罗江', '3', '0838', '618500', '中国,四川省,德阳市,罗江县', '104.510250000000', '31.316650000000', 'Luojiang');
INSERT INTO `cf_areas` VALUES ('510681', '广汉市', '510600', '广汉', '3', '0838', '618300', '中国,四川省,德阳市,广汉市', '104.282340000000', '30.976860000000', 'Guanghan');
INSERT INTO `cf_areas` VALUES ('510682', '什邡市', '510600', '什邡', '3', '0838', '618400', '中国,四川省,德阳市,什邡市', '104.167540000000', '31.126400000000', 'Shifang');
INSERT INTO `cf_areas` VALUES ('510683', '绵竹市', '510600', '绵竹', '3', '0838', '618200', '中国,四川省,德阳市,绵竹市', '104.220760000000', '31.337720000000', 'Mianzhu');
INSERT INTO `cf_areas` VALUES ('510700', '绵阳市', '510000', '绵阳', '2', '0816', '621000', '中国,四川省,绵阳市', '104.741722000000', '31.464020000000', 'Mianyang');
INSERT INTO `cf_areas` VALUES ('510703', '涪城区', '510700', '涪城', '3', '0816', '621000', '中国,四川省,绵阳市,涪城区', '104.757190000000', '31.455220000000', 'Fucheng');
INSERT INTO `cf_areas` VALUES ('510704', '游仙区', '510700', '游仙', '3', '0816', '621022', '中国,四川省,绵阳市,游仙区', '104.770920000000', '31.465740000000', 'Youxian');
INSERT INTO `cf_areas` VALUES ('510722', '三台县', '510700', '三台', '3', '0816', '621100', '中国,四川省,绵阳市,三台县', '105.090790000000', '31.091790000000', 'Santai');
INSERT INTO `cf_areas` VALUES ('510723', '盐亭县', '510700', '盐亭', '3', '0816', '621600', '中国,四川省,绵阳市,盐亭县', '105.389800000000', '31.221760000000', 'Yanting');
INSERT INTO `cf_areas` VALUES ('510724', '安县', '510700', '安县', '3', '0816', '622650', '中国,四川省,绵阳市,安县', '104.567380000000', '31.534870000000', 'Anxian');
INSERT INTO `cf_areas` VALUES ('510725', '梓潼县', '510700', '梓潼', '3', '0816', '622150', '中国,四川省,绵阳市,梓潼县', '105.161830000000', '31.635900000000', 'Zitong');
INSERT INTO `cf_areas` VALUES ('510726', '北川羌族自治县', '510700', '北川', '3', '0816', '622750', '中国,四川省,绵阳市,北川羌族自治县', '104.464080000000', '31.832860000000', 'Beichuan');
INSERT INTO `cf_areas` VALUES ('510727', '平武县', '510700', '平武', '3', '0816', '622550', '中国,四川省,绵阳市,平武县', '104.528620000000', '32.407910000000', 'Pingwu');
INSERT INTO `cf_areas` VALUES ('510781', '江油市', '510700', '江油', '3', '0816', '621700', '中国,四川省,绵阳市,江油市', '104.745390000000', '31.777750000000', 'Jiangyou');
INSERT INTO `cf_areas` VALUES ('510800', '广元市', '510000', '广元', '2', '0839', '628000', '中国,四川省,广元市', '105.829757000000', '32.433668000000', 'Guangyuan');
INSERT INTO `cf_areas` VALUES ('510802', '利州区', '510800', '利州', '3', '0839', '628017', '中国,四川省,广元市,利州区', '105.826194000000', '32.432276000000', 'Lizhou');
INSERT INTO `cf_areas` VALUES ('510811', '昭化区', '510800', '昭化', '3', '0839', '628017', '中国,四川省,广元市,昭化区', '105.640491000000', '32.386518000000', 'Zhaohua');
INSERT INTO `cf_areas` VALUES ('510812', '朝天区', '510800', '朝天', '3', '0839', '628017', '中国,四川省,广元市,朝天区', '105.892730000000', '32.643980000000', 'Chaotian');
INSERT INTO `cf_areas` VALUES ('510821', '旺苍县', '510800', '旺苍', '3', '0839', '628200', '中国,四川省,广元市,旺苍县', '106.290220000000', '32.228450000000', 'Wangcang');
INSERT INTO `cf_areas` VALUES ('510822', '青川县', '510800', '青川', '3', '0839', '628100', '中国,四川省,广元市,青川县', '105.239100000000', '32.585630000000', 'Qingchuan');
INSERT INTO `cf_areas` VALUES ('510823', '剑阁县', '510800', '剑阁', '3', '0839', '628300', '中国,四川省,广元市,剑阁县', '105.525200000000', '32.288450000000', 'Jiange');
INSERT INTO `cf_areas` VALUES ('510824', '苍溪县', '510800', '苍溪', '3', '0839', '628400', '中国,四川省,广元市,苍溪县', '105.936000000000', '31.732090000000', 'Cangxi');
INSERT INTO `cf_areas` VALUES ('510900', '遂宁市', '510000', '遂宁', '2', '0825', '629000', '中国,四川省,遂宁市', '105.571331000000', '30.513311000000', 'Suining');
INSERT INTO `cf_areas` VALUES ('510903', '船山区', '510900', '船山', '3', '0825', '629000', '中国,四川省,遂宁市,船山区', '105.580900000000', '30.499910000000', 'Chuanshan');
INSERT INTO `cf_areas` VALUES ('510904', '安居区', '510900', '安居', '3', '0825', '629000', '中国,四川省,遂宁市,安居区', '105.464020000000', '30.357780000000', 'Anju');
INSERT INTO `cf_areas` VALUES ('510921', '蓬溪县', '510900', '蓬溪', '3', '0825', '629100', '中国,四川省,遂宁市,蓬溪县', '105.707520000000', '30.757750000000', 'Pengxi');
INSERT INTO `cf_areas` VALUES ('510922', '射洪县', '510900', '射洪', '3', '0825', '629200', '中国,四川省,遂宁市,射洪县', '105.389220000000', '30.872030000000', 'Shehong');
INSERT INTO `cf_areas` VALUES ('510923', '大英县', '510900', '大英', '3', '0825', '629300', '中国,四川省,遂宁市,大英县', '105.243460000000', '30.594340000000', 'Daying');
INSERT INTO `cf_areas` VALUES ('511000', '内江市', '510000', '内江', '2', '0832', '641000', '中国,四川省,内江市', '105.066138000000', '29.587080000000', 'Neijiang');
INSERT INTO `cf_areas` VALUES ('511002', '市中区', '511000', '市中区', '3', '0832', '641000', '中国,四川省,内江市,市中区', '105.067900000000', '29.587090000000', 'Shizhongqu');
INSERT INTO `cf_areas` VALUES ('511011', '东兴区', '511000', '东兴', '3', '0832', '641100', '中国,四川省,内江市,东兴区', '105.075540000000', '29.592780000000', 'Dongxing');
INSERT INTO `cf_areas` VALUES ('511024', '威远县', '511000', '威远', '3', '0832', '642450', '中国,四川省,内江市,威远县', '104.669550000000', '29.528230000000', 'Weiyuan');
INSERT INTO `cf_areas` VALUES ('511025', '资中县', '511000', '资中', '3', '0832', '641200', '中国,四川省,内江市,资中县', '104.852050000000', '29.764090000000', 'Zizhong');
INSERT INTO `cf_areas` VALUES ('511028', '隆昌县', '511000', '隆昌', '3', '0832', '642150', '中国,四川省,内江市,隆昌县', '105.287380000000', '29.339370000000', 'Longchang');
INSERT INTO `cf_areas` VALUES ('511100', '乐山市', '510000', '乐山', '2', '0833', '614000', '中国,四川省,乐山市', '103.761263000000', '29.582024000000', 'Leshan');
INSERT INTO `cf_areas` VALUES ('511102', '市中区', '511100', '市中区', '3', '0833', '614000', '中国,四川省,乐山市,市中区', '103.761590000000', '29.555430000000', 'Shizhongqu');
INSERT INTO `cf_areas` VALUES ('511111', '沙湾区', '511100', '沙湾', '3', '0833', '614900', '中国,四川省,乐山市,沙湾区', '103.548730000000', '29.411940000000', 'Shawan');
INSERT INTO `cf_areas` VALUES ('511112', '五通桥区', '511100', '五通桥', '3', '0833', '614800', '中国,四川省,乐山市,五通桥区', '103.823450000000', '29.403440000000', 'Wutongqiao');
INSERT INTO `cf_areas` VALUES ('511113', '金口河区', '511100', '金口河', '3', '0833', '614700', '中国,四川省,乐山市,金口河区', '103.078580000000', '29.245780000000', 'Jinkouhe');
INSERT INTO `cf_areas` VALUES ('511123', '犍为县', '511100', '犍为', '3', '0833', '614400', '中国,四川省,乐山市,犍为县', '103.949890000000', '29.209730000000', 'Qianwei');
INSERT INTO `cf_areas` VALUES ('511124', '井研县', '511100', '井研', '3', '0833', '613100', '中国,四川省,乐山市,井研县', '104.070190000000', '29.652280000000', 'Jingyan');
INSERT INTO `cf_areas` VALUES ('511126', '夹江县', '511100', '夹江', '3', '0833', '614100', '中国,四川省,乐山市,夹江县', '103.571990000000', '29.738680000000', 'Jiajiang');
INSERT INTO `cf_areas` VALUES ('511129', '沐川县', '511100', '沐川', '3', '0833', '614500', '中国,四川省,乐山市,沐川县', '103.903530000000', '28.956460000000', 'Muchuan');
INSERT INTO `cf_areas` VALUES ('511132', '峨边彝族自治县', '511100', '峨边', '3', '0833', '614300', '中国,四川省,乐山市,峨边彝族自治县', '103.263390000000', '29.230040000000', 'Ebian');
INSERT INTO `cf_areas` VALUES ('511133', '马边彝族自治县', '511100', '马边', '3', '0833', '614600', '中国,四川省,乐山市,马边彝族自治县', '103.546170000000', '28.835930000000', 'Mabian');
INSERT INTO `cf_areas` VALUES ('511181', '峨眉山市', '511100', '峨眉山', '3', '0833', '614200', '中国,四川省,乐山市,峨眉山市', '103.484400000000', '29.601170000000', 'Emeishan');
INSERT INTO `cf_areas` VALUES ('511300', '南充市', '510000', '南充', '2', '0817', '637000', '中国,四川省,南充市', '106.082974000000', '30.795281000000', 'Nanchong');
INSERT INTO `cf_areas` VALUES ('511302', '顺庆区', '511300', '顺庆', '3', '0817', '637000', '中国,四川省,南充市,顺庆区', '106.092160000000', '30.796420000000', 'Shunqing');
INSERT INTO `cf_areas` VALUES ('511303', '高坪区', '511300', '高坪', '3', '0817', '637100', '中国,四川省,南充市,高坪区', '106.118940000000', '30.781620000000', 'Gaoping');
INSERT INTO `cf_areas` VALUES ('511304', '嘉陵区', '511300', '嘉陵', '3', '0817', '637100', '中国,四川省,南充市,嘉陵区', '106.071410000000', '30.758480000000', 'Jialing');
INSERT INTO `cf_areas` VALUES ('511321', '南部县', '511300', '南部', '3', '0817', '637300', '中国,四川省,南充市,南部县', '106.067380000000', '31.354510000000', 'Nanbu');
INSERT INTO `cf_areas` VALUES ('511322', '营山县', '511300', '营山', '3', '0817', '637700', '中国,四川省,南充市,营山县', '106.566370000000', '31.077470000000', 'Yingshan');
INSERT INTO `cf_areas` VALUES ('511323', '蓬安县', '511300', '蓬安', '3', '0817', '637800', '中国,四川省,南充市,蓬安县', '106.412620000000', '31.029640000000', 'Peng\'an');
INSERT INTO `cf_areas` VALUES ('511324', '仪陇县', '511300', '仪陇', '3', '0817', '637600', '中国,四川省,南充市,仪陇县', '106.299740000000', '31.276280000000', 'Yilong');
INSERT INTO `cf_areas` VALUES ('511325', '西充县', '511300', '西充', '3', '0817', '637200', '中国,四川省,南充市,西充县', '105.899960000000', '30.996900000000', 'Xichong');
INSERT INTO `cf_areas` VALUES ('511381', '阆中市', '511300', '阆中', '3', '0817', '637400', '中国,四川省,南充市,阆中市', '106.004940000000', '31.558320000000', 'Langzhong');
INSERT INTO `cf_areas` VALUES ('511400', '眉山市', '510000', '眉山', '2', '028', '620020', '中国,四川省,眉山市', '103.831788000000', '30.048318000000', 'Meishan');
INSERT INTO `cf_areas` VALUES ('511402', '东坡区', '511400', '东坡', '3', '028', '620010', '中国,四川省,眉山市,东坡区', '103.832000000000', '30.042190000000', 'Dongpo');
INSERT INTO `cf_areas` VALUES ('511403', '彭山区', '511400', '彭山', '3', '028', '620860', '中国,四川省,眉山市,彭山区', '103.872680000000', '30.192830000000', 'Pengshan');
INSERT INTO `cf_areas` VALUES ('511421', '仁寿县', '511400', '仁寿', '3', '028', '620500', '中国,四川省,眉山市,仁寿县', '104.134120000000', '29.995990000000', 'Renshou');
INSERT INTO `cf_areas` VALUES ('511423', '洪雅县', '511400', '洪雅', '3', '028', '620360', '中国,四川省,眉山市,洪雅县', '103.373130000000', '29.906610000000', 'Hongya');
INSERT INTO `cf_areas` VALUES ('511424', '丹棱县', '511400', '丹棱', '3', '028', '620200', '中国,四川省,眉山市,丹棱县', '103.513390000000', '30.015620000000', 'Danling');
INSERT INTO `cf_areas` VALUES ('511425', '青神县', '511400', '青神', '3', '028', '620460', '中国,四川省,眉山市,青神县', '103.847710000000', '29.832350000000', 'Qingshen');
INSERT INTO `cf_areas` VALUES ('511500', '宜宾市', '510000', '宜宾', '2', '0831', '644000', '中国,四川省,宜宾市', '104.630825000000', '28.760189000000', 'Yibin');
INSERT INTO `cf_areas` VALUES ('511502', '翠屏区', '511500', '翠屏', '3', '0831', '644000', '中国,四川省,宜宾市,翠屏区', '104.619780000000', '28.765660000000', 'Cuiping');
INSERT INTO `cf_areas` VALUES ('511503', '南溪区', '511500', '南溪', '3', '0831', '644100', '中国,四川省,宜宾市,南溪区', '104.981133000000', '28.839806000000', 'Nanxi');
INSERT INTO `cf_areas` VALUES ('511521', '宜宾县', '511500', '宜宾', '3', '0831', '644600', '中国,四川省,宜宾市,宜宾县', '104.533140000000', '28.689960000000', 'Yibin');
INSERT INTO `cf_areas` VALUES ('511523', '江安县', '511500', '江安', '3', '0831', '644200', '中国,四川省,宜宾市,江安县', '105.066830000000', '28.723850000000', 'Jiang\'an');
INSERT INTO `cf_areas` VALUES ('511524', '长宁县', '511500', '长宁', '3', '0831', '644300', '中国,四川省,宜宾市,长宁县', '104.925200000000', '28.577770000000', 'Changning');
INSERT INTO `cf_areas` VALUES ('511525', '高县', '511500', '高县', '3', '0831', '645150', '中国,四川省,宜宾市,高县', '104.517540000000', '28.436190000000', 'Gaoxian');
INSERT INTO `cf_areas` VALUES ('511526', '珙县', '511500', '珙县', '3', '0831', '644500', '中国,四川省,宜宾市,珙县', '104.713980000000', '28.445120000000', 'Gongxian');
INSERT INTO `cf_areas` VALUES ('511527', '筠连县', '511500', '筠连', '3', '0831', '645250', '中国,四川省,宜宾市,筠连县', '104.512170000000', '28.164950000000', 'Junlian');
INSERT INTO `cf_areas` VALUES ('511528', '兴文县', '511500', '兴文', '3', '0831', '644400', '中国,四川省,宜宾市,兴文县', '105.236750000000', '28.304400000000', 'Xingwen');
INSERT INTO `cf_areas` VALUES ('511529', '屏山县', '511500', '屏山', '3', '0831', '645350', '中国,四川省,宜宾市,屏山县', '104.162930000000', '28.643690000000', 'Pingshan');
INSERT INTO `cf_areas` VALUES ('511600', '广安市', '510000', '广安', '2', '0826', '638000', '中国,四川省,广安市', '106.633369000000', '30.456398000000', 'Guang\'an');
INSERT INTO `cf_areas` VALUES ('511602', '广安区', '511600', '广安', '3', '0826', '638000', '中国,四川省,广安市,广安区', '106.641630000000', '30.473890000000', 'Guang\'an');
INSERT INTO `cf_areas` VALUES ('511603', '前锋区', '511600', '前锋', '3', '0826', '638019', '中国,四川省,广安市,前锋区', '106.893537000000', '30.494572000000', 'Qianfeng');
INSERT INTO `cf_areas` VALUES ('511621', '岳池县', '511600', '岳池', '3', '0826', '638300', '中国,四川省,广安市,岳池县', '106.440790000000', '30.539180000000', 'Yuechi');
INSERT INTO `cf_areas` VALUES ('511622', '武胜县', '511600', '武胜', '3', '0826', '638400', '中国,四川省,广安市,武胜县', '106.295920000000', '30.349320000000', 'Wusheng');
INSERT INTO `cf_areas` VALUES ('511623', '邻水县', '511600', '邻水', '3', '0826', '638500', '中国,四川省,广安市,邻水县', '106.929680000000', '30.334490000000', 'Linshui');
INSERT INTO `cf_areas` VALUES ('511681', '华蓥市', '511600', '华蓥', '3', '0826', '638600', '中国,四川省,广安市,华蓥市', '106.784660000000', '30.390070000000', 'Huaying');
INSERT INTO `cf_areas` VALUES ('511700', '达州市', '510000', '达州', '2', '0818', '635000', '中国,四川省,达州市', '107.502262000000', '31.209484000000', 'Dazhou');
INSERT INTO `cf_areas` VALUES ('511702', '通川区', '511700', '通川', '3', '0818', '635000', '中国,四川省,达州市,通川区', '107.504560000000', '31.214690000000', 'Tongchuan');
INSERT INTO `cf_areas` VALUES ('511703', '达川区', '511700', '达川', '3', '0818', '635000', '中国,四川省,达州市,达川区', '107.502262000000', '31.209484000000', 'Dachuan');
INSERT INTO `cf_areas` VALUES ('511722', '宣汉县', '511700', '宣汉', '3', '0818', '636150', '中国,四川省,达州市,宣汉县', '107.727750000000', '31.355160000000', 'Xuanhan');
INSERT INTO `cf_areas` VALUES ('511723', '开江县', '511700', '开江', '3', '0818', '636250', '中国,四川省,达州市,开江县', '107.868890000000', '31.084100000000', 'Kaijiang');
INSERT INTO `cf_areas` VALUES ('511724', '大竹县', '511700', '大竹', '3', '0818', '635100', '中国,四川省,达州市,大竹县', '107.208550000000', '30.741470000000', 'Dazhu');
INSERT INTO `cf_areas` VALUES ('511725', '渠县', '511700', '渠县', '3', '0818', '635200', '中国,四川省,达州市,渠县', '106.973810000000', '30.837600000000', 'Quxian');
INSERT INTO `cf_areas` VALUES ('511781', '万源市', '511700', '万源', '3', '0818', '636350', '中国,四川省,达州市,万源市', '108.035980000000', '32.080910000000', 'Wanyuan');
INSERT INTO `cf_areas` VALUES ('511800', '雅安市', '510000', '雅安', '2', '0835', '625000', '中国,四川省,雅安市', '103.001033000000', '29.987722000000', 'Ya\'an');
INSERT INTO `cf_areas` VALUES ('511802', '雨城区', '511800', '雨城', '3', '0835', '625000', '中国,四川省,雅安市,雨城区', '103.033050000000', '30.005310000000', 'Yucheng');
INSERT INTO `cf_areas` VALUES ('511803', '名山区', '511800', '名山', '3', '0835', '625100', '中国,四川省,雅安市,名山区', '103.112214000000', '30.084718000000', 'Mingshan');
INSERT INTO `cf_areas` VALUES ('511822', '荥经县', '511800', '荥经', '3', '0835', '625200', '中国,四川省,雅安市,荥经县', '102.846520000000', '29.794020000000', 'Yingjing');
INSERT INTO `cf_areas` VALUES ('511823', '汉源县', '511800', '汉源', '3', '0835', '625300', '中国,四川省,雅安市,汉源县', '102.678400000000', '29.351680000000', 'Hanyuan');
INSERT INTO `cf_areas` VALUES ('511824', '石棉县', '511800', '石棉', '3', '0835', '625400', '中国,四川省,雅安市,石棉县', '102.359430000000', '29.227960000000', 'Shimian');
INSERT INTO `cf_areas` VALUES ('511825', '天全县', '511800', '天全', '3', '0835', '625500', '中国,四川省,雅安市,天全县', '102.759060000000', '30.067540000000', 'Tianquan');
INSERT INTO `cf_areas` VALUES ('511826', '芦山县', '511800', '芦山', '3', '0835', '625600', '中国,四川省,雅安市,芦山县', '102.927910000000', '30.143690000000', 'Lushan');
INSERT INTO `cf_areas` VALUES ('511827', '宝兴县', '511800', '宝兴', '3', '0835', '625700', '中国,四川省,雅安市,宝兴县', '102.815550000000', '30.368360000000', 'Baoxing');
INSERT INTO `cf_areas` VALUES ('511900', '巴中市', '510000', '巴中', '2', '0827', '636000', '中国,四川省,巴中市', '106.753669000000', '31.858809000000', 'Bazhong');
INSERT INTO `cf_areas` VALUES ('511902', '巴州区', '511900', '巴州', '3', '0827', '636001', '中国,四川省,巴中市,巴州区', '106.768890000000', '31.851250000000', 'Bazhou');
INSERT INTO `cf_areas` VALUES ('511903', '恩阳区', '511900', '恩阳', '3', '0827', '636064', '中国,四川省,巴中市,恩阳区', '106.753669000000', '31.858809000000', 'Enyang');
INSERT INTO `cf_areas` VALUES ('511921', '通江县', '511900', '通江', '3', '0827', '636700', '中国,四川省,巴中市,通江县', '107.243980000000', '31.912940000000', 'Tongjiang');
INSERT INTO `cf_areas` VALUES ('511922', '南江县', '511900', '南江', '3', '0827', '636600', '中国,四川省,巴中市,南江县', '106.841640000000', '32.353350000000', 'Nanjiang');
INSERT INTO `cf_areas` VALUES ('511923', '平昌县', '511900', '平昌', '3', '0827', '636400', '中国,四川省,巴中市,平昌县', '107.104240000000', '31.559400000000', 'Pingchang');
INSERT INTO `cf_areas` VALUES ('512000', '资阳市', '510000', '资阳', '2', '028', '641300', '中国,四川省,资阳市', '104.641917000000', '30.122211000000', 'Ziyang');
INSERT INTO `cf_areas` VALUES ('512002', '雁江区', '512000', '雁江', '3', '028', '641300', '中国,四川省,资阳市,雁江区', '104.652160000000', '30.115250000000', 'Yanjiang');
INSERT INTO `cf_areas` VALUES ('512021', '安岳县', '512000', '安岳', '3', '028', '642350', '中国,四川省,资阳市,安岳县', '105.336300000000', '30.097860000000', 'Anyue');
INSERT INTO `cf_areas` VALUES ('512022', '乐至县', '512000', '乐至', '3', '028', '641500', '中国,四川省,资阳市,乐至县', '105.032070000000', '30.272270000000', 'Lezhi');
INSERT INTO `cf_areas` VALUES ('512081', '简阳市', '512000', '简阳', '3', '028', '641400', '中国,四川省,资阳市,简阳市', '104.548640000000', '30.390400000000', 'Jianyang');
INSERT INTO `cf_areas` VALUES ('513200', '阿坝藏族羌族自治州', '510000', '阿坝', '2', '0837', '624000', '中国,四川省,阿坝藏族羌族自治州', '102.221374000000', '31.899792000000', 'Aba');
INSERT INTO `cf_areas` VALUES ('513221', '汶川县', '513200', '汶川', '3', '0837', '623000', '中国,四川省,阿坝藏族羌族自治州,汶川县', '103.590790000000', '31.473260000000', 'Wenchuan');
INSERT INTO `cf_areas` VALUES ('513222', '理县', '513200', '理县', '3', '0837', '623100', '中国,四川省,阿坝藏族羌族自治州,理县', '103.171750000000', '31.436030000000', 'Lixian');
INSERT INTO `cf_areas` VALUES ('513223', '茂县', '513200', '茂县', '3', '0837', '623200', '中国,四川省,阿坝藏族羌族自治州,茂县', '103.853720000000', '31.682000000000', 'Maoxian');
INSERT INTO `cf_areas` VALUES ('513224', '松潘县', '513200', '松潘', '3', '0837', '623300', '中国,四川省,阿坝藏族羌族自治州,松潘县', '103.599240000000', '32.638710000000', 'Songpan');
INSERT INTO `cf_areas` VALUES ('513225', '九寨沟县', '513200', '九寨沟', '3', '0837', '623400', '中国,四川省,阿坝藏族羌族自治州,九寨沟县', '104.236720000000', '33.263180000000', 'Jiuzhaigou');
INSERT INTO `cf_areas` VALUES ('513226', '金川县', '513200', '金川', '3', '0837', '624100', '中国,四川省,阿坝藏族羌族自治州,金川县', '102.065550000000', '31.476230000000', 'Jinchuan');
INSERT INTO `cf_areas` VALUES ('513227', '小金县', '513200', '小金', '3', '0837', '624200', '中国,四川省,阿坝藏族羌族自治州,小金县', '102.364990000000', '30.999340000000', 'Xiaojin');
INSERT INTO `cf_areas` VALUES ('513228', '黑水县', '513200', '黑水', '3', '0837', '623500', '中国,四川省,阿坝藏族羌族自治州,黑水县', '102.991760000000', '32.061840000000', 'Heishui');
INSERT INTO `cf_areas` VALUES ('513229', '马尔康县', '513200', '马尔康', '3', '0837', '624000', '中国,四川省,阿坝藏族羌族自治州,马尔康县', '102.206250000000', '31.905840000000', 'Maerkang');
INSERT INTO `cf_areas` VALUES ('513230', '壤塘县', '513200', '壤塘', '3', '0837', '624300', '中国,四川省,阿坝藏族羌族自治州,壤塘县', '100.978300000000', '32.265780000000', 'Rangtang');
INSERT INTO `cf_areas` VALUES ('513231', '阿坝县', '513200', '阿坝', '3', '0837', '624600', '中国,四川省,阿坝藏族羌族自治州,阿坝县', '101.706320000000', '32.903010000000', 'Aba');
INSERT INTO `cf_areas` VALUES ('513232', '若尔盖县', '513200', '若尔盖', '3', '0837', '624500', '中国,四川省,阿坝藏族羌族自治州,若尔盖县', '102.959800000000', '33.574320000000', 'Ruoergai');
INSERT INTO `cf_areas` VALUES ('513233', '红原县', '513200', '红原', '3', '0837', '624400', '中国,四川省,阿坝藏族羌族自治州,红原县', '102.545250000000', '32.789890000000', 'Hongyuan');
INSERT INTO `cf_areas` VALUES ('513300', '甘孜藏族自治州', '510000', '甘孜', '2', '0836', '626000', '中国,四川省,甘孜藏族自治州', '101.963815000000', '30.050663000000', 'Garze');
INSERT INTO `cf_areas` VALUES ('513321', '康定县', '513300', '康定', '3', '0836', '626000', '中国,四川省,甘孜藏族自治州,康定县', '101.964870000000', '30.055320000000', 'Kangding');
INSERT INTO `cf_areas` VALUES ('513322', '泸定县', '513300', '泸定', '3', '0836', '626100', '中国,四川省,甘孜藏族自治州,泸定县', '102.235070000000', '29.914750000000', 'Luding');
INSERT INTO `cf_areas` VALUES ('513323', '丹巴县', '513300', '丹巴', '3', '0836', '626300', '中国,四川省,甘孜藏族自治州,丹巴县', '101.884240000000', '30.876560000000', 'Danba');
INSERT INTO `cf_areas` VALUES ('513324', '九龙县', '513300', '九龙', '3', '0836', '626200', '中国,四川省,甘孜藏族自治州,九龙县', '101.508480000000', '29.000910000000', 'Jiulong');
INSERT INTO `cf_areas` VALUES ('513325', '雅江县', '513300', '雅江', '3', '0836', '627450', '中国,四川省,甘孜藏族自治州,雅江县', '101.014920000000', '30.032810000000', 'Yajiang');
INSERT INTO `cf_areas` VALUES ('513326', '道孚县', '513300', '道孚', '3', '0836', '626400', '中国,四川省,甘孜藏族自治州,道孚县', '101.125540000000', '30.980460000000', 'Daofu');
INSERT INTO `cf_areas` VALUES ('513327', '炉霍县', '513300', '炉霍', '3', '0836', '626500', '中国,四川省,甘孜藏族自治州,炉霍县', '100.676810000000', '31.391700000000', 'Luhuo');
INSERT INTO `cf_areas` VALUES ('513328', '甘孜县', '513300', '甘孜', '3', '0836', '626700', '中国,四川省,甘孜藏族自治州,甘孜县', '99.993070000000', '31.626720000000', 'Ganzi');
INSERT INTO `cf_areas` VALUES ('513329', '新龙县', '513300', '新龙', '3', '0836', '626800', '中国,四川省,甘孜藏族自治州,新龙县', '100.312500000000', '30.940670000000', 'Xinlong');
INSERT INTO `cf_areas` VALUES ('513330', '德格县', '513300', '德格', '3', '0836', '627250', '中国,四川省,甘孜藏族自治州,德格县', '98.580780000000', '31.806150000000', 'Dege');
INSERT INTO `cf_areas` VALUES ('513331', '白玉县', '513300', '白玉', '3', '0836', '627150', '中国,四川省,甘孜藏族自治州,白玉县', '98.825680000000', '31.209020000000', 'Baiyu');
INSERT INTO `cf_areas` VALUES ('513332', '石渠县', '513300', '石渠', '3', '0836', '627350', '中国,四川省,甘孜藏族自治州,石渠县', '98.101560000000', '32.978840000000', 'Shiqu');
INSERT INTO `cf_areas` VALUES ('513333', '色达县', '513300', '色达', '3', '0836', '626600', '中国,四川省,甘孜藏族自治州,色达县', '100.332240000000', '32.268390000000', 'Seda');
INSERT INTO `cf_areas` VALUES ('513334', '理塘县', '513300', '理塘', '3', '0836', '627550', '中国,四川省,甘孜藏族自治州,理塘县', '100.270050000000', '29.996740000000', 'Litang');
INSERT INTO `cf_areas` VALUES ('513335', '巴塘县', '513300', '巴塘', '3', '0836', '627650', '中国,四川省,甘孜藏族自治州,巴塘县', '99.104090000000', '30.004230000000', 'Batang');
INSERT INTO `cf_areas` VALUES ('513336', '乡城县', '513300', '乡城', '3', '0836', '627850', '中国,四川省,甘孜藏族自治州,乡城县', '99.799430000000', '28.935540000000', 'Xiangcheng');
INSERT INTO `cf_areas` VALUES ('513337', '稻城县', '513300', '稻城', '3', '0836', '627750', '中国,四川省,甘孜藏族自治州,稻城县', '100.298090000000', '29.037900000000', 'Daocheng');
INSERT INTO `cf_areas` VALUES ('513338', '得荣县', '513300', '得荣', '3', '0836', '627950', '中国,四川省,甘孜藏族自治州,得荣县', '99.286280000000', '28.712970000000', 'Derong');
INSERT INTO `cf_areas` VALUES ('513400', '凉山彝族自治州', '510000', '凉山', '2', '0834', '615000', '中国,四川省,凉山彝族自治州', '102.258746000000', '27.886762000000', 'Liangshan');
INSERT INTO `cf_areas` VALUES ('513401', '西昌市', '513400', '西昌', '3', '0835', '615000', '中国,四川省,凉山彝族自治州,西昌市', '102.264130000000', '27.895240000000', 'Xichang');
INSERT INTO `cf_areas` VALUES ('513422', '木里藏族自治县', '513400', '木里', '3', '0851', '615800', '中国,四川省,凉山彝族自治州,木里藏族自治县', '101.279600000000', '27.928750000000', 'Muli');
INSERT INTO `cf_areas` VALUES ('513423', '盐源县', '513400', '盐源', '3', '0836', '615700', '中国,四川省,凉山彝族自治州,盐源县', '101.509700000000', '27.421770000000', 'Yanyuan');
INSERT INTO `cf_areas` VALUES ('513424', '德昌县', '513400', '德昌', '3', '0837', '615500', '中国,四川省,凉山彝族自治州,德昌县', '102.180170000000', '27.404820000000', 'Dechang');
INSERT INTO `cf_areas` VALUES ('513425', '会理县', '513400', '会理', '3', '0838', '615100', '中国,四川省,凉山彝族自治州,会理县', '102.245390000000', '26.656270000000', 'Huili');
INSERT INTO `cf_areas` VALUES ('513426', '会东县', '513400', '会东', '3', '0839', '615200', '中国,四川省,凉山彝族自治州,会东县', '102.578150000000', '26.634290000000', 'Huidong');
INSERT INTO `cf_areas` VALUES ('513427', '宁南县', '513400', '宁南', '3', '0840', '615400', '中国,四川省,凉山彝族自治州,宁南县', '102.761160000000', '27.065670000000', 'Ningnan');
INSERT INTO `cf_areas` VALUES ('513428', '普格县', '513400', '普格', '3', '0841', '615300', '中国,四川省,凉山彝族自治州,普格县', '102.540550000000', '27.374850000000', 'Puge');
INSERT INTO `cf_areas` VALUES ('513429', '布拖县', '513400', '布拖', '3', '0842', '616350', '中国,四川省,凉山彝族自治州,布拖县', '102.812340000000', '27.707900000000', 'Butuo');
INSERT INTO `cf_areas` VALUES ('513430', '金阳县', '513400', '金阳', '3', '0843', '616250', '中国,四川省,凉山彝族自治州,金阳县', '103.247740000000', '27.696980000000', 'Jinyang');
INSERT INTO `cf_areas` VALUES ('513431', '昭觉县', '513400', '昭觉', '3', '0844', '616150', '中国,四川省,凉山彝族自治州,昭觉县', '102.846610000000', '28.011550000000', 'Zhaojue');
INSERT INTO `cf_areas` VALUES ('513432', '喜德县', '513400', '喜德', '3', '0845', '616750', '中国,四川省,凉山彝族自治州,喜德县', '102.413360000000', '28.307390000000', 'Xide');
INSERT INTO `cf_areas` VALUES ('513433', '冕宁县', '513400', '冕宁', '3', '0846', '615600', '中国,四川省,凉山彝族自治州,冕宁县', '102.171080000000', '28.551610000000', 'Mianning');
INSERT INTO `cf_areas` VALUES ('513434', '越西县', '513400', '越西', '3', '0847', '616650', '中国,四川省,凉山彝族自治州,越西县', '102.507900000000', '28.641330000000', 'Yuexi');
INSERT INTO `cf_areas` VALUES ('513435', '甘洛县', '513400', '甘洛', '3', '0848', '616850', '中国,四川省,凉山彝族自治州,甘洛县', '102.771540000000', '28.966240000000', 'Ganluo');
INSERT INTO `cf_areas` VALUES ('513436', '美姑县', '513400', '美姑', '3', '0849', '616450', '中国,四川省,凉山彝族自治州,美姑县', '103.131160000000', '28.325960000000', 'Meigu');
INSERT INTO `cf_areas` VALUES ('513437', '雷波县', '513400', '雷波', '3', '0850', '616550', '中国,四川省,凉山彝族自治州,雷波县', '103.572870000000', '28.264070000000', 'Leibo');
INSERT INTO `cf_areas` VALUES ('520000', '贵州省', '100000', '贵州', '1', '', '', '中国,贵州省', '106.713478000000', '26.578343000000', 'Guizhou');
INSERT INTO `cf_areas` VALUES ('520100', '贵阳市', '520000', '贵阳', '2', '0851', '550001', '中国,贵州省,贵阳市', '106.713478000000', '26.578343000000', 'Guiyang');
INSERT INTO `cf_areas` VALUES ('520102', '南明区', '520100', '南明', '3', '0851', '550001', '中国,贵州省,贵阳市,南明区', '106.714500000000', '26.568190000000', 'Nanming');
INSERT INTO `cf_areas` VALUES ('520103', '云岩区', '520100', '云岩', '3', '0851', '550001', '中国,贵州省,贵阳市,云岩区', '106.724850000000', '26.604840000000', 'Yunyan');
INSERT INTO `cf_areas` VALUES ('520111', '花溪区', '520100', '花溪', '3', '0851', '550025', '中国,贵州省,贵阳市,花溪区', '106.676880000000', '26.433430000000', 'Huaxi');
INSERT INTO `cf_areas` VALUES ('520112', '乌当区', '520100', '乌当', '3', '0851', '550018', '中国,贵州省,贵阳市,乌当区', '106.752100000000', '26.630200000000', 'Wudang');
INSERT INTO `cf_areas` VALUES ('520113', '白云区', '520100', '白云', '3', '0851', '550014', '中国,贵州省,贵阳市,白云区', '106.630880000000', '26.682840000000', 'Baiyun');
INSERT INTO `cf_areas` VALUES ('520115', '观山湖区', '520100', '观山湖', '3', '0851', '550009', '中国,贵州省,贵阳市,观山湖区', '106.625442000000', '26.618209000000', 'Guanshanhu');
INSERT INTO `cf_areas` VALUES ('520121', '开阳县', '520100', '开阳', '3', '0851', '550300', '中国,贵州省,贵阳市,开阳县', '106.969200000000', '27.055330000000', 'Kaiyang');
INSERT INTO `cf_areas` VALUES ('520122', '息烽县', '520100', '息烽', '3', '0851', '551100', '中国,贵州省,贵阳市,息烽县', '106.738000000000', '27.093460000000', 'Xifeng');
INSERT INTO `cf_areas` VALUES ('520123', '修文县', '520100', '修文', '3', '0851', '550200', '中国,贵州省,贵阳市,修文县', '106.594870000000', '26.837830000000', 'Xiuwen');
INSERT INTO `cf_areas` VALUES ('520181', '清镇市', '520100', '清镇', '3', '0851', '551400', '中国,贵州省,贵阳市,清镇市', '106.468620000000', '26.552610000000', 'Qingzhen');
INSERT INTO `cf_areas` VALUES ('520200', '六盘水市', '520000', '六盘水', '2', '0858', '553400', '中国,贵州省,六盘水市', '104.846743000000', '26.584643000000', 'Liupanshui');
INSERT INTO `cf_areas` VALUES ('520201', '钟山区', '520200', '钟山', '3', '0858', '553000', '中国,贵州省,六盘水市,钟山区', '104.878480000000', '26.576990000000', 'Zhongshan');
INSERT INTO `cf_areas` VALUES ('520203', '六枝特区', '520200', '六枝', '3', '0858', '553400', '中国,贵州省,六盘水市,六枝特区', '105.480620000000', '26.201170000000', 'Liuzhi');
INSERT INTO `cf_areas` VALUES ('520221', '水城县', '520200', '水城', '3', '0858', '553000', '中国,贵州省,六盘水市,水城县', '104.957640000000', '26.547850000000', 'Shuicheng');
INSERT INTO `cf_areas` VALUES ('520222', '盘县', '520200', '盘县', '3', '0858', '561601', '中国,贵州省,六盘水市,盘县', '104.470610000000', '25.713600000000', 'Panxian');
INSERT INTO `cf_areas` VALUES ('520300', '遵义市', '520000', '遵义', '2', '0852', '563000', '中国,贵州省,遵义市', '106.937265000000', '27.706626000000', 'Zunyi');
INSERT INTO `cf_areas` VALUES ('520302', '红花岗区', '520300', '红花岗', '3', '0852', '563000', '中国,贵州省,遵义市,红花岗区', '106.894040000000', '27.644710000000', 'Honghuagang');
INSERT INTO `cf_areas` VALUES ('520303', '汇川区', '520300', '汇川', '3', '0852', '563000', '中国,贵州省,遵义市,汇川区', '106.939300000000', '27.706250000000', 'Huichuan');
INSERT INTO `cf_areas` VALUES ('520321', '遵义县', '520300', '遵义', '3', '0852', '563100', '中国,贵州省,遵义市,遵义县', '106.833310000000', '27.537720000000', 'Zunyi');
INSERT INTO `cf_areas` VALUES ('520322', '桐梓县', '520300', '桐梓', '3', '0852', '563200', '中国,贵州省,遵义市,桐梓县', '106.825680000000', '28.138060000000', 'Tongzi');
INSERT INTO `cf_areas` VALUES ('520323', '绥阳县', '520300', '绥阳', '3', '0852', '563300', '中国,贵州省,遵义市,绥阳县', '107.190640000000', '27.947020000000', 'Suiyang');
INSERT INTO `cf_areas` VALUES ('520324', '正安县', '520300', '正安', '3', '0852', '563400', '中国,贵州省,遵义市,正安县', '107.443570000000', '28.551200000000', 'Zheng\'an');
INSERT INTO `cf_areas` VALUES ('520325', '道真仡佬族苗族自治县', '520300', '道真', '3', '0852', '563500', '中国,贵州省,遵义市,道真仡佬族苗族自治县', '107.611520000000', '28.864000000000', 'Daozhen');
INSERT INTO `cf_areas` VALUES ('520326', '务川仡佬族苗族自治县', '520300', '务川', '3', '0852', '564300', '中国,贵州省,遵义市,务川仡佬族苗族自治县', '107.889350000000', '28.522270000000', 'Wuchuan');
INSERT INTO `cf_areas` VALUES ('520327', '凤冈县', '520300', '凤冈', '3', '0852', '564200', '中国,贵州省,遵义市,凤冈县', '107.716820000000', '27.954610000000', 'Fenggang');
INSERT INTO `cf_areas` VALUES ('520328', '湄潭县', '520300', '湄潭', '3', '0852', '564100', '中国,贵州省,遵义市,湄潭县', '107.487790000000', '27.766760000000', 'Meitan');
INSERT INTO `cf_areas` VALUES ('520329', '余庆县', '520300', '余庆', '3', '0852', '564400', '中国,贵州省,遵义市,余庆县', '107.888210000000', '27.225320000000', 'Yuqing');
INSERT INTO `cf_areas` VALUES ('520330', '习水县', '520300', '习水', '3', '0852', '564600', '中国,贵州省,遵义市,习水县', '106.212670000000', '28.319760000000', 'Xishui');
INSERT INTO `cf_areas` VALUES ('520381', '赤水市', '520300', '赤水', '3', '0852', '564700', '中国,贵州省,遵义市,赤水市', '105.698450000000', '28.589210000000', 'Chishui');
INSERT INTO `cf_areas` VALUES ('520382', '仁怀市', '520300', '仁怀', '3', '0852', '564500', '中国,贵州省,遵义市,仁怀市', '106.401520000000', '27.792310000000', 'Renhuai');
INSERT INTO `cf_areas` VALUES ('520400', '安顺市', '520000', '安顺', '2', '0853', '561000', '中国,贵州省,安顺市', '105.932188000000', '26.245544000000', 'Anshun');
INSERT INTO `cf_areas` VALUES ('520402', '西秀区', '520400', '西秀', '3', '0853', '561000', '中国,贵州省,安顺市,西秀区', '105.965850000000', '26.244910000000', 'Xixiu');
INSERT INTO `cf_areas` VALUES ('520421', '平坝区', '520400', '平坝', '3', '0853', '561100', '中国,贵州省,安顺市,平坝区', '106.256830000000', '26.405430000000', 'Pingba');
INSERT INTO `cf_areas` VALUES ('520422', '普定县', '520400', '普定', '3', '0853', '562100', '中国,贵州省,安顺市,普定县', '105.742850000000', '26.301410000000', 'Puding');
INSERT INTO `cf_areas` VALUES ('520423', '镇宁布依族苗族自治县', '520400', '镇宁', '3', '0853', '561200', '中国,贵州省,安顺市,镇宁布依族苗族自治县', '105.765130000000', '26.055330000000', 'Zhenning');
INSERT INTO `cf_areas` VALUES ('520424', '关岭布依族苗族自治县', '520400', '关岭', '3', '0853', '561300', '中国,贵州省,安顺市,关岭布依族苗族自治县', '105.618830000000', '25.942480000000', 'Guanling');
INSERT INTO `cf_areas` VALUES ('520425', '紫云苗族布依族自治县', '520400', '紫云', '3', '0853', '550800', '中国,贵州省,安顺市,紫云苗族布依族自治县', '106.083640000000', '25.752580000000', 'Ziyun');
INSERT INTO `cf_areas` VALUES ('520500', '毕节市', '520000', '毕节', '2', '0857', '551700', '中国,贵州省,毕节市', '105.285010000000', '27.301693000000', 'Bijie');
INSERT INTO `cf_areas` VALUES ('520502', '七星关区', '520500', '七星关', '3', '0857', '551700', '中国,贵州省,毕节市,七星关区', '104.949700000000', '27.153556000000', 'Qixingguan');
INSERT INTO `cf_areas` VALUES ('520521', '大方县', '520500', '大方', '3', '0857', '551600', '中国,贵州省,毕节市,大方县', '105.609254000000', '27.143521000000', 'Dafang');
INSERT INTO `cf_areas` VALUES ('520522', '黔西县', '520500', '黔西', '3', '0857', '551500', '中国,贵州省,毕节市,黔西县', '106.038299000000', '27.024923000000', 'Qianxi');
INSERT INTO `cf_areas` VALUES ('520523', '金沙县', '520500', '金沙', '3', '0857', '551800', '中国,贵州省,毕节市,金沙县', '106.222103000000', '27.459693000000', 'Jinsha');
INSERT INTO `cf_areas` VALUES ('520524', '织金县', '520500', '织金', '3', '0857', '552100', '中国,贵州省,毕节市,织金县', '105.768997000000', '26.668497000000', 'Zhijin');
INSERT INTO `cf_areas` VALUES ('520525', '纳雍县', '520500', '纳雍', '3', '0857', '553300', '中国,贵州省,毕节市,纳雍县', '105.375322000000', '26.769875000000', 'Nayong');
INSERT INTO `cf_areas` VALUES ('520526', '威宁彝族回族苗族自治县', '520500', '威宁', '3', '0857', '553100', '中国,贵州省,毕节市,威宁彝族回族苗族自治县', '104.286523000000', '26.859099000000', 'Weining');
INSERT INTO `cf_areas` VALUES ('520527', '赫章县', '520500', '赫章', '3', '0857', '553200', '中国,贵州省,毕节市,赫章县', '104.726438000000', '27.119243000000', 'Hezhang');
INSERT INTO `cf_areas` VALUES ('520600', '铜仁市', '520000', '铜仁', '2', '0856', '554300', '中国,贵州省,铜仁市', '109.191555000000', '27.718346000000', 'Tongren');
INSERT INTO `cf_areas` VALUES ('520602', '碧江区', '520600', '碧江', '3', '0856', '554300', '中国,贵州省,铜仁市,碧江区', '109.191555000000', '27.718346000000', 'Bijiang');
INSERT INTO `cf_areas` VALUES ('520603', '万山区', '520600', '万山', '3', '0856', '554200', '中国,贵州省,铜仁市,万山区', '109.211990000000', '27.519030000000', 'Wanshan');
INSERT INTO `cf_areas` VALUES ('520621', '江口县', '520600', '江口', '3', '0856', '554400', '中国,贵州省,铜仁市,江口县', '108.848427000000', '27.691904000000', 'Jiangkou');
INSERT INTO `cf_areas` VALUES ('520622', '玉屏侗族自治县', '520600', '玉屏', '3', '0856', '554004', '中国,贵州省,铜仁市,玉屏侗族自治县', '108.917882000000', '27.238024000000', 'Yuping');
INSERT INTO `cf_areas` VALUES ('520623', '石阡县', '520600', '石阡', '3', '0856', '555100', '中国,贵州省,铜仁市,石阡县', '108.229854000000', '27.519386000000', 'Shiqian');
INSERT INTO `cf_areas` VALUES ('520624', '思南县', '520600', '思南', '3', '0856', '565100', '中国,贵州省,铜仁市,思南县', '108.255827000000', '27.941331000000', 'Sinan');
INSERT INTO `cf_areas` VALUES ('520625', '印江土家族苗族自治县', '520600', '印江', '3', '0856', '555200', '中国,贵州省,铜仁市,印江土家族苗族自治县', '108.405517000000', '27.997976000000', 'Yinjiang');
INSERT INTO `cf_areas` VALUES ('520626', '德江县', '520600', '德江', '3', '0856', '565200', '中国,贵州省,铜仁市,德江县', '108.117317000000', '28.260940000000', 'Dejiang');
INSERT INTO `cf_areas` VALUES ('520627', '沿河土家族自治县', '520600', '沿河', '3', '0856', '565300', '中国,贵州省,铜仁市,沿河土家族自治县', '108.495746000000', '28.560487000000', 'Yuanhe');
INSERT INTO `cf_areas` VALUES ('520628', '松桃苗族自治县', '520600', '松桃', '3', '0856', '554100', '中国,贵州省,铜仁市,松桃苗族自治县', '109.202627000000', '28.165419000000', 'Songtao');
INSERT INTO `cf_areas` VALUES ('522300', '黔西南布依族苗族自治州', '520000', '黔西南', '2', '0859', '562400', '中国,贵州省,黔西南布依族苗族自治州', '104.897971000000', '25.088120000000', 'Qianxinan');
INSERT INTO `cf_areas` VALUES ('522301', '兴义市 ', '522300', '兴义', '3', '0859', '562400', '中国,贵州省,黔西南布依族苗族自治州,兴义市 ', '104.895480000000', '25.092050000000', 'Xingyi');
INSERT INTO `cf_areas` VALUES ('522322', '兴仁县', '522300', '兴仁', '3', '0859', '562300', '中国,贵州省,黔西南布依族苗族自治州,兴仁县', '105.186520000000', '25.432820000000', 'Xingren');
INSERT INTO `cf_areas` VALUES ('522323', '普安县', '522300', '普安', '3', '0859', '561500', '中国,贵州省,黔西南布依族苗族自治州,普安县', '104.955290000000', '25.786030000000', 'Pu\'an');
INSERT INTO `cf_areas` VALUES ('522324', '晴隆县', '522300', '晴隆', '3', '0859', '561400', '中国,贵州省,黔西南布依族苗族自治州,晴隆县', '105.219200000000', '25.835220000000', 'Qinglong');
INSERT INTO `cf_areas` VALUES ('522325', '贞丰县', '522300', '贞丰', '3', '0859', '562200', '中国,贵州省,黔西南布依族苗族自治州,贞丰县', '105.654540000000', '25.384640000000', 'Zhenfeng');
INSERT INTO `cf_areas` VALUES ('522326', '望谟县', '522300', '望谟', '3', '0859', '552300', '中国,贵州省,黔西南布依族苗族自治州,望谟县', '106.099570000000', '25.178220000000', 'Wangmo');
INSERT INTO `cf_areas` VALUES ('522327', '册亨县', '522300', '册亨', '3', '0859', '552200', '中国,贵州省,黔西南布依族苗族自治州,册亨县', '105.812400000000', '24.983760000000', 'Ceheng');
INSERT INTO `cf_areas` VALUES ('522328', '安龙县', '522300', '安龙', '3', '0859', '552400', '中国,贵州省,黔西南布依族苗族自治州,安龙县', '105.442680000000', '25.098180000000', 'Anlong');
INSERT INTO `cf_areas` VALUES ('522600', '黔东南苗族侗族自治州', '520000', '黔东南', '2', '0855', '556000', '中国,贵州省,黔东南苗族侗族自治州', '107.977488000000', '26.583352000000', 'Qiandongnan');
INSERT INTO `cf_areas` VALUES ('522601', '凯里市', '522600', '凯里', '3', '0855', '556000', '中国,贵州省,黔东南苗族侗族自治州,凯里市', '107.981320000000', '26.566890000000', 'Kaili');
INSERT INTO `cf_areas` VALUES ('522622', '黄平县', '522600', '黄平', '3', '0855', '556100', '中国,贵州省,黔东南苗族侗族自治州,黄平县', '107.901790000000', '26.895730000000', 'Huangping');
INSERT INTO `cf_areas` VALUES ('522623', '施秉县', '522600', '施秉', '3', '0855', '556200', '中国,贵州省,黔东南苗族侗族自治州,施秉县', '108.125970000000', '27.034950000000', 'Shibing');
INSERT INTO `cf_areas` VALUES ('522624', '三穗县', '522600', '三穗', '3', '0855', '556500', '中国,贵州省,黔东南苗族侗族自治州,三穗县', '108.671320000000', '26.947650000000', 'Sansui');
INSERT INTO `cf_areas` VALUES ('522625', '镇远县', '522600', '镇远', '3', '0855', '557700', '中国,贵州省,黔东南苗族侗族自治州,镇远县', '108.427210000000', '27.049330000000', 'Zhenyuan');
INSERT INTO `cf_areas` VALUES ('522626', '岑巩县', '522600', '岑巩', '3', '0855', '557800', '中国,贵州省,黔东南苗族侗族自治州,岑巩县', '108.818840000000', '27.175390000000', 'Cengong');
INSERT INTO `cf_areas` VALUES ('522627', '天柱县', '522600', '天柱', '3', '0855', '556600', '中国,贵州省,黔东南苗族侗族自治州,天柱县', '109.207180000000', '26.907810000000', 'Tianzhu');
INSERT INTO `cf_areas` VALUES ('522628', '锦屏县', '522600', '锦屏', '3', '0855', '556700', '中国,贵州省,黔东南苗族侗族自治州,锦屏县', '109.199820000000', '26.676350000000', 'Jinping');
INSERT INTO `cf_areas` VALUES ('522629', '剑河县', '522600', '剑河', '3', '0855', '556400', '中国,贵州省,黔东南苗族侗族自治州,剑河县', '108.591300000000', '26.652500000000', 'Jianhe');
INSERT INTO `cf_areas` VALUES ('522630', '台江县', '522600', '台江', '3', '0855', '556300', '中国,贵州省,黔东南苗族侗族自治州,台江县', '108.318140000000', '26.669160000000', 'Taijiang');
INSERT INTO `cf_areas` VALUES ('522631', '黎平县', '522600', '黎平', '3', '0855', '557300', '中国,贵州省,黔东南苗族侗族自治州,黎平县', '109.136070000000', '26.231140000000', 'Liping');
INSERT INTO `cf_areas` VALUES ('522632', '榕江县', '522600', '榕江', '3', '0855', '557200', '中国,贵州省,黔东南苗族侗族自治州,榕江县', '108.520720000000', '25.924210000000', 'Rongjiang');
INSERT INTO `cf_areas` VALUES ('522633', '从江县', '522600', '从江', '3', '0855', '557400', '中国,贵州省,黔东南苗族侗族自治州,从江县', '108.905270000000', '25.754150000000', 'Congjiang');
INSERT INTO `cf_areas` VALUES ('522634', '雷山县', '522600', '雷山', '3', '0855', '557100', '中国,贵州省,黔东南苗族侗族自治州,雷山县', '108.077450000000', '26.383850000000', 'Leishan');
INSERT INTO `cf_areas` VALUES ('522635', '麻江县', '522600', '麻江', '3', '0855', '557600', '中国,贵州省,黔东南苗族侗族自治州,麻江县', '107.591550000000', '26.492350000000', 'Majiang');
INSERT INTO `cf_areas` VALUES ('522636', '丹寨县', '522600', '丹寨', '3', '0855', '557500', '中国,贵州省,黔东南苗族侗族自治州,丹寨县', '107.797180000000', '26.198160000000', 'Danzhai');
INSERT INTO `cf_areas` VALUES ('522700', '黔南布依族苗族自治州', '520000', '黔南', '2', '0854', '558000', '中国,贵州省,黔南布依族苗族自治州', '107.517156000000', '26.258219000000', 'Qiannan');
INSERT INTO `cf_areas` VALUES ('522701', '都匀市', '522700', '都匀', '3', '0854', '558000', '中国,贵州省,黔南布依族苗族自治州,都匀市', '107.518720000000', '26.259400000000', 'Duyun');
INSERT INTO `cf_areas` VALUES ('522702', '福泉市', '522700', '福泉', '3', '0854', '550500', '中国,贵州省,黔南布依族苗族自治州,福泉市', '107.517150000000', '26.679890000000', 'Fuquan');
INSERT INTO `cf_areas` VALUES ('522722', '荔波县', '522700', '荔波', '3', '0854', '558400', '中国,贵州省,黔南布依族苗族自治州,荔波县', '107.885920000000', '25.413900000000', 'Libo');
INSERT INTO `cf_areas` VALUES ('522723', '贵定县', '522700', '贵定', '3', '0854', '551300', '中国,贵州省,黔南布依族苗族自治州,贵定县', '107.236540000000', '26.578120000000', 'Guiding');
INSERT INTO `cf_areas` VALUES ('522725', '瓮安县', '522700', '瓮安', '3', '0854', '550400', '中国,贵州省,黔南布依族苗族自治州,瓮安县', '107.475700000000', '27.068130000000', 'Weng\'an');
INSERT INTO `cf_areas` VALUES ('522726', '独山县', '522700', '独山', '3', '0854', '558200', '中国,贵州省,黔南布依族苗族自治州,独山县', '107.541010000000', '25.824500000000', 'Dushan');
INSERT INTO `cf_areas` VALUES ('522727', '平塘县', '522700', '平塘', '3', '0854', '558300', '中国,贵州省,黔南布依族苗族自治州,平塘县', '107.324280000000', '25.832940000000', 'Pingtang');
INSERT INTO `cf_areas` VALUES ('522728', '罗甸县', '522700', '罗甸', '3', '0854', '550100', '中国,贵州省,黔南布依族苗族自治州,罗甸县', '106.751860000000', '25.425860000000', 'Luodian');
INSERT INTO `cf_areas` VALUES ('522729', '长顺县', '522700', '长顺', '3', '0854', '550700', '中国,贵州省,黔南布依族苗族自治州,长顺县', '106.452170000000', '26.022990000000', 'Changshun');
INSERT INTO `cf_areas` VALUES ('522730', '龙里县', '522700', '龙里', '3', '0854', '551200', '中国,贵州省,黔南布依族苗族自治州,龙里县', '106.976620000000', '26.450760000000', 'Longli');
INSERT INTO `cf_areas` VALUES ('522731', '惠水县', '522700', '惠水', '3', '0854', '550600', '中国,贵州省,黔南布依族苗族自治州,惠水县', '106.659110000000', '26.133890000000', 'Huishui');
INSERT INTO `cf_areas` VALUES ('522732', '三都水族自治县', '522700', '三都', '3', '0854', '558100', '中国,贵州省,黔南布依族苗族自治州,三都水族自治县', '107.874640000000', '25.985620000000', 'Sandu');
INSERT INTO `cf_areas` VALUES ('530000', '云南省', '100000', '云南', '1', '', '', '中国,云南省', '102.712251000000', '25.040609000000', 'Yunnan');
INSERT INTO `cf_areas` VALUES ('530100', '昆明市', '530000', '昆明', '2', '0871', '650500', '中国,云南省,昆明市', '102.712251000000', '25.040609000000', 'Kunming');
INSERT INTO `cf_areas` VALUES ('530102', '五华区', '530100', '五华', '3', '0871', '650021', '中国,云南省,昆明市,五华区', '102.707860000000', '25.035210000000', 'Wuhua');
INSERT INTO `cf_areas` VALUES ('530103', '盘龙区', '530100', '盘龙', '3', '0871', '650051', '中国,云南省,昆明市,盘龙区', '102.719940000000', '25.040530000000', 'Panlong');
INSERT INTO `cf_areas` VALUES ('530111', '官渡区', '530100', '官渡', '3', '0871', '650200', '中国,云南省,昆明市,官渡区', '102.743620000000', '25.014970000000', 'Guandu');
INSERT INTO `cf_areas` VALUES ('530112', '西山区', '530100', '西山', '3', '0871', '650118', '中国,云南省,昆明市,西山区', '102.664640000000', '25.037960000000', 'Xishan');
INSERT INTO `cf_areas` VALUES ('530113', '东川区', '530100', '东川', '3', '0871', '654100', '中国,云南省,昆明市,东川区', '103.188320000000', '26.083000000000', 'Dongchuan');
INSERT INTO `cf_areas` VALUES ('530114', '呈贡区', '530100', '呈贡', '3', '0871', '650500', '中国,云南省,昆明市,呈贡区', '102.801382000000', '24.889275000000', 'Chenggong');
INSERT INTO `cf_areas` VALUES ('530122', '晋宁县', '530100', '晋宁', '3', '0871', '650600', '中国,云南省,昆明市,晋宁县', '102.593930000000', '24.666500000000', 'Jinning');
INSERT INTO `cf_areas` VALUES ('530124', '富民县', '530100', '富民', '3', '0871', '650400', '中国,云南省,昆明市,富民县', '102.498500000000', '25.221190000000', 'Fumin');
INSERT INTO `cf_areas` VALUES ('530125', '宜良县', '530100', '宜良', '3', '0871', '652100', '中国,云南省,昆明市,宜良县', '103.141170000000', '24.917050000000', 'Yiliang');
INSERT INTO `cf_areas` VALUES ('530126', '石林彝族自治县', '530100', '石林', '3', '0871', '652200', '中国,云南省,昆明市,石林彝族自治县', '103.271480000000', '24.758970000000', 'Shilin');
INSERT INTO `cf_areas` VALUES ('530127', '嵩明县', '530100', '嵩明', '3', '0871', '651700', '中国,云南省,昆明市,嵩明县', '103.037290000000', '25.339860000000', 'Songming');
INSERT INTO `cf_areas` VALUES ('530128', '禄劝彝族苗族自治县', '530100', '禄劝', '3', '0871', '651500', '中国,云南省,昆明市,禄劝彝族苗族自治县', '102.467100000000', '25.553870000000', 'Luquan');
INSERT INTO `cf_areas` VALUES ('530129', '寻甸回族彝族自治县 ', '530100', '寻甸', '3', '0871', '655200', '中国,云南省,昆明市,寻甸回族彝族自治县 ', '103.255700000000', '25.559610000000', 'Xundian');
INSERT INTO `cf_areas` VALUES ('530181', '安宁市', '530100', '安宁', '3', '0871', '650300', '中国,云南省,昆明市,安宁市', '102.469720000000', '24.916520000000', 'Anning');
INSERT INTO `cf_areas` VALUES ('530300', '曲靖市', '530000', '曲靖', '2', '0874', '655000', '中国,云南省,曲靖市', '103.797851000000', '25.501557000000', 'Qujing');
INSERT INTO `cf_areas` VALUES ('530302', '麒麟区', '530300', '麒麟', '3', '0874', '655000', '中国,云南省,曲靖市,麒麟区', '103.805040000000', '25.495150000000', 'Qilin');
INSERT INTO `cf_areas` VALUES ('530321', '马龙县', '530300', '马龙', '3', '0874', '655100', '中国,云南省,曲靖市,马龙县', '103.578730000000', '25.425210000000', 'Malong');
INSERT INTO `cf_areas` VALUES ('530322', '陆良县', '530300', '陆良', '3', '0874', '655600', '中国,云南省,曲靖市,陆良县', '103.666500000000', '25.023350000000', 'Luliang');
INSERT INTO `cf_areas` VALUES ('530323', '师宗县', '530300', '师宗', '3', '0874', '655700', '中国,云南省,曲靖市,师宗县', '103.990840000000', '24.828220000000', 'Shizong');
INSERT INTO `cf_areas` VALUES ('530324', '罗平县', '530300', '罗平', '3', '0874', '655800', '中国,云南省,曲靖市,罗平县', '104.308590000000', '24.884440000000', 'Luoping');
INSERT INTO `cf_areas` VALUES ('530325', '富源县', '530300', '富源', '3', '0874', '655500', '中国,云南省,曲靖市,富源县', '104.253870000000', '25.665870000000', 'Fuyuan');
INSERT INTO `cf_areas` VALUES ('530326', '会泽县', '530300', '会泽', '3', '0874', '654200', '中国,云南省,曲靖市,会泽县', '103.300170000000', '26.410760000000', 'Huize');
INSERT INTO `cf_areas` VALUES ('530328', '沾益县', '530300', '沾益', '3', '0874', '655331', '中国,云南省,曲靖市,沾益县', '103.821350000000', '25.607150000000', 'Zhanyi');
INSERT INTO `cf_areas` VALUES ('530381', '宣威市', '530300', '宣威', '3', '0874', '655400', '中国,云南省,曲靖市,宣威市', '104.104090000000', '26.217300000000', 'Xuanwei');
INSERT INTO `cf_areas` VALUES ('530400', '玉溪市', '530000', '玉溪', '2', '0877', '653100', '中国,云南省,玉溪市', '102.543907000000', '24.350461000000', 'Yuxi');
INSERT INTO `cf_areas` VALUES ('530402', '红塔区', '530400', '红塔', '3', '0877', '653100', '中国,云南省,玉溪市,红塔区', '102.544900000000', '24.354110000000', 'Hongta');
INSERT INTO `cf_areas` VALUES ('530421', '江川县', '530400', '江川', '3', '0877', '652600', '中国,云南省,玉溪市,江川县', '102.754120000000', '24.288630000000', 'Jiangchuan');
INSERT INTO `cf_areas` VALUES ('530422', '澄江县', '530400', '澄江', '3', '0877', '652500', '中国,云南省,玉溪市,澄江县', '102.908170000000', '24.673760000000', 'Chengjiang');
INSERT INTO `cf_areas` VALUES ('530423', '通海县', '530400', '通海', '3', '0877', '652700', '中国,云南省,玉溪市,通海县', '102.766410000000', '24.113620000000', 'Tonghai');
INSERT INTO `cf_areas` VALUES ('530424', '华宁县', '530400', '华宁', '3', '0877', '652800', '中国,云南省,玉溪市,华宁县', '102.928310000000', '24.192600000000', 'Huaning');
INSERT INTO `cf_areas` VALUES ('530425', '易门县', '530400', '易门', '3', '0877', '651100', '中国,云南省,玉溪市,易门县', '102.163540000000', '24.671220000000', 'Yimen');
INSERT INTO `cf_areas` VALUES ('530426', '峨山彝族自治县', '530400', '峨山', '3', '0877', '653200', '中国,云南省,玉溪市,峨山彝族自治县', '102.405760000000', '24.169040000000', 'Eshan');
INSERT INTO `cf_areas` VALUES ('530427', '新平彝族傣族自治县', '530400', '新平', '3', '0877', '653400', '中国,云南省,玉溪市,新平彝族傣族自治县', '101.988950000000', '24.068860000000', 'Xinping');
INSERT INTO `cf_areas` VALUES ('530428', '元江哈尼族彝族傣族自治县', '530400', '元江', '3', '0877', '653300', '中国,云南省,玉溪市,元江哈尼族彝族傣族自治县', '101.998120000000', '23.596550000000', 'Yuanjiang');
INSERT INTO `cf_areas` VALUES ('530500', '保山市', '530000', '保山', '2', '0875', '678000', '中国,云南省,保山市', '99.167133000000', '25.111802000000', 'Baoshan');
INSERT INTO `cf_areas` VALUES ('530502', '隆阳区', '530500', '隆阳', '3', '0875', '678000', '中国,云南省,保山市,隆阳区', '99.163340000000', '25.111630000000', 'Longyang');
INSERT INTO `cf_areas` VALUES ('530521', '施甸县', '530500', '施甸', '3', '0875', '678200', '中国,云南省,保山市,施甸县', '99.187680000000', '24.724180000000', 'Shidian');
INSERT INTO `cf_areas` VALUES ('530522', '腾冲县', '530500', '腾冲', '3', '0875', '679100', '中国,云南省,保山市,腾冲县', '98.494140000000', '25.025390000000', 'Tengchong');
INSERT INTO `cf_areas` VALUES ('530523', '龙陵县', '530500', '龙陵', '3', '0875', '678300', '中国,云南省,保山市,龙陵县', '98.690240000000', '24.587460000000', 'Longling');
INSERT INTO `cf_areas` VALUES ('530524', '昌宁县', '530500', '昌宁', '3', '0875', '678100', '中国,云南省,保山市,昌宁县', '99.603600000000', '24.827630000000', 'Changning');
INSERT INTO `cf_areas` VALUES ('530600', '昭通市', '530000', '昭通', '2', '0870', '657000', '中国,云南省,昭通市', '103.717216000000', '27.336999000000', 'Zhaotong');
INSERT INTO `cf_areas` VALUES ('530602', '昭阳区', '530600', '昭阳', '3', '0870', '657000', '中国,云南省,昭通市,昭阳区', '103.706540000000', '27.319980000000', 'Zhaoyang');
INSERT INTO `cf_areas` VALUES ('530621', '鲁甸县', '530600', '鲁甸', '3', '0870', '657100', '中国,云南省,昭通市,鲁甸县', '103.547210000000', '27.192380000000', 'Ludian');
INSERT INTO `cf_areas` VALUES ('530622', '巧家县', '530600', '巧家', '3', '0870', '654600', '中国,云南省,昭通市,巧家县', '102.924160000000', '26.912370000000', 'Qiaojia');
INSERT INTO `cf_areas` VALUES ('530623', '盐津县', '530600', '盐津', '3', '0870', '657500', '中国,云南省,昭通市,盐津县', '104.234610000000', '28.108560000000', 'Yanjin');
INSERT INTO `cf_areas` VALUES ('530624', '大关县', '530600', '大关', '3', '0870', '657400', '中国,云南省,昭通市,大关县', '103.892540000000', '27.748800000000', 'Daguan');
INSERT INTO `cf_areas` VALUES ('530625', '永善县', '530600', '永善', '3', '0870', '657300', '中国,云南省,昭通市,永善县', '103.635040000000', '28.227900000000', 'Yongshan');
INSERT INTO `cf_areas` VALUES ('530626', '绥江县', '530600', '绥江', '3', '0870', '657700', '中国,云南省,昭通市,绥江县', '103.949370000000', '28.596610000000', 'Suijiang');
INSERT INTO `cf_areas` VALUES ('530627', '镇雄县', '530600', '镇雄', '3', '0870', '657200', '中国,云南省,昭通市,镇雄县', '104.872580000000', '27.439810000000', 'Zhenxiong');
INSERT INTO `cf_areas` VALUES ('530628', '彝良县', '530600', '彝良', '3', '0870', '657600', '中国,云南省,昭通市,彝良县', '104.049830000000', '27.628090000000', 'Yiliang');
INSERT INTO `cf_areas` VALUES ('530629', '威信县', '530600', '威信', '3', '0870', '657900', '中国,云南省,昭通市,威信县', '105.047540000000', '27.840650000000', 'Weixin');
INSERT INTO `cf_areas` VALUES ('530630', '水富县', '530600', '水富', '3', '0870', '657800', '中国,云南省,昭通市,水富县', '104.415800000000', '28.629860000000', 'Shuifu');
INSERT INTO `cf_areas` VALUES ('530700', '丽江市', '530000', '丽江', '2', '0888', '674100', '中国,云南省,丽江市', '100.233026000000', '26.872108000000', 'Lijiang');
INSERT INTO `cf_areas` VALUES ('530702', '古城区', '530700', '古城', '3', '0888', '674100', '中国,云南省,丽江市,古城区', '100.225700000000', '26.876970000000', 'Gucheng');
INSERT INTO `cf_areas` VALUES ('530721', '玉龙纳西族自治县', '530700', '玉龙', '3', '0888', '674100', '中国,云南省,丽江市,玉龙纳西族自治县', '100.236900000000', '26.821490000000', 'Yulong');
INSERT INTO `cf_areas` VALUES ('530722', '永胜县', '530700', '永胜', '3', '0888', '674200', '中国,云南省,丽江市,永胜县', '100.746670000000', '26.685910000000', 'Yongsheng');
INSERT INTO `cf_areas` VALUES ('530723', '华坪县', '530700', '华坪', '3', '0888', '674800', '中国,云南省,丽江市,华坪县', '101.265620000000', '26.629670000000', 'Huaping');
INSERT INTO `cf_areas` VALUES ('530724', '宁蒗彝族自治县', '530700', '宁蒗', '3', '0888', '674300', '中国,云南省,丽江市,宁蒗彝族自治县', '100.850700000000', '27.281790000000', 'Ninglang');
INSERT INTO `cf_areas` VALUES ('530800', '普洱市', '530000', '普洱', '2', '0879', '665000', '中国,云南省,普洱市', '100.972344000000', '22.777321000000', 'Pu\'er');
INSERT INTO `cf_areas` VALUES ('530802', '思茅区', '530800', '思茅', '3', '0879', '665000', '中国,云南省,普洱市,思茅区', '100.977160000000', '22.786910000000', 'Simao');
INSERT INTO `cf_areas` VALUES ('530821', '宁洱哈尼族彝族自治县', '530800', '宁洱', '3', '0879', '665100', '中国,云南省,普洱市,宁洱哈尼族彝族自治县', '101.046530000000', '23.063410000000', 'Ninger');
INSERT INTO `cf_areas` VALUES ('530822', '墨江哈尼族自治县', '530800', '墨江', '3', '0879', '654800', '中国,云南省,普洱市,墨江哈尼族自治县', '101.691710000000', '23.432140000000', 'Mojiang');
INSERT INTO `cf_areas` VALUES ('530823', '景东彝族自治县', '530800', '景东', '3', '0879', '676200', '中国,云南省,普洱市,景东彝族自治县', '100.835990000000', '24.447910000000', 'Jingdong');
INSERT INTO `cf_areas` VALUES ('530824', '景谷傣族彝族自治县', '530800', '景谷', '3', '0879', '666400', '中国,云南省,普洱市,景谷傣族彝族自治县', '100.702510000000', '23.497050000000', 'Jinggu');
INSERT INTO `cf_areas` VALUES ('530825', '镇沅彝族哈尼族拉祜族自治县', '530800', '镇沅', '3', '0879', '666500', '中国,云南省,普洱市,镇沅彝族哈尼族拉祜族自治县', '101.106750000000', '24.005570000000', 'Zhenyuan');
INSERT INTO `cf_areas` VALUES ('530826', '江城哈尼族彝族自治县', '530800', '江城', '3', '0879', '665900', '中国,云南省,普洱市,江城哈尼族彝族自治县', '101.857880000000', '22.584240000000', 'Jiangcheng');
INSERT INTO `cf_areas` VALUES ('530827', '孟连傣族拉祜族佤族自治县', '530800', '孟连', '3', '0879', '665800', '中国,云南省,普洱市,孟连傣族拉祜族佤族自治县', '99.584240000000', '22.329220000000', 'Menglian');
INSERT INTO `cf_areas` VALUES ('530828', '澜沧拉祜族自治县', '530800', '澜沧', '3', '0879', '665600', '中国,云南省,普洱市,澜沧拉祜族自治县', '99.935910000000', '22.554740000000', 'Lancang');
INSERT INTO `cf_areas` VALUES ('530829', '西盟佤族自治县', '530800', '西盟', '3', '0879', '665700', '中国,云南省,普洱市,西盟佤族自治县', '99.598690000000', '22.647740000000', 'Ximeng');
INSERT INTO `cf_areas` VALUES ('530900', '临沧市', '530000', '临沧', '2', '0883', '677000', '中国,云南省,临沧市', '100.086970000000', '23.886567000000', 'Lincang');
INSERT INTO `cf_areas` VALUES ('530902', '临翔区', '530900', '临翔', '3', '0883', '677000', '中国,云南省,临沧市,临翔区', '100.082420000000', '23.894970000000', 'Linxiang');
INSERT INTO `cf_areas` VALUES ('530921', '凤庆县', '530900', '凤庆', '3', '0883', '675900', '中国,云南省,临沧市,凤庆县', '99.928370000000', '24.580340000000', 'Fengqing');
INSERT INTO `cf_areas` VALUES ('530922', '云县', '530900', '云县', '3', '0883', '675800', '中国,云南省,临沧市,云县', '100.128080000000', '24.446750000000', 'Yunxian');
INSERT INTO `cf_areas` VALUES ('530923', '永德县', '530900', '永德', '3', '0883', '677600', '中国,云南省,临沧市,永德县', '99.253260000000', '24.027600000000', 'Yongde');
INSERT INTO `cf_areas` VALUES ('530924', '镇康县', '530900', '镇康', '3', '0883', '677704', '中国,云南省,临沧市,镇康县', '98.825500000000', '23.762410000000', 'Zhenkang');
INSERT INTO `cf_areas` VALUES ('530925', '双江拉祜族佤族布朗族傣族自治县', '530900', '双江', '3', '0883', '677300', '中国,云南省,临沧市,双江拉祜族佤族布朗族傣族自治县', '99.827690000000', '23.473490000000', 'Shuangjiang');
INSERT INTO `cf_areas` VALUES ('530926', '耿马傣族佤族自治县', '530900', '耿马', '3', '0883', '677500', '中国,云南省,临沧市,耿马傣族佤族自治县', '99.397850000000', '23.537760000000', 'Gengma');
INSERT INTO `cf_areas` VALUES ('530927', '沧源佤族自治县', '530900', '沧源', '3', '0883', '677400', '中国,云南省,临沧市,沧源佤族自治县', '99.245450000000', '23.148210000000', 'Cangyuan');
INSERT INTO `cf_areas` VALUES ('532300', '楚雄彝族自治州', '530000', '楚雄', '2', '0878', '675000', '中国,云南省,楚雄彝族自治州', '101.546046000000', '25.041988000000', 'Chuxiong');
INSERT INTO `cf_areas` VALUES ('532301', '楚雄市', '532300', '楚雄', '3', '0878', '675000', '中国,云南省,楚雄彝族自治州,楚雄市', '101.546150000000', '25.032900000000', 'Chuxiong');
INSERT INTO `cf_areas` VALUES ('532322', '双柏县', '532300', '双柏', '3', '0878', '675100', '中国,云南省,楚雄彝族自治州,双柏县', '101.642050000000', '24.688820000000', 'Shuangbai');
INSERT INTO `cf_areas` VALUES ('532323', '牟定县', '532300', '牟定', '3', '0878', '675500', '中国,云南省,楚雄彝族自治州,牟定县', '101.540000000000', '25.315510000000', 'Mouding');
INSERT INTO `cf_areas` VALUES ('532324', '南华县', '532300', '南华', '3', '0878', '675200', '中国,云南省,楚雄彝族自治州,南华县', '101.273130000000', '25.192930000000', 'Nanhua');
INSERT INTO `cf_areas` VALUES ('532325', '姚安县', '532300', '姚安', '3', '0878', '675300', '中国,云南省,楚雄彝族自治州,姚安县', '101.242790000000', '25.504670000000', 'Yao\'an');
INSERT INTO `cf_areas` VALUES ('532326', '大姚县', '532300', '大姚', '3', '0878', '675400', '中国,云南省,楚雄彝族自治州,大姚县', '101.323970000000', '25.722180000000', 'Dayao');
INSERT INTO `cf_areas` VALUES ('532327', '永仁县', '532300', '永仁', '3', '0878', '651400', '中国,云南省,楚雄彝族自治州,永仁县', '101.671600000000', '26.057940000000', 'Yongren');
INSERT INTO `cf_areas` VALUES ('532328', '元谋县', '532300', '元谋', '3', '0878', '651300', '中国,云南省,楚雄彝族自治州,元谋县', '101.877280000000', '25.704380000000', 'Yuanmou');
INSERT INTO `cf_areas` VALUES ('532329', '武定县', '532300', '武定', '3', '0878', '651600', '中国,云南省,楚雄彝族自治州,武定县', '102.403800000000', '25.529500000000', 'Wuding');
INSERT INTO `cf_areas` VALUES ('532331', '禄丰县', '532300', '禄丰', '3', '0878', '651200', '中国,云南省,楚雄彝族自治州,禄丰县', '102.077970000000', '25.148150000000', 'Lufeng');
INSERT INTO `cf_areas` VALUES ('532500', '红河哈尼族彝族自治州', '530000', '红河', '2', '0873', '661400', '中国,云南省,红河哈尼族彝族自治州', '103.384182000000', '23.366775000000', 'Honghe');
INSERT INTO `cf_areas` VALUES ('532501', '个旧市', '532500', '个旧', '3', '0873', '661000', '中国,云南省,红河哈尼族彝族自治州,个旧市', '103.159660000000', '23.358940000000', 'Gejiu');
INSERT INTO `cf_areas` VALUES ('532502', '开远市', '532500', '开远', '3', '0873', '661600', '中国,云南省,红河哈尼族彝族自治州,开远市', '103.269860000000', '23.710120000000', 'Kaiyuan');
INSERT INTO `cf_areas` VALUES ('532503', '蒙自市', '532500', '蒙自', '3', '0873', '661101', '中国,云南省,红河哈尼族彝族自治州,蒙自市', '103.385005000000', '23.366843000000', 'Mengzi');
INSERT INTO `cf_areas` VALUES ('532504', '弥勒市', '532500', '弥勒', '3', '0873', '652300', '中国,云南省,红河哈尼族彝族自治州,弥勒市', '103.436988000000', '24.408370000000', 'Mile ');
INSERT INTO `cf_areas` VALUES ('532523', '屏边苗族自治县', '532500', '屏边', '3', '0873', '661200', '中国,云南省,红河哈尼族彝族自治州,屏边苗族自治县', '103.685540000000', '22.984250000000', 'Pingbian');
INSERT INTO `cf_areas` VALUES ('532524', '建水县', '532500', '建水', '3', '0873', '654300', '中国,云南省,红河哈尼族彝族自治州,建水县', '102.826560000000', '23.634720000000', 'Jianshui');
INSERT INTO `cf_areas` VALUES ('532525', '石屏县', '532500', '石屏', '3', '0873', '662200', '中国,云南省,红河哈尼族彝族自治州,石屏县', '102.494080000000', '23.714410000000', 'Shiping');
INSERT INTO `cf_areas` VALUES ('532527', '泸西县', '532500', '泸西', '3', '0873', '652400', '中国,云南省,红河哈尼族彝族自治州,泸西县', '103.763730000000', '24.528540000000', 'Luxi');
INSERT INTO `cf_areas` VALUES ('532528', '元阳县', '532500', '元阳', '3', '0873', '662400', '中国,云南省,红河哈尼族彝族自治州,元阳县', '102.832610000000', '23.222810000000', 'Yuanyang');
INSERT INTO `cf_areas` VALUES ('532529', '红河县', '532500', '红河县', '3', '0873', '654400', '中国,云南省,红河哈尼族彝族自治州,红河县', '102.420590000000', '23.367670000000', 'Honghexian');
INSERT INTO `cf_areas` VALUES ('532530', '金平苗族瑶族傣族自治县', '532500', '金平', '3', '0873', '661500', '中国,云南省,红河哈尼族彝族自治州,金平苗族瑶族傣族自治县', '103.226510000000', '22.779590000000', 'Jinping');
INSERT INTO `cf_areas` VALUES ('532531', '绿春县', '532500', '绿春', '3', '0873', '662500', '中国,云南省,红河哈尼族彝族自治州,绿春县', '102.396720000000', '22.993710000000', 'Lvchun');
INSERT INTO `cf_areas` VALUES ('532532', '河口瑶族自治县', '532500', '河口', '3', '0873', '661300', '中国,云南省,红河哈尼族彝族自治州,河口瑶族自治县', '103.939360000000', '22.529290000000', 'Hekou');
INSERT INTO `cf_areas` VALUES ('532600', '文山壮族苗族自治州', '530000', '文山', '2', '0876', '663000', '中国,云南省,文山壮族苗族自治州', '104.244010000000', '23.369510000000', 'Wenshan');
INSERT INTO `cf_areas` VALUES ('532601', '文山市', '532600', '文山', '3', '0876', '663000', '中国,云南省,文山壮族苗族自治州,文山市', '104.244277000000', '23.369216000000', 'Wenshan');
INSERT INTO `cf_areas` VALUES ('532622', '砚山县', '532600', '砚山', '3', '0876', '663100', '中国,云南省,文山壮族苗族自治州,砚山县', '104.333060000000', '23.607230000000', 'Yanshan');
INSERT INTO `cf_areas` VALUES ('532623', '西畴县', '532600', '西畴', '3', '0876', '663500', '中国,云南省,文山壮族苗族自治州,西畴县', '104.674190000000', '23.439410000000', 'Xichou');
INSERT INTO `cf_areas` VALUES ('532624', '麻栗坡县', '532600', '麻栗坡', '3', '0876', '663600', '中国,云南省,文山壮族苗族自治州,麻栗坡县', '104.701320000000', '23.120280000000', 'Malipo');
INSERT INTO `cf_areas` VALUES ('532625', '马关县', '532600', '马关', '3', '0876', '663700', '中国,云南省,文山壮族苗族自治州,马关县', '104.395140000000', '23.012930000000', 'Maguan');
INSERT INTO `cf_areas` VALUES ('532626', '丘北县', '532600', '丘北', '3', '0876', '663200', '中国,云南省,文山壮族苗族自治州,丘北县', '104.192560000000', '24.039570000000', 'Qiubei');
INSERT INTO `cf_areas` VALUES ('532627', '广南县', '532600', '广南', '3', '0876', '663300', '中国,云南省,文山壮族苗族自治州,广南县', '105.055110000000', '24.046400000000', 'Guangnan');
INSERT INTO `cf_areas` VALUES ('532628', '富宁县', '532600', '富宁', '3', '0876', '663400', '中国,云南省,文山壮族苗族自治州,富宁县', '105.630850000000', '23.625360000000', 'Funing');
INSERT INTO `cf_areas` VALUES ('532800', '西双版纳傣族自治州', '530000', '西双版纳', '2', '0691', '666100', '中国,云南省,西双版纳傣族自治州', '100.797941000000', '22.001724000000', 'Xishuangbanna');
INSERT INTO `cf_areas` VALUES ('532801', '景洪市', '532800', '景洪', '3', '0691', '666100', '中国,云南省,西双版纳傣族自治州,景洪市', '100.799770000000', '22.010710000000', 'Jinghong');
INSERT INTO `cf_areas` VALUES ('532822', '勐海县', '532800', '勐海', '3', '0691', '666200', '中国,云南省,西双版纳傣族自治州,勐海县', '100.449310000000', '21.961750000000', 'Menghai');
INSERT INTO `cf_areas` VALUES ('532823', '勐腊县', '532800', '勐腊', '3', '0691', '666300', '中国,云南省,西双版纳傣族自治州,勐腊县', '101.564880000000', '21.481620000000', 'Mengla');
INSERT INTO `cf_areas` VALUES ('532900', '大理白族自治州', '530000', '大理', '2', '0872', '671000', '中国,云南省,大理白族自治州', '100.240037000000', '25.592765000000', 'Dali');
INSERT INTO `cf_areas` VALUES ('532901', '大理市', '532900', '大理', '3', '0872', '671000', '中国,云南省,大理白族自治州,大理市', '100.229980000000', '25.591570000000', 'Dali');
INSERT INTO `cf_areas` VALUES ('532922', '漾濞彝族自治县', '532900', '漾濞', '3', '0872', '672500', '中国,云南省,大理白族自治州,漾濞彝族自治县', '99.954740000000', '25.665200000000', 'Yangbi');
INSERT INTO `cf_areas` VALUES ('532923', '祥云县', '532900', '祥云', '3', '0872', '672100', '中国,云南省,大理白族自治州,祥云县', '100.557610000000', '25.473420000000', 'Xiangyun');
INSERT INTO `cf_areas` VALUES ('532924', '宾川县', '532900', '宾川', '3', '0872', '671600', '中国,云南省,大理白族自治州,宾川县', '100.576660000000', '25.831440000000', 'Binchuan');
INSERT INTO `cf_areas` VALUES ('532925', '弥渡县', '532900', '弥渡', '3', '0872', '675600', '中国,云南省,大理白族自治州,弥渡县', '100.490750000000', '25.341790000000', 'Midu');
INSERT INTO `cf_areas` VALUES ('532926', '南涧彝族自治县', '532900', '南涧', '3', '0872', '675700', '中国,云南省,大理白族自治州,南涧彝族自治县', '100.509640000000', '25.043490000000', 'Nanjian');
INSERT INTO `cf_areas` VALUES ('532927', '巍山彝族回族自治县', '532900', '巍山', '3', '0872', '672400', '中国,云南省,大理白族自治州,巍山彝族回族自治县', '100.306120000000', '25.231970000000', 'Weishan');
INSERT INTO `cf_areas` VALUES ('532928', '永平县', '532900', '永平', '3', '0872', '672600', '中国,云南省,大理白族自治州,永平县', '99.540950000000', '25.464510000000', 'Yongping');
INSERT INTO `cf_areas` VALUES ('532929', '云龙县', '532900', '云龙', '3', '0872', '672700', '中国,云南省,大理白族自治州,云龙县', '99.372550000000', '25.885050000000', 'Yunlong');
INSERT INTO `cf_areas` VALUES ('532930', '洱源县', '532900', '洱源', '3', '0872', '671200', '中国,云南省,大理白族自治州,洱源县', '99.949030000000', '26.108290000000', 'Eryuan');
INSERT INTO `cf_areas` VALUES ('532931', '剑川县', '532900', '剑川', '3', '0872', '671300', '中国,云南省,大理白族自治州,剑川县', '99.905450000000', '26.536880000000', 'Jianchuan');
INSERT INTO `cf_areas` VALUES ('532932', '鹤庆县', '532900', '鹤庆', '3', '0872', '671500', '中国,云南省,大理白族自治州,鹤庆县', '100.176970000000', '26.557980000000', 'Heqing');
INSERT INTO `cf_areas` VALUES ('533100', '德宏傣族景颇族自治州', '530000', '德宏', '2', '0692', '678400', '中国,云南省,德宏傣族景颇族自治州', '98.578363000000', '24.436694000000', 'Dehong');
INSERT INTO `cf_areas` VALUES ('533102', '瑞丽市', '533100', '瑞丽', '3', '0692', '678600', '中国,云南省,德宏傣族景颇族自治州,瑞丽市', '97.851830000000', '24.012770000000', 'Ruili');
INSERT INTO `cf_areas` VALUES ('533103', '芒市', '533100', '芒市', '3', '0692', '678400', '中国,云南省,德宏傣族景颇族自治州,芒市', '98.588641000000', '24.433735000000', 'Mangshi');
INSERT INTO `cf_areas` VALUES ('533122', '梁河县', '533100', '梁河', '3', '0692', '679200', '中国,云南省,德宏傣族景颇族自治州,梁河县', '98.297050000000', '24.806580000000', 'Lianghe');
INSERT INTO `cf_areas` VALUES ('533123', '盈江县', '533100', '盈江', '3', '0692', '679300', '中国,云南省,德宏傣族景颇族自治州,盈江县', '97.931790000000', '24.705790000000', 'Yingjiang');
INSERT INTO `cf_areas` VALUES ('533124', '陇川县', '533100', '陇川', '3', '0692', '678700', '中国,云南省,德宏傣族景颇族自治州,陇川县', '97.791990000000', '24.183020000000', 'Longchuan');
INSERT INTO `cf_areas` VALUES ('533300', '怒江傈僳族自治州', '530000', '怒江', '2', '0886', '673100', '中国,云南省,怒江傈僳族自治州', '98.854304000000', '25.850949000000', 'Nujiang');
INSERT INTO `cf_areas` VALUES ('533321', '泸水县', '533300', '泸水', '3', '0886', '673100', '中国,云南省,怒江傈僳族自治州,泸水县', '98.855340000000', '25.837720000000', 'Lushui');
INSERT INTO `cf_areas` VALUES ('533323', '福贡县', '533300', '福贡', '3', '0886', '673400', '中国,云南省,怒江傈僳族自治州,福贡县', '98.869690000000', '26.903660000000', 'Fugong');
INSERT INTO `cf_areas` VALUES ('533324', '贡山独龙族怒族自治县', '533300', '贡山', '3', '0886', '673500', '中国,云南省,怒江傈僳族自治州,贡山独龙族怒族自治县', '98.665830000000', '27.740880000000', 'Gongshan');
INSERT INTO `cf_areas` VALUES ('533325', '兰坪白族普米族自治县', '533300', '兰坪', '3', '0886', '671400', '中国,云南省,怒江傈僳族自治州,兰坪白族普米族自治县', '99.418910000000', '26.452510000000', 'Lanping');
INSERT INTO `cf_areas` VALUES ('533400', '迪庆藏族自治州', '530000', '迪庆', '2', '0887', '674400', '中国,云南省,迪庆藏族自治州', '99.706463000000', '27.826853000000', 'Deqen');
INSERT INTO `cf_areas` VALUES ('533421', '香格里拉市', '533400', '香格里拉', '3', '0887', '674400', '中国,云南省,迪庆藏族自治州,香格里拉市', '99.706010000000', '27.823080000000', 'Xianggelila');
INSERT INTO `cf_areas` VALUES ('533422', '德钦县', '533400', '德钦', '3', '0887', '674500', '中国,云南省,迪庆藏族自治州,德钦县', '98.910820000000', '28.486300000000', 'Deqin');
INSERT INTO `cf_areas` VALUES ('533423', '维西傈僳族自治县', '533400', '维西', '3', '0887', '674600', '中国,云南省,迪庆藏族自治州,维西傈僳族自治县', '99.284020000000', '27.179300000000', 'Weixi');
INSERT INTO `cf_areas` VALUES ('540000', '西藏自治区', '100000', '西藏', '1', '', '', '中国,西藏自治区', '91.132212000000', '29.660361000000', 'Tibet');
INSERT INTO `cf_areas` VALUES ('540100', '拉萨市', '540000', '拉萨', '2', '0891', '850000', '中国,西藏自治区,拉萨市', '91.132212000000', '29.660361000000', 'Lhasa');
INSERT INTO `cf_areas` VALUES ('540102', '城关区', '540100', '城关', '3', '0891', '850000', '中国,西藏自治区,拉萨市,城关区', '91.138590000000', '29.653120000000', 'Chengguan');
INSERT INTO `cf_areas` VALUES ('540121', '林周县', '540100', '林周', '3', '0891', '851600', '中国,西藏自治区,拉萨市,林周县', '91.258600000000', '29.894450000000', 'Linzhou');
INSERT INTO `cf_areas` VALUES ('540122', '当雄县', '540100', '当雄', '3', '0891', '851500', '中国,西藏自治区,拉萨市,当雄县', '91.100760000000', '30.483090000000', 'Dangxiong');
INSERT INTO `cf_areas` VALUES ('540123', '尼木县', '540100', '尼木', '3', '0891', '851300', '中国,西藏自治区,拉萨市,尼木县', '90.163780000000', '29.433530000000', 'Nimu');
INSERT INTO `cf_areas` VALUES ('540124', '曲水县', '540100', '曲水', '3', '0891', '850600', '中国,西藏自治区,拉萨市,曲水县', '90.731870000000', '29.356360000000', 'Qushui');
INSERT INTO `cf_areas` VALUES ('540125', '堆龙德庆县', '540100', '堆龙德庆', '3', '0891', '851400', '中国,西藏自治区,拉萨市,堆龙德庆县', '91.000330000000', '29.650020000000', 'Duilongdeqing');
INSERT INTO `cf_areas` VALUES ('540126', '达孜县', '540100', '达孜', '3', '0891', '850100', '中国,西藏自治区,拉萨市,达孜县', '91.357570000000', '29.672200000000', 'Dazi');
INSERT INTO `cf_areas` VALUES ('540127', '墨竹工卡县', '540100', '墨竹工卡', '3', '0891', '850200', '中国,西藏自治区,拉萨市,墨竹工卡县', '91.728140000000', '29.836140000000', 'Mozhugongka');
INSERT INTO `cf_areas` VALUES ('540200', '日喀则市', '540000', '日喀则', '2', '0892', '857000', '中国,西藏自治区,日喀则市', '88.884874000000', '29.263792000000', 'Rikaze');
INSERT INTO `cf_areas` VALUES ('540202', '桑珠孜区', '540200', '桑珠孜', '3', '0892', '857000', '中国,西藏自治区,日喀则市,桑珠孜区', '88.880367000000', '29.269565000000', 'Sangzhuzi');
INSERT INTO `cf_areas` VALUES ('540221', '南木林县', '540200', '南木林', '3', '0892', '857100', '中国,西藏自治区,日喀则市,南木林县', '89.096860000000', '29.682060000000', 'Nanmulin');
INSERT INTO `cf_areas` VALUES ('540222', '江孜县', '540200', '江孜', '3', '0892', '857400', '中国,西藏自治区,日喀则市,江孜县', '89.602630000000', '28.917440000000', 'Jiangzi');
INSERT INTO `cf_areas` VALUES ('540223', '定日县', '540200', '定日', '3', '0892', '858200', '中国,西藏自治区,日喀则市,定日县', '87.121760000000', '28.661290000000', 'Dingri');
INSERT INTO `cf_areas` VALUES ('540224', '萨迦县', '540200', '萨迦', '3', '0892', '857800', '中国,西藏自治区,日喀则市,萨迦县', '88.021910000000', '28.902990000000', 'Sajia');
INSERT INTO `cf_areas` VALUES ('540225', '拉孜县', '540200', '拉孜', '3', '0892', '858100', '中国,西藏自治区,日喀则市,拉孜县', '87.634120000000', '29.085000000000', 'Lazi');
INSERT INTO `cf_areas` VALUES ('540226', '昂仁县', '540200', '昂仁', '3', '0892', '858500', '中国,西藏自治区,日喀则市,昂仁县', '87.238580000000', '29.294960000000', 'Angren');
INSERT INTO `cf_areas` VALUES ('540227', '谢通门县', '540200', '谢通门', '3', '0892', '858900', '中国,西藏自治区,日喀则市,谢通门县', '88.262420000000', '29.433370000000', 'Xietongmen');
INSERT INTO `cf_areas` VALUES ('540228', '白朗县', '540200', '白朗', '3', '0892', '857300', '中国,西藏自治区,日喀则市,白朗县', '89.262050000000', '29.105530000000', 'Bailang');
INSERT INTO `cf_areas` VALUES ('540229', '仁布县', '540200', '仁布', '3', '0892', '857200', '中国,西藏自治区,日喀则市,仁布县', '89.842280000000', '29.230100000000', 'Renbu');
INSERT INTO `cf_areas` VALUES ('540230', '康马县', '540200', '康马', '3', '0892', '857500', '中国,西藏自治区,日喀则市,康马县', '89.685270000000', '28.556700000000', 'Kangma');
INSERT INTO `cf_areas` VALUES ('540231', '定结县', '540200', '定结', '3', '0892', '857900', '中国,西藏自治区,日喀则市,定结县', '87.772550000000', '28.364030000000', 'Dingjie');
INSERT INTO `cf_areas` VALUES ('540232', '仲巴县', '540200', '仲巴', '3', '0892', '858800', '中国,西藏自治区,日喀则市,仲巴县', '84.029510000000', '29.765950000000', 'Zhongba');
INSERT INTO `cf_areas` VALUES ('540233', '亚东县', '540200', '亚东', '3', '0892', '857600', '中国,西藏自治区,日喀则市,亚东县', '88.908020000000', '27.483900000000', 'Yadong');
INSERT INTO `cf_areas` VALUES ('540234', '吉隆县', '540200', '吉隆', '3', '0892', '858700', '中国,西藏自治区,日喀则市,吉隆县', '85.298460000000', '28.853820000000', 'Jilong');
INSERT INTO `cf_areas` VALUES ('540235', '聂拉木县', '540200', '聂拉木', '3', '0892', '858300', '中国,西藏自治区,日喀则市,聂拉木县', '85.979980000000', '28.156450000000', 'Nielamu');
INSERT INTO `cf_areas` VALUES ('540236', '萨嘎县', '540200', '萨嘎', '3', '0892', '857800', '中国,西藏自治区,日喀则市,萨嘎县', '85.234130000000', '29.329360000000', 'Saga');
INSERT INTO `cf_areas` VALUES ('540237', '岗巴县', '540200', '岗巴', '3', '0892', '857700', '中国,西藏自治区,日喀则市,岗巴县', '88.520690000000', '28.275040000000', 'Gangba');
INSERT INTO `cf_areas` VALUES ('540300', '昌都市', '540000', '昌都', '2', '0895', '854000', '中国,西藏自治区,昌都市', '97.178452000000', '31.136875000000', 'Qamdo');
INSERT INTO `cf_areas` VALUES ('540302', '卡若区', '540300', '昌都', '3', '0895', '854000', '中国,西藏自治区,昌都市,卡若区', '97.180430000000', '31.138500000000', 'Karuo');
INSERT INTO `cf_areas` VALUES ('540321', '江达县', '540300', '江达', '3', '0895', '854100', '中国,西藏自治区,昌都市,江达县', '98.218650000000', '31.503430000000', 'Jiangda');
INSERT INTO `cf_areas` VALUES ('540322', '贡觉县', '540300', '贡觉', '3', '0895', '854200', '中国,西藏自治区,昌都市,贡觉县', '98.271630000000', '30.859410000000', 'Gongjue');
INSERT INTO `cf_areas` VALUES ('540323', '类乌齐县', '540300', '类乌齐', '3', '0895', '855600', '中国,西藏自治区,昌都市,类乌齐县', '96.600150000000', '31.212070000000', 'Leiwuqi');
INSERT INTO `cf_areas` VALUES ('540324', '丁青县', '540300', '丁青', '3', '0895', '855700', '中国,西藏自治区,昌都市,丁青县', '95.593620000000', '31.416210000000', 'Dingqing');
INSERT INTO `cf_areas` VALUES ('540325', '察雅县', '540300', '察雅', '3', '0895', '854300', '中国,西藏自治区,昌都市,察雅县', '97.565210000000', '30.653360000000', 'Chaya');
INSERT INTO `cf_areas` VALUES ('540326', '八宿县', '540300', '八宿', '3', '0895', '854600', '中国,西藏自治区,昌都市,八宿县', '96.917600000000', '30.053460000000', 'Basu');
INSERT INTO `cf_areas` VALUES ('540327', '左贡县', '540300', '左贡', '3', '0895', '854400', '中国,西藏自治区,昌都市,左贡县', '97.844290000000', '29.671080000000', 'Zuogong');
INSERT INTO `cf_areas` VALUES ('540328', '芒康县', '540300', '芒康', '3', '0895', '854500', '中国,西藏自治区,昌都市,芒康县', '98.593780000000', '29.679460000000', 'Mangkang');
INSERT INTO `cf_areas` VALUES ('540329', '洛隆县', '540300', '洛隆', '3', '0895', '855400', '中国,西藏自治区,昌都市,洛隆县', '95.826440000000', '30.740490000000', 'Luolong');
INSERT INTO `cf_areas` VALUES ('540330', '边坝县', '540300', '边坝', '3', '0895', '855500', '中国,西藏自治区,昌都市,边坝县', '94.706870000000', '30.934340000000', 'Bianba');
INSERT INTO `cf_areas` VALUES ('542200', '山南地区', '540000', '山南', '2', '0893', '856000', '中国,西藏自治区,山南地区', '91.766529000000', '29.236023000000', 'Shannan');
INSERT INTO `cf_areas` VALUES ('542221', '乃东县', '542200', '乃东', '3', '0893', '856100', '中国,西藏自治区,山南地区,乃东县', '91.761530000000', '29.224900000000', 'Naidong');
INSERT INTO `cf_areas` VALUES ('542222', '扎囊县', '542200', '扎囊', '3', '0893', '850800', '中国,西藏自治区,山南地区,扎囊县', '91.332880000000', '29.239900000000', 'Zhanang');
INSERT INTO `cf_areas` VALUES ('542223', '贡嘎县', '542200', '贡嘎', '3', '0893', '850700', '中国,西藏自治区,山南地区,贡嘎县', '90.988670000000', '29.294080000000', 'Gongga');
INSERT INTO `cf_areas` VALUES ('542224', '桑日县', '542200', '桑日', '3', '0893', '856200', '中国,西藏自治区,山南地区,桑日县', '92.020050000000', '29.266430000000', 'Sangri');
INSERT INTO `cf_areas` VALUES ('542225', '琼结县', '542200', '琼结', '3', '0893', '856800', '中国,西藏自治区,山南地区,琼结县', '91.680930000000', '29.026320000000', 'Qiongjie');
INSERT INTO `cf_areas` VALUES ('542226', '曲松县', '542200', '曲松', '3', '0893', '856300', '中国,西藏自治区,山南地区,曲松县', '92.202630000000', '29.064120000000', 'Qusong');
INSERT INTO `cf_areas` VALUES ('542227', '措美县', '542200', '措美', '3', '0893', '856900', '中国,西藏自治区,山南地区,措美县', '91.432370000000', '28.437940000000', 'Cuomei');
INSERT INTO `cf_areas` VALUES ('542228', '洛扎县', '542200', '洛扎', '3', '0893', '856600', '中国,西藏自治区,山南地区,洛扎县', '90.860350000000', '28.387200000000', 'Luozha');
INSERT INTO `cf_areas` VALUES ('542229', '加查县', '542200', '加查', '3', '0893', '856400', '中国,西藏自治区,山南地区,加查县', '92.577020000000', '29.139730000000', 'Jiacha');
INSERT INTO `cf_areas` VALUES ('542231', '隆子县', '542200', '隆子', '3', '0893', '856600', '中国,西藏自治区,山南地区,隆子县', '92.461480000000', '28.407970000000', 'Longzi');
INSERT INTO `cf_areas` VALUES ('542232', '错那县', '542200', '错那', '3', '0893', '856700', '中国,西藏自治区,山南地区,错那县', '91.957520000000', '27.992240000000', 'Cuona');
INSERT INTO `cf_areas` VALUES ('542233', '浪卡子县', '542200', '浪卡子', '3', '0893', '851100', '中国,西藏自治区,山南地区,浪卡子县', '90.400020000000', '28.969480000000', 'Langkazi');
INSERT INTO `cf_areas` VALUES ('542400', '那曲地区', '540000', '那曲', '2', '0896', '852000', '中国,西藏自治区,那曲地区', '92.060214000000', '31.476004000000', 'Nagqu');
INSERT INTO `cf_areas` VALUES ('542421', '那曲县', '542400', '那曲', '3', '0896', '852000', '中国,西藏自治区,那曲地区,那曲县', '92.053500000000', '31.469640000000', 'Naqu');
INSERT INTO `cf_areas` VALUES ('542422', '嘉黎县', '542400', '嘉黎', '3', '0896', '852400', '中国,西藏自治区,那曲地区,嘉黎县', '93.249870000000', '30.642330000000', 'Jiali');
INSERT INTO `cf_areas` VALUES ('542423', '比如县', '542400', '比如', '3', '0896', '852300', '中国,西藏自治区,那曲地区,比如县', '93.686850000000', '31.477900000000', 'Biru');
INSERT INTO `cf_areas` VALUES ('542424', '聂荣县', '542400', '聂荣', '3', '0896', '853500', '中国,西藏自治区,那曲地区,聂荣县', '92.295740000000', '32.111930000000', 'Nierong');
INSERT INTO `cf_areas` VALUES ('542425', '安多县', '542400', '安多', '3', '0896', '853400', '中国,西藏自治区,那曲地区,安多县', '91.679500000000', '32.261250000000', 'Anduo');
INSERT INTO `cf_areas` VALUES ('542426', '申扎县', '542400', '申扎', '3', '0896', '853100', '中国,西藏自治区,那曲地区,申扎县', '88.707760000000', '30.929950000000', 'Shenzha');
INSERT INTO `cf_areas` VALUES ('542427', '索县', '542400', '索县', '3', '0896', '852200', '中国,西藏自治区,那曲地区,索县', '93.782950000000', '31.884270000000', 'Suoxian');
INSERT INTO `cf_areas` VALUES ('542428', '班戈县', '542400', '班戈', '3', '0896', '852500', '中国,西藏自治区,那曲地区,班戈县', '90.019070000000', '31.361490000000', 'Bange');
INSERT INTO `cf_areas` VALUES ('542429', '巴青县', '542400', '巴青', '3', '0896', '852100', '中国,西藏自治区,那曲地区,巴青县', '94.053160000000', '31.918330000000', 'Baqing');
INSERT INTO `cf_areas` VALUES ('542430', '尼玛县', '542400', '尼玛', '3', '0896', '852600', '中国,西藏自治区,那曲地区,尼玛县', '87.252560000000', '31.796540000000', 'Nima');
INSERT INTO `cf_areas` VALUES ('542431', '双湖县', '542400', '双湖', '3', '0896', '852600', '中国,西藏自治区,那曲地区,双湖县', '88.837776000000', '33.189032000000', 'Shuanghu');
INSERT INTO `cf_areas` VALUES ('542500', '阿里地区', '540000', '阿里', '2', '0897', '859000', '中国,西藏自治区,阿里地区', '80.105498000000', '32.503187000000', 'Ngari');
INSERT INTO `cf_areas` VALUES ('542521', '普兰县', '542500', '普兰', '3', '0897', '859500', '中国,西藏自治区,阿里地区,普兰县', '81.177000000000', '30.300020000000', 'Pulan');
INSERT INTO `cf_areas` VALUES ('542522', '札达县', '542500', '札达', '3', '0897', '859600', '中国,西藏自治区,阿里地区,札达县', '79.802550000000', '31.483450000000', 'Zhada');
INSERT INTO `cf_areas` VALUES ('542523', '噶尔县', '542500', '噶尔', '3', '0897', '859400', '中国,西藏自治区,阿里地区,噶尔县', '80.095790000000', '32.500240000000', 'Gaer');
INSERT INTO `cf_areas` VALUES ('542524', '日土县', '542500', '日土', '3', '0897', '859700', '中国,西藏自治区,阿里地区,日土县', '79.713100000000', '33.387410000000', 'Ritu');
INSERT INTO `cf_areas` VALUES ('542525', '革吉县', '542500', '革吉', '3', '0897', '859100', '中国,西藏自治区,阿里地区,革吉县', '81.151000000000', '32.396400000000', 'Geji');
INSERT INTO `cf_areas` VALUES ('542526', '改则县', '542500', '改则', '3', '0897', '859200', '中国,西藏自治区,阿里地区,改则县', '84.062950000000', '32.304460000000', 'Gaize');
INSERT INTO `cf_areas` VALUES ('542527', '措勤县', '542500', '措勤', '3', '0897', '859300', '中国,西藏自治区,阿里地区,措勤县', '85.166160000000', '31.020950000000', 'Cuoqin');
INSERT INTO `cf_areas` VALUES ('542600', '林芝地区', '540000', '林芝', '2', '0894', '850400', '中国,西藏自治区,林芝地区', '94.362348000000', '29.654693000000', 'Nyingchi');
INSERT INTO `cf_areas` VALUES ('542621', '林芝县', '542600', '林芝', '3', '0894', '850400', '中国,西藏自治区,林芝地区,林芝县', '94.483910000000', '29.575620000000', 'Linzhi');
INSERT INTO `cf_areas` VALUES ('542622', '工布江达县', '542600', '工布江达', '3', '0894', '850300', '中国,西藏自治区,林芝地区,工布江达县', '93.245200000000', '29.885760000000', 'Gongbujiangda');
INSERT INTO `cf_areas` VALUES ('542623', '米林县', '542600', '米林', '3', '0894', '850500', '中国,西藏自治区,林芝地区,米林县', '94.213160000000', '29.215350000000', 'Milin');
INSERT INTO `cf_areas` VALUES ('542624', '墨脱县', '542600', '墨脱', '3', '0894', '855300', '中国,西藏自治区,林芝地区,墨脱县', '95.331600000000', '29.326980000000', 'Motuo');
INSERT INTO `cf_areas` VALUES ('542625', '波密县', '542600', '波密', '3', '0894', '855200', '中国,西藏自治区,林芝地区,波密县', '95.770960000000', '29.859070000000', 'Bomi');
INSERT INTO `cf_areas` VALUES ('542626', '察隅县', '542600', '察隅', '3', '0894', '855100', '中国,西藏自治区,林芝地区,察隅县', '97.466790000000', '28.661800000000', 'Chayu');
INSERT INTO `cf_areas` VALUES ('542627', '朗县', '542600', '朗县', '3', '0894', '856500', '中国,西藏自治区,林芝地区,朗县', '93.075400000000', '29.045490000000', 'Langxian');
INSERT INTO `cf_areas` VALUES ('610000', '陕西省', '100000', '陕西', '1', '', '', '中国,陕西省', '108.948024000000', '34.263161000000', 'Shaanxi');
INSERT INTO `cf_areas` VALUES ('610100', '西安市', '610000', '西安', '2', '029', '710003', '中国,陕西省,西安市', '108.948024000000', '34.263161000000', 'Xi\'an');
INSERT INTO `cf_areas` VALUES ('610102', '新城区', '610100', '新城', '3', '029', '710004', '中国,陕西省,西安市,新城区', '108.960800000000', '34.266410000000', 'Xincheng');
INSERT INTO `cf_areas` VALUES ('610103', '碑林区', '610100', '碑林', '3', '029', '710001', '中国,陕西省,西安市,碑林区', '108.934260000000', '34.230400000000', 'Beilin');
INSERT INTO `cf_areas` VALUES ('610104', '莲湖区', '610100', '莲湖', '3', '029', '710003', '中国,陕西省,西安市,莲湖区', '108.940100000000', '34.267090000000', 'Lianhu');
INSERT INTO `cf_areas` VALUES ('610111', '灞桥区', '610100', '灞桥', '3', '029', '710038', '中国,陕西省,西安市,灞桥区', '109.064510000000', '34.272640000000', 'Baqiao');
INSERT INTO `cf_areas` VALUES ('610112', '未央区', '610100', '未央', '3', '029', '710014', '中国,陕西省,西安市,未央区', '108.946830000000', '34.292960000000', 'Weiyang');
INSERT INTO `cf_areas` VALUES ('610113', '雁塔区', '610100', '雁塔', '3', '029', '710061', '中国,陕西省,西安市,雁塔区', '108.948660000000', '34.222450000000', 'Yanta');
INSERT INTO `cf_areas` VALUES ('610114', '阎良区', '610100', '阎良', '3', '029', '710087', '中国,陕西省,西安市,阎良区', '109.226160000000', '34.662210000000', 'Yanliang');
INSERT INTO `cf_areas` VALUES ('610115', '临潼区', '610100', '临潼', '3', '029', '710600', '中国,陕西省,西安市,临潼区', '109.214170000000', '34.366650000000', 'Lintong');
INSERT INTO `cf_areas` VALUES ('610116', '长安区', '610100', '长安', '3', '029', '710100', '中国,陕西省,西安市,长安区', '108.945860000000', '34.155590000000', 'Chang\'an');
INSERT INTO `cf_areas` VALUES ('610122', '蓝田县', '610100', '蓝田', '3', '029', '710500', '中国,陕西省,西安市,蓝田县', '109.323390000000', '34.151280000000', 'Lantian');
INSERT INTO `cf_areas` VALUES ('610124', '周至县', '610100', '周至', '3', '029', '710400', '中国,陕西省,西安市,周至县', '108.222070000000', '34.163370000000', 'Zhouzhi');
INSERT INTO `cf_areas` VALUES ('610125', '户县', '610100', '户县', '3', '029', '710300', '中国,陕西省,西安市,户县', '108.605130000000', '34.108560000000', 'Huxian');
INSERT INTO `cf_areas` VALUES ('610126', '高陵区', '610100', '高陵', '3', '029', '710200', '中国,陕西省,西安市,高陵区', '109.088160000000', '34.534830000000', 'Gaoling');
INSERT INTO `cf_areas` VALUES ('610200', '铜川市', '610000', '铜川', '2', '0919', '727100', '中国,陕西省,铜川市', '108.963122000000', '34.908920000000', 'Tongchuan');
INSERT INTO `cf_areas` VALUES ('610202', '王益区', '610200', '王益', '3', '0919', '727000', '中国,陕西省,铜川市,王益区', '109.075640000000', '35.068960000000', 'Wangyi');
INSERT INTO `cf_areas` VALUES ('610203', '印台区', '610200', '印台', '3', '0919', '727007', '中国,陕西省,铜川市,印台区', '109.102080000000', '35.116900000000', 'Yintai');
INSERT INTO `cf_areas` VALUES ('610204', '耀州区', '610200', '耀州', '3', '0919', '727100', '中国,陕西省,铜川市,耀州区', '108.985560000000', '34.913080000000', 'Yaozhou');
INSERT INTO `cf_areas` VALUES ('610222', '宜君县', '610200', '宜君', '3', '0919', '727200', '中国,陕西省,铜川市,宜君县', '109.118130000000', '35.401080000000', 'Yijun');
INSERT INTO `cf_areas` VALUES ('610300', '宝鸡市', '610000', '宝鸡', '2', '0917', '721000', '中国,陕西省,宝鸡市', '107.144870000000', '34.369315000000', 'Baoji');
INSERT INTO `cf_areas` VALUES ('610302', '渭滨区', '610300', '渭滨', '3', '0917', '721000', '中国,陕西省,宝鸡市,渭滨区', '107.149910000000', '34.371160000000', 'Weibin');
INSERT INTO `cf_areas` VALUES ('610303', '金台区', '610300', '金台', '3', '0917', '721000', '中国,陕西省,宝鸡市,金台区', '107.146910000000', '34.376120000000', 'Jintai');
INSERT INTO `cf_areas` VALUES ('610304', '陈仓区', '610300', '陈仓', '3', '0917', '721300', '中国,陕西省,宝鸡市,陈仓区', '107.387420000000', '34.354510000000', 'Chencang');
INSERT INTO `cf_areas` VALUES ('610322', '凤翔县', '610300', '凤翔', '3', '0917', '721400', '中国,陕西省,宝鸡市,凤翔县', '107.396450000000', '34.523210000000', 'Fengxiang');
INSERT INTO `cf_areas` VALUES ('610323', '岐山县', '610300', '岐山', '3', '0917', '722400', '中国,陕西省,宝鸡市,岐山县', '107.621730000000', '34.443780000000', 'Qishan');
INSERT INTO `cf_areas` VALUES ('610324', '扶风县', '610300', '扶风', '3', '0917', '722200', '中国,陕西省,宝鸡市,扶风县', '107.900170000000', '34.375240000000', 'Fufeng');
INSERT INTO `cf_areas` VALUES ('610326', '眉县', '610300', '眉县', '3', '0917', '722300', '中国,陕西省,宝鸡市,眉县', '107.750790000000', '34.275690000000', 'Meixian');
INSERT INTO `cf_areas` VALUES ('610327', '陇县', '610300', '陇县', '3', '0917', '721200', '中国,陕西省,宝鸡市,陇县', '106.859460000000', '34.894040000000', 'Longxian');
INSERT INTO `cf_areas` VALUES ('610328', '千阳县', '610300', '千阳', '3', '0917', '721100', '中国,陕西省,宝鸡市,千阳县', '107.130430000000', '34.642190000000', 'Qianyang');
INSERT INTO `cf_areas` VALUES ('610329', '麟游县', '610300', '麟游', '3', '0917', '721500', '中国,陕西省,宝鸡市,麟游县', '107.796230000000', '34.678440000000', 'Linyou');
INSERT INTO `cf_areas` VALUES ('610330', '凤县', '610300', '凤县', '3', '0917', '721700', '中国,陕西省,宝鸡市,凤县', '106.523560000000', '33.911720000000', 'Fengxian');
INSERT INTO `cf_areas` VALUES ('610331', '太白县', '610300', '太白', '3', '0917', '721600', '中国,陕西省,宝鸡市,太白县', '107.316460000000', '34.062070000000', 'Taibai');
INSERT INTO `cf_areas` VALUES ('610400', '咸阳市', '610000', '咸阳', '2', '029', '712000', '中国,陕西省,咸阳市', '108.705117000000', '34.333439000000', 'Xianyang');
INSERT INTO `cf_areas` VALUES ('610402', '秦都区', '610400', '秦都', '3', '029', '712000', '中国,陕西省,咸阳市,秦都区', '108.714930000000', '34.338040000000', 'Qindu');
INSERT INTO `cf_areas` VALUES ('610403', '杨陵区', '610400', '杨陵', '3', '029', '712100', '中国,陕西省,咸阳市,杨陵区', '108.083481000000', '34.270434000000', 'Yangling');
INSERT INTO `cf_areas` VALUES ('610404', '渭城区', '610400', '渭城', '3', '029', '712000', '中国,陕西省,咸阳市,渭城区', '108.722270000000', '34.331980000000', 'Weicheng');
INSERT INTO `cf_areas` VALUES ('610422', '三原县', '610400', '三原', '3', '029', '713800', '中国,陕西省,咸阳市,三原县', '108.931940000000', '34.615560000000', 'Sanyuan');
INSERT INTO `cf_areas` VALUES ('610423', '泾阳县', '610400', '泾阳', '3', '029', '713700', '中国,陕西省,咸阳市,泾阳县', '108.842590000000', '34.527050000000', 'Jingyang');
INSERT INTO `cf_areas` VALUES ('610424', '乾县', '610400', '乾县', '3', '029', '713300', '中国,陕西省,咸阳市,乾县', '108.242310000000', '34.529460000000', 'Qianxian');
INSERT INTO `cf_areas` VALUES ('610425', '礼泉县', '610400', '礼泉', '3', '029', '713200', '中国,陕西省,咸阳市,礼泉县', '108.426300000000', '34.484550000000', 'Liquan');
INSERT INTO `cf_areas` VALUES ('610426', '永寿县', '610400', '永寿', '3', '029', '713400', '中国,陕西省,咸阳市,永寿县', '108.144740000000', '34.690810000000', 'Yongshou');
INSERT INTO `cf_areas` VALUES ('610427', '彬县', '610400', '彬县', '3', '029', '713500', '中国,陕西省,咸阳市,彬县', '108.084680000000', '35.034200000000', 'Binxian');
INSERT INTO `cf_areas` VALUES ('610428', '长武县', '610400', '长武', '3', '029', '713600', '中国,陕西省,咸阳市,长武县', '107.795100000000', '35.206700000000', 'Changwu');
INSERT INTO `cf_areas` VALUES ('610429', '旬邑县', '610400', '旬邑', '3', '029', '711300', '中国,陕西省,咸阳市,旬邑县', '108.334100000000', '35.113380000000', 'Xunyi');
INSERT INTO `cf_areas` VALUES ('610430', '淳化县', '610400', '淳化', '3', '029', '711200', '中国,陕西省,咸阳市,淳化县', '108.580260000000', '34.798860000000', 'Chunhua');
INSERT INTO `cf_areas` VALUES ('610431', '武功县', '610400', '武功', '3', '029', '712200', '中国,陕西省,咸阳市,武功县', '108.204340000000', '34.260030000000', 'Wugong');
INSERT INTO `cf_areas` VALUES ('610481', '兴平市', '610400', '兴平', '3', '029', '713100', '中国,陕西省,咸阳市,兴平市', '108.490570000000', '34.297850000000', 'Xingping');
INSERT INTO `cf_areas` VALUES ('610500', '渭南市', '610000', '渭南', '2', '0913', '714000', '中国,陕西省,渭南市', '109.502882000000', '34.499381000000', 'Weinan');
INSERT INTO `cf_areas` VALUES ('610502', '临渭区', '610500', '临渭', '3', '0913', '714000', '中国,陕西省,渭南市,临渭区', '109.492960000000', '34.498220000000', 'Linwei');
INSERT INTO `cf_areas` VALUES ('610521', '华县', '610500', '华县', '3', '0913', '714100', '中国,陕西省,渭南市,华县', '109.771850000000', '34.512550000000', 'Huaxian');
INSERT INTO `cf_areas` VALUES ('610522', '潼关县', '610500', '潼关', '3', '0913', '714300', '中国,陕西省,渭南市,潼关县', '110.243620000000', '34.542840000000', 'Tongguan');
INSERT INTO `cf_areas` VALUES ('610523', '大荔县', '610500', '大荔', '3', '0913', '715100', '中国,陕西省,渭南市,大荔县', '109.942160000000', '34.795650000000', 'Dali');
INSERT INTO `cf_areas` VALUES ('610524', '合阳县', '610500', '合阳', '3', '0913', '715300', '中国,陕西省,渭南市,合阳县', '110.148620000000', '35.238050000000', 'Heyang');
INSERT INTO `cf_areas` VALUES ('610525', '澄城县', '610500', '澄城', '3', '0913', '715200', '中国,陕西省,渭南市,澄城县', '109.934440000000', '35.183960000000', 'Chengcheng');
INSERT INTO `cf_areas` VALUES ('610526', '蒲城县', '610500', '蒲城', '3', '0913', '715500', '中国,陕西省,渭南市,蒲城县', '109.590300000000', '34.956800000000', 'Pucheng');
INSERT INTO `cf_areas` VALUES ('610527', '白水县', '610500', '白水', '3', '0913', '715600', '中国,陕西省,渭南市,白水县', '109.592860000000', '35.178630000000', 'Baishui');
INSERT INTO `cf_areas` VALUES ('610528', '富平县', '610500', '富平', '3', '0913', '711700', '中国,陕西省,渭南市,富平县', '109.180200000000', '34.751090000000', 'Fuping');
INSERT INTO `cf_areas` VALUES ('610581', '韩城市', '610500', '韩城', '3', '0913', '715400', '中国,陕西省,渭南市,韩城市', '110.442380000000', '35.479260000000', 'Hancheng');
INSERT INTO `cf_areas` VALUES ('610582', '华阴市', '610500', '华阴', '3', '0913', '714200', '中国,陕西省,渭南市,华阴市', '110.087520000000', '34.566080000000', 'Huayin');
INSERT INTO `cf_areas` VALUES ('610600', '延安市', '610000', '延安', '2', '0911', '716000', '中国,陕西省,延安市', '109.490810000000', '36.596537000000', 'Yan\'an');
INSERT INTO `cf_areas` VALUES ('610602', '宝塔区', '610600', '宝塔', '3', '0911', '716000', '中国,陕西省,延安市,宝塔区', '109.493360000000', '36.591540000000', 'Baota');
INSERT INTO `cf_areas` VALUES ('610621', '延长县', '610600', '延长', '3', '0911', '717100', '中国,陕西省,延安市,延长县', '110.010830000000', '36.579040000000', 'Yanchang');
INSERT INTO `cf_areas` VALUES ('610622', '延川县', '610600', '延川', '3', '0911', '717200', '中国,陕西省,延安市,延川县', '110.194150000000', '36.878170000000', 'Yanchuan');
INSERT INTO `cf_areas` VALUES ('610623', '子长县', '610600', '子长', '3', '0911', '717300', '中国,陕西省,延安市,子长县', '109.675320000000', '37.142530000000', 'Zichang');
INSERT INTO `cf_areas` VALUES ('610624', '安塞县', '610600', '安塞', '3', '0911', '717400', '中国,陕西省,延安市,安塞县', '109.327080000000', '36.865070000000', 'Ansai');
INSERT INTO `cf_areas` VALUES ('610625', '志丹县', '610600', '志丹', '3', '0911', '717500', '中国,陕西省,延安市,志丹县', '108.768150000000', '36.821770000000', 'Zhidan');
INSERT INTO `cf_areas` VALUES ('610626', '吴起县', '610600', '吴起', '3', '0911', '717600', '中国,陕西省,延安市,吴起县', '108.176110000000', '36.927850000000', 'Wuqi');
INSERT INTO `cf_areas` VALUES ('610627', '甘泉县', '610600', '甘泉', '3', '0911', '716100', '中国,陕西省,延安市,甘泉县', '109.350120000000', '36.277540000000', 'Ganquan');
INSERT INTO `cf_areas` VALUES ('610628', '富县', '610600', '富县', '3', '0911', '727500', '中国,陕西省,延安市,富县', '109.379270000000', '35.988030000000', 'Fuxian');
INSERT INTO `cf_areas` VALUES ('610629', '洛川县', '610600', '洛川', '3', '0911', '727400', '中国,陕西省,延安市,洛川县', '109.432860000000', '35.760760000000', 'Luochuan');
INSERT INTO `cf_areas` VALUES ('610630', '宜川县', '610600', '宜川', '3', '0911', '716200', '中国,陕西省,延安市,宜川县', '110.171960000000', '36.047320000000', 'Yichuan');
INSERT INTO `cf_areas` VALUES ('610631', '黄龙县', '610600', '黄龙', '3', '0911', '715700', '中国,陕西省,延安市,黄龙县', '109.842590000000', '35.583490000000', 'Huanglong');
INSERT INTO `cf_areas` VALUES ('610632', '黄陵县', '610600', '黄陵', '3', '0911', '727300', '中国,陕西省,延安市,黄陵县', '109.263330000000', '35.583570000000', 'Huangling');
INSERT INTO `cf_areas` VALUES ('610700', '汉中市', '610000', '汉中', '2', '0916', '723000', '中国,陕西省,汉中市', '107.028621000000', '33.077668000000', 'Hanzhong');
INSERT INTO `cf_areas` VALUES ('610702', '汉台区', '610700', '汉台', '3', '0916', '723000', '中国,陕西省,汉中市,汉台区', '107.031870000000', '33.067740000000', 'Hantai');
INSERT INTO `cf_areas` VALUES ('610721', '南郑县', '610700', '南郑', '3', '0916', '723100', '中国,陕西省,汉中市,南郑县', '106.940240000000', '33.002990000000', 'Nanzheng');
INSERT INTO `cf_areas` VALUES ('610722', '城固县', '610700', '城固', '3', '0916', '723200', '中国,陕西省,汉中市,城固县', '107.333670000000', '33.156610000000', 'Chenggu');
INSERT INTO `cf_areas` VALUES ('610723', '洋县', '610700', '洋县', '3', '0916', '723300', '中国,陕西省,汉中市,洋县', '107.546720000000', '33.221020000000', 'Yangxian');
INSERT INTO `cf_areas` VALUES ('610724', '西乡县', '610700', '西乡', '3', '0916', '723500', '中国,陕西省,汉中市,西乡县', '107.768670000000', '32.984110000000', 'Xixiang');
INSERT INTO `cf_areas` VALUES ('610725', '勉县', '610700', '勉县', '3', '0916', '724200', '中国,陕西省,汉中市,勉县', '106.675840000000', '33.152730000000', 'Mianxian');
INSERT INTO `cf_areas` VALUES ('610726', '宁强县', '610700', '宁强', '3', '0916', '724400', '中国,陕西省,汉中市,宁强县', '106.259580000000', '32.828810000000', 'Ningqiang');
INSERT INTO `cf_areas` VALUES ('610727', '略阳县', '610700', '略阳', '3', '0916', '724300', '中国,陕西省,汉中市,略阳县', '106.153990000000', '33.330090000000', 'Lueyang');
INSERT INTO `cf_areas` VALUES ('610728', '镇巴县', '610700', '镇巴', '3', '0916', '723600', '中国,陕西省,汉中市,镇巴县', '107.896480000000', '32.534870000000', 'Zhenba');
INSERT INTO `cf_areas` VALUES ('610729', '留坝县', '610700', '留坝', '3', '0916', '724100', '中国,陕西省,汉中市,留坝县', '106.922330000000', '33.616060000000', 'Liuba');
INSERT INTO `cf_areas` VALUES ('610730', '佛坪县', '610700', '佛坪', '3', '0916', '723400', '中国,陕西省,汉中市,佛坪县', '107.989740000000', '33.524960000000', 'Foping');
INSERT INTO `cf_areas` VALUES ('610800', '榆林市', '610000', '榆林', '2', '0912', '719000', '中国,陕西省,榆林市', '109.741193000000', '38.290162000000', 'Yulin');
INSERT INTO `cf_areas` VALUES ('610802', '榆阳区', '610800', '榆阳', '3', '0912', '719000', '中国,陕西省,榆林市,榆阳区', '109.734730000000', '38.278430000000', 'Yuyang');
INSERT INTO `cf_areas` VALUES ('610821', '神木县', '610800', '神木', '3', '0912', '719300', '中国,陕西省,榆林市,神木县', '110.498900000000', '38.842340000000', 'Shenmu');
INSERT INTO `cf_areas` VALUES ('610822', '府谷县', '610800', '府谷', '3', '0912', '719400', '中国,陕西省,榆林市,府谷县', '111.067230000000', '39.028050000000', 'Fugu');
INSERT INTO `cf_areas` VALUES ('610823', '横山县', '610800', '横山', '3', '0912', '719100', '中国,陕西省,榆林市,横山县', '109.295680000000', '37.958000000000', 'Hengshan');
INSERT INTO `cf_areas` VALUES ('610824', '靖边县', '610800', '靖边', '3', '0912', '718500', '中国,陕西省,榆林市,靖边县', '108.794120000000', '37.599380000000', 'Jingbian');
INSERT INTO `cf_areas` VALUES ('610825', '定边县', '610800', '定边', '3', '0912', '718600', '中国,陕西省,榆林市,定边县', '107.597930000000', '37.590370000000', 'Dingbian');
INSERT INTO `cf_areas` VALUES ('610826', '绥德县', '610800', '绥德', '3', '0912', '718000', '中国,陕西省,榆林市,绥德县', '110.261260000000', '37.497780000000', 'Suide');
INSERT INTO `cf_areas` VALUES ('610827', '米脂县', '610800', '米脂', '3', '0912', '718100', '中国,陕西省,榆林市,米脂县', '110.184170000000', '37.755290000000', 'Mizhi');
INSERT INTO `cf_areas` VALUES ('610828', '佳县', '610800', '佳县', '3', '0912', '719200', '中国,陕西省,榆林市,佳县', '110.493620000000', '38.022480000000', 'Jiaxian');
INSERT INTO `cf_areas` VALUES ('610829', '吴堡县', '610800', '吴堡', '3', '0912', '718200', '中国,陕西省,榆林市,吴堡县', '110.745330000000', '37.457090000000', 'Wubu');
INSERT INTO `cf_areas` VALUES ('610830', '清涧县', '610800', '清涧', '3', '0912', '718300', '中国,陕西省,榆林市,清涧县', '110.121730000000', '37.088540000000', 'Qingjian');
INSERT INTO `cf_areas` VALUES ('610831', '子洲县', '610800', '子洲', '3', '0912', '718400', '中国,陕西省,榆林市,子洲县', '110.034880000000', '37.612380000000', 'Zizhou');
INSERT INTO `cf_areas` VALUES ('610900', '安康市', '610000', '安康', '2', '0915', '725000', '中国,陕西省,安康市', '109.029273000000', '32.690300000000', 'Ankang');
INSERT INTO `cf_areas` VALUES ('610902', '汉滨区', '610900', '汉滨', '3', '0915', '725000', '中国,陕西省,安康市,汉滨区', '109.026830000000', '32.695170000000', 'Hanbin');
INSERT INTO `cf_areas` VALUES ('610921', '汉阴县', '610900', '汉阴', '3', '0915', '725100', '中国,陕西省,安康市,汉阴县', '108.510980000000', '32.891290000000', 'Hanyin');
INSERT INTO `cf_areas` VALUES ('610922', '石泉县', '610900', '石泉', '3', '0915', '725200', '中国,陕西省,安康市,石泉县', '108.247550000000', '33.039710000000', 'Shiquan');
INSERT INTO `cf_areas` VALUES ('610923', '宁陕县', '610900', '宁陕', '3', '0915', '711600', '中国,陕西省,安康市,宁陕县', '108.315150000000', '33.317260000000', 'Ningshan');
INSERT INTO `cf_areas` VALUES ('610924', '紫阳县', '610900', '紫阳', '3', '0915', '725300', '中国,陕西省,安康市,紫阳县', '108.536800000000', '32.521150000000', 'Ziyang');
INSERT INTO `cf_areas` VALUES ('610925', '岚皋县', '610900', '岚皋', '3', '0915', '725400', '中国,陕西省,安康市,岚皋县', '108.902890000000', '32.307940000000', 'Langao');
INSERT INTO `cf_areas` VALUES ('610926', '平利县', '610900', '平利', '3', '0915', '725500', '中国,陕西省,安康市,平利县', '109.357750000000', '32.391110000000', 'Pingli');
INSERT INTO `cf_areas` VALUES ('610927', '镇坪县', '610900', '镇坪', '3', '0915', '725600', '中国,陕西省,安康市,镇坪县', '109.524560000000', '31.883300000000', 'Zhenping');
INSERT INTO `cf_areas` VALUES ('610928', '旬阳县', '610900', '旬阳', '3', '0915', '725700', '中国,陕西省,安康市,旬阳县', '109.361900000000', '32.832070000000', 'Xunyang');
INSERT INTO `cf_areas` VALUES ('610929', '白河县', '610900', '白河', '3', '0915', '725800', '中国,陕西省,安康市,白河县', '110.113150000000', '32.809550000000', 'Baihe');
INSERT INTO `cf_areas` VALUES ('611000', '商洛市', '610000', '商洛', '2', '0914', '726000', '中国,陕西省,商洛市', '109.939776000000', '33.868319000000', 'Shangluo');
INSERT INTO `cf_areas` VALUES ('611002', '商州区', '611000', '商州', '3', '0914', '726000', '中国,陕西省,商洛市,商州区', '109.941260000000', '33.862700000000', 'Shangzhou');
INSERT INTO `cf_areas` VALUES ('611021', '洛南县', '611000', '洛南', '3', '0914', '726100', '中国,陕西省,商洛市,洛南县', '110.146450000000', '34.089940000000', 'Luonan');
INSERT INTO `cf_areas` VALUES ('611022', '丹凤县', '611000', '丹凤', '3', '0914', '726200', '中国,陕西省,商洛市,丹凤县', '110.334860000000', '33.694680000000', 'Danfeng');
INSERT INTO `cf_areas` VALUES ('611023', '商南县', '611000', '商南', '3', '0914', '726300', '中国,陕西省,商洛市,商南县', '110.883750000000', '33.525810000000', 'Shangnan');
INSERT INTO `cf_areas` VALUES ('611024', '山阳县', '611000', '山阳', '3', '0914', '726400', '中国,陕西省,商洛市,山阳县', '109.887840000000', '33.529310000000', 'Shanyang');
INSERT INTO `cf_areas` VALUES ('611025', '镇安县', '611000', '镇安', '3', '0914', '711500', '中国,陕西省,商洛市,镇安县', '109.153740000000', '33.423660000000', 'Zhen\'an');
INSERT INTO `cf_areas` VALUES ('611026', '柞水县', '611000', '柞水', '3', '0914', '711400', '中国,陕西省,商洛市,柞水县', '109.111050000000', '33.683100000000', 'Zhashui');
INSERT INTO `cf_areas` VALUES ('611100', '西咸新区', '610000', '西咸', '2', '029', '712000', '中国,陕西省,西咸新区', '108.810654000000', '34.307144000000', 'Xixian');
INSERT INTO `cf_areas` VALUES ('611101', '空港新城', '611100', '空港', '3', '0374', '461000', '中国,陕西省,西咸新区,空港新城', '108.760529000000', '34.440894000000', 'Konggang');
INSERT INTO `cf_areas` VALUES ('611102', '沣东新城', '611100', '沣东', '3', '029', '710000', '中国,陕西省,西咸新区,沣东新城', '108.829880000000', '34.267431000000', 'Fengdong');
INSERT INTO `cf_areas` VALUES ('611103', '秦汉新城', '611100', '秦汉', '3', '029', '712000', '中国,陕西省,西咸新区,秦汉新城', '108.838120000000', '34.386513000000', 'Qinhan');
INSERT INTO `cf_areas` VALUES ('611104', '沣西新城', '611100', '沣西', '3', '029', '710000', '中国,陕西省,西咸新区,沣西新城', '108.712150000000', '34.190453000000', 'Fengxi');
INSERT INTO `cf_areas` VALUES ('611105', '泾河新城', '611100', '泾河', '3', '029', '713700', '中国,陕西省,西咸新区,泾河新城', '109.049603000000', '34.460587000000', 'Jinghe');
INSERT INTO `cf_areas` VALUES ('620000', '甘肃省', '100000', '甘肃', '1', '', '', '中国,甘肃省', '103.823557000000', '36.058039000000', 'Gansu');
INSERT INTO `cf_areas` VALUES ('620100', '兰州市', '620000', '兰州', '2', '0931', '730030', '中国,甘肃省,兰州市', '103.823557000000', '36.058039000000', 'Lanzhou');
INSERT INTO `cf_areas` VALUES ('620102', '城关区', '620100', '城关', '3', '0931', '730030', '中国,甘肃省,兰州市,城关区', '103.825200000000', '36.057250000000', 'Chengguan');
INSERT INTO `cf_areas` VALUES ('620103', '七里河区', '620100', '七里河', '3', '0931', '730050', '中国,甘肃省,兰州市,七里河区', '103.785640000000', '36.065850000000', 'Qilihe');
INSERT INTO `cf_areas` VALUES ('620104', '西固区', '620100', '西固', '3', '0931', '730060', '中国,甘肃省,兰州市,西固区', '103.628110000000', '36.088580000000', 'Xigu');
INSERT INTO `cf_areas` VALUES ('620105', '安宁区', '620100', '安宁', '3', '0931', '730070', '中国,甘肃省,兰州市,安宁区', '103.718900000000', '36.103840000000', 'Anning');
INSERT INTO `cf_areas` VALUES ('620111', '红古区', '620100', '红古', '3', '0931', '730084', '中国,甘肃省,兰州市,红古区', '102.859550000000', '36.345370000000', 'Honggu');
INSERT INTO `cf_areas` VALUES ('620121', '永登县', '620100', '永登', '3', '0931', '730300', '中国,甘肃省,兰州市,永登县', '103.260550000000', '36.735220000000', 'Yongdeng');
INSERT INTO `cf_areas` VALUES ('620122', '皋兰县', '620100', '皋兰', '3', '0931', '730200', '中国,甘肃省,兰州市,皋兰县', '103.945060000000', '36.332150000000', 'Gaolan');
INSERT INTO `cf_areas` VALUES ('620123', '榆中县', '620100', '榆中', '3', '0931', '730100', '中国,甘肃省,兰州市,榆中县', '104.114500000000', '35.844150000000', 'Yuzhong');
INSERT INTO `cf_areas` VALUES ('620200', '嘉峪关市', '620000', '嘉峪关', '2', '0937', '735100', '中国,甘肃省,嘉峪关市', '98.277304000000', '39.786529000000', 'Jiayuguan');
INSERT INTO `cf_areas` VALUES ('620201', '雄关区', '620200', '雄关', '3', '0937', '735100', '中国,甘肃省,嘉峪关市,雄关区', '98.277398000000', '39.779250000000', 'Xiongguan');
INSERT INTO `cf_areas` VALUES ('620202', '长城区', '620200', '长城', '3', '0937', '735106', '中国,甘肃省,嘉峪关市,长城区', '98.273523000000', '39.787431000000', 'Changcheng');
INSERT INTO `cf_areas` VALUES ('620203', '镜铁区', '620200', '镜铁', '3', '0937', '735100', '中国,甘肃省,嘉峪关市,镜铁区', '98.277304000000', '39.786529000000', 'Jingtie');
INSERT INTO `cf_areas` VALUES ('620300', '金昌市', '620000', '金昌', '2', '0935', '737100', '中国,甘肃省,金昌市', '102.187888000000', '38.514238000000', 'Jinchang');
INSERT INTO `cf_areas` VALUES ('620302', '金川区', '620300', '金川', '3', '0935', '737100', '中国,甘肃省,金昌市,金川区', '102.193760000000', '38.521010000000', 'Jinchuan');
INSERT INTO `cf_areas` VALUES ('620321', '永昌县', '620300', '永昌', '3', '0935', '737200', '中国,甘肃省,金昌市,永昌县', '101.972220000000', '38.247110000000', 'Yongchang');
INSERT INTO `cf_areas` VALUES ('620400', '白银市', '620000', '白银', '2', '0943', '730900', '中国,甘肃省,白银市', '104.173606000000', '36.545680000000', 'Baiyin');
INSERT INTO `cf_areas` VALUES ('620402', '白银区', '620400', '白银', '3', '0943', '730900', '中国,甘肃省,白银市,白银区', '104.173550000000', '36.544110000000', 'Baiyin');
INSERT INTO `cf_areas` VALUES ('620403', '平川区', '620400', '平川', '3', '0943', '730913', '中国,甘肃省,白银市,平川区', '104.824980000000', '36.727700000000', 'Pingchuan');
INSERT INTO `cf_areas` VALUES ('620421', '靖远县', '620400', '靖远', '3', '0943', '730600', '中国,甘肃省,白银市,靖远县', '104.683250000000', '36.566020000000', 'Jingyuan');
INSERT INTO `cf_areas` VALUES ('620422', '会宁县', '620400', '会宁', '3', '0943', '730700', '中国,甘肃省,白银市,会宁县', '105.052970000000', '35.696260000000', 'Huining');
INSERT INTO `cf_areas` VALUES ('620423', '景泰县', '620400', '景泰', '3', '0943', '730400', '中国,甘肃省,白银市,景泰县', '104.062950000000', '37.183590000000', 'Jingtai');
INSERT INTO `cf_areas` VALUES ('620500', '天水市', '620000', '天水', '2', '0938', '741000', '中国,甘肃省,天水市', '105.724998000000', '34.578529000000', 'Tianshui');
INSERT INTO `cf_areas` VALUES ('620502', '秦州区', '620500', '秦州', '3', '0938', '741000', '中国,甘肃省,天水市,秦州区', '105.724210000000', '34.580890000000', 'Qinzhou');
INSERT INTO `cf_areas` VALUES ('620503', '麦积区', '620500', '麦积', '3', '0938', '741020', '中国,甘肃省,天水市,麦积区', '105.890130000000', '34.570690000000', 'Maiji');
INSERT INTO `cf_areas` VALUES ('620521', '清水县', '620500', '清水', '3', '0938', '741400', '中国,甘肃省,天水市,清水县', '106.136710000000', '34.750320000000', 'Qingshui');
INSERT INTO `cf_areas` VALUES ('620522', '秦安县', '620500', '秦安', '3', '0938', '741600', '中国,甘肃省,天水市,秦安县', '105.669550000000', '34.858940000000', 'Qin\'an');
INSERT INTO `cf_areas` VALUES ('620523', '甘谷县', '620500', '甘谷', '3', '0938', '741200', '中国,甘肃省,天水市,甘谷县', '105.332910000000', '34.736650000000', 'Gangu');
INSERT INTO `cf_areas` VALUES ('620524', '武山县', '620500', '武山', '3', '0938', '741300', '中国,甘肃省,天水市,武山县', '104.883820000000', '34.721230000000', 'Wushan');
INSERT INTO `cf_areas` VALUES ('620525', '张家川回族自治县', '620500', '张家川', '3', '0938', '741500', '中国,甘肃省,天水市,张家川回族自治县', '106.215820000000', '34.995820000000', 'Zhangjiachuan');
INSERT INTO `cf_areas` VALUES ('620600', '武威市', '620000', '武威', '2', '0935', '733000', '中国,甘肃省,武威市', '102.634697000000', '37.929996000000', 'Wuwei');
INSERT INTO `cf_areas` VALUES ('620602', '凉州区', '620600', '凉州', '3', '0935', '733000', '中国,甘肃省,武威市,凉州区', '102.642030000000', '37.928320000000', 'Liangzhou');
INSERT INTO `cf_areas` VALUES ('620621', '民勤县', '620600', '民勤', '3', '0935', '733300', '中国,甘肃省,武威市,民勤县', '103.090110000000', '38.624870000000', 'Minqin');
INSERT INTO `cf_areas` VALUES ('620622', '古浪县', '620600', '古浪', '3', '0935', '733100', '中国,甘肃省,武威市,古浪县', '102.891540000000', '37.465080000000', 'Gulang');
INSERT INTO `cf_areas` VALUES ('620623', '天祝藏族自治县', '620600', '天祝', '3', '0935', '733200', '中国,甘肃省,武威市,天祝藏族自治县', '103.136100000000', '36.977150000000', 'Tianzhu');
INSERT INTO `cf_areas` VALUES ('620700', '张掖市', '620000', '张掖', '2', '0936', '734000', '中国,甘肃省,张掖市', '100.455472000000', '38.932897000000', 'Zhangye');
INSERT INTO `cf_areas` VALUES ('620702', '甘州区', '620700', '甘州', '3', '0936', '734000', '中国,甘肃省,张掖市,甘州区', '100.452700000000', '38.929470000000', 'Ganzhou');
INSERT INTO `cf_areas` VALUES ('620721', '肃南裕固族自治县', '620700', '肃南', '3', '0936', '734400', '中国,甘肃省,张掖市,肃南裕固族自治县', '99.614070000000', '38.837760000000', 'Sunan');
INSERT INTO `cf_areas` VALUES ('620722', '民乐县', '620700', '民乐', '3', '0936', '734500', '中国,甘肃省,张掖市,民乐县', '100.810910000000', '38.434790000000', 'Minle');
INSERT INTO `cf_areas` VALUES ('620723', '临泽县', '620700', '临泽', '3', '0936', '734200', '中国,甘肃省,张掖市,临泽县', '100.164450000000', '39.152520000000', 'Linze');
INSERT INTO `cf_areas` VALUES ('620724', '高台县', '620700', '高台', '3', '0936', '734300', '中国,甘肃省,张掖市,高台县', '99.819180000000', '39.378290000000', 'Gaotai');
INSERT INTO `cf_areas` VALUES ('620725', '山丹县', '620700', '山丹', '3', '0936', '734100', '中国,甘肃省,张掖市,山丹县', '101.093590000000', '38.784680000000', 'Shandan');
INSERT INTO `cf_areas` VALUES ('620800', '平凉市', '620000', '平凉', '2', '0933', '744000', '中国,甘肃省,平凉市', '106.684691000000', '35.542790000000', 'Pingliang');
INSERT INTO `cf_areas` VALUES ('620802', '崆峒区', '620800', '崆峒', '3', '0933', '744000', '中国,甘肃省,平凉市,崆峒区', '106.674830000000', '35.542620000000', 'Kongtong');
INSERT INTO `cf_areas` VALUES ('620821', '泾川县', '620800', '泾川', '3', '0933', '744300', '中国,甘肃省,平凉市,泾川县', '107.365810000000', '35.332230000000', 'Jingchuan');
INSERT INTO `cf_areas` VALUES ('620822', '灵台县', '620800', '灵台', '3', '0933', '744400', '中国,甘肃省,平凉市,灵台县', '107.617400000000', '35.067680000000', 'Lingtai');
INSERT INTO `cf_areas` VALUES ('620823', '崇信县', '620800', '崇信', '3', '0933', '744200', '中国,甘肃省,平凉市,崇信县', '107.037380000000', '35.303440000000', 'Chongxin');
INSERT INTO `cf_areas` VALUES ('620824', '华亭县', '620800', '华亭', '3', '0933', '744100', '中国,甘肃省,平凉市,华亭县', '106.654630000000', '35.218300000000', 'Huating');
INSERT INTO `cf_areas` VALUES ('620825', '庄浪县', '620800', '庄浪', '3', '0933', '744600', '中国,甘肃省,平凉市,庄浪县', '106.036620000000', '35.202350000000', 'Zhuanglang');
INSERT INTO `cf_areas` VALUES ('620826', '静宁县', '620800', '静宁', '3', '0933', '743400', '中国,甘肃省,平凉市,静宁县', '105.727230000000', '35.519910000000', 'Jingning');
INSERT INTO `cf_areas` VALUES ('620900', '酒泉市', '620000', '酒泉', '2', '0937', '735000', '中国,甘肃省,酒泉市', '98.510795000000', '39.744023000000', 'Jiuquan');
INSERT INTO `cf_areas` VALUES ('620902', '肃州区', '620900', '肃州', '3', '0937', '735000', '中国,甘肃省,酒泉市,肃州区', '98.507750000000', '39.745060000000', 'Suzhou');
INSERT INTO `cf_areas` VALUES ('620921', '金塔县', '620900', '金塔', '3', '0937', '735300', '中国,甘肃省,酒泉市,金塔县', '98.900020000000', '39.977330000000', 'Jinta');
INSERT INTO `cf_areas` VALUES ('620922', '瓜州县', '620900', '瓜州', '3', '0937', '736100', '中国,甘肃省,酒泉市,瓜州县', '95.782710000000', '40.515480000000', 'Guazhou');
INSERT INTO `cf_areas` VALUES ('620923', '肃北蒙古族自治县', '620900', '肃北', '3', '0937', '736300', '中国,甘肃省,酒泉市,肃北蒙古族自治县', '94.876490000000', '39.512140000000', 'Subei');
INSERT INTO `cf_areas` VALUES ('620924', '阿克塞哈萨克族自治县', '620900', '阿克塞', '3', '0937', '736400', '中国,甘肃省,酒泉市,阿克塞哈萨克族自治县', '94.340970000000', '39.634350000000', 'Akesai');
INSERT INTO `cf_areas` VALUES ('620981', '玉门市', '620900', '玉门', '3', '0937', '735200', '中国,甘肃省,酒泉市,玉门市', '97.045380000000', '40.291720000000', 'Yumen');
INSERT INTO `cf_areas` VALUES ('620982', '敦煌市', '620900', '敦煌', '3', '0937', '736200', '中国,甘肃省,酒泉市,敦煌市', '94.661590000000', '40.142110000000', 'Dunhuang');
INSERT INTO `cf_areas` VALUES ('621000', '庆阳市', '620000', '庆阳', '2', '0934', '745000', '中国,甘肃省,庆阳市', '107.638372000000', '35.734218000000', 'Qingyang');
INSERT INTO `cf_areas` VALUES ('621002', '西峰区', '621000', '西峰', '3', '0934', '745000', '中国,甘肃省,庆阳市,西峰区', '107.651070000000', '35.730650000000', 'Xifeng');
INSERT INTO `cf_areas` VALUES ('621021', '庆城县', '621000', '庆城', '3', '0934', '745100', '中国,甘肃省,庆阳市,庆城县', '107.882720000000', '36.015070000000', 'Qingcheng');
INSERT INTO `cf_areas` VALUES ('621022', '环县', '621000', '环县', '3', '0934', '745700', '中国,甘肃省,庆阳市,环县', '107.308350000000', '36.568460000000', 'Huanxian');
INSERT INTO `cf_areas` VALUES ('621023', '华池县', '621000', '华池', '3', '0934', '745600', '中国,甘肃省,庆阳市,华池县', '107.989100000000', '36.461080000000', 'Huachi');
INSERT INTO `cf_areas` VALUES ('621024', '合水县', '621000', '合水', '3', '0934', '745400', '中国,甘肃省,庆阳市,合水县', '108.020320000000', '35.819110000000', 'Heshui');
INSERT INTO `cf_areas` VALUES ('621025', '正宁县', '621000', '正宁', '3', '0934', '745300', '中国,甘肃省,庆阳市,正宁县', '108.360070000000', '35.491740000000', 'Zhengning');
INSERT INTO `cf_areas` VALUES ('621026', '宁县', '621000', '宁县', '3', '0934', '745200', '中国,甘肃省,庆阳市,宁县', '107.925170000000', '35.501640000000', 'Ningxian');
INSERT INTO `cf_areas` VALUES ('621027', '镇原县', '621000', '镇原', '3', '0934', '744500', '中国,甘肃省,庆阳市,镇原县', '107.199000000000', '35.677120000000', 'Zhenyuan');
INSERT INTO `cf_areas` VALUES ('621100', '定西市', '620000', '定西', '2', '0932', '743000', '中国,甘肃省,定西市', '104.626294000000', '35.579578000000', 'Dingxi');
INSERT INTO `cf_areas` VALUES ('621102', '安定区', '621100', '安定', '3', '0932', '743000', '中国,甘肃省,定西市,安定区', '104.610600000000', '35.580660000000', 'Anding');
INSERT INTO `cf_areas` VALUES ('621121', '通渭县', '621100', '通渭', '3', '0932', '743300', '中国,甘肃省,定西市,通渭县', '105.242240000000', '35.211010000000', 'Tongwei');
INSERT INTO `cf_areas` VALUES ('621122', '陇西县', '621100', '陇西', '3', '0932', '748100', '中国,甘肃省,定西市,陇西县', '104.634460000000', '35.002380000000', 'Longxi');
INSERT INTO `cf_areas` VALUES ('621123', '渭源县', '621100', '渭源', '3', '0932', '748200', '中国,甘肃省,定西市,渭源县', '104.214350000000', '35.136490000000', 'Weiyuan');
INSERT INTO `cf_areas` VALUES ('621124', '临洮县', '621100', '临洮', '3', '0932', '730500', '中国,甘肃省,定西市,临洮县', '103.861960000000', '35.375100000000', 'Lintao');
INSERT INTO `cf_areas` VALUES ('621125', '漳县', '621100', '漳县', '3', '0932', '748300', '中国,甘肃省,定西市,漳县', '104.467040000000', '34.849770000000', 'Zhangxian');
INSERT INTO `cf_areas` VALUES ('621126', '岷县', '621100', '岷县', '3', '0932', '748400', '中国,甘肃省,定西市,岷县', '104.037720000000', '34.434440000000', 'Minxian');
INSERT INTO `cf_areas` VALUES ('621200', '陇南市', '620000', '陇南', '2', '0939', '746000', '中国,甘肃省,陇南市', '104.929379000000', '33.388598000000', 'Longnan');
INSERT INTO `cf_areas` VALUES ('621202', '武都区', '621200', '武都', '3', '0939', '746000', '中国,甘肃省,陇南市,武都区', '104.926520000000', '33.392390000000', 'Wudu');
INSERT INTO `cf_areas` VALUES ('621221', '成县', '621200', '成县', '3', '0939', '742500', '中国,甘肃省,陇南市,成县', '105.725860000000', '33.739250000000', 'Chengxian');
INSERT INTO `cf_areas` VALUES ('621222', '文县', '621200', '文县', '3', '0939', '746400', '中国,甘肃省,陇南市,文县', '104.683620000000', '32.943370000000', 'Wenxian');
INSERT INTO `cf_areas` VALUES ('621223', '宕昌县', '621200', '宕昌', '3', '0939', '748500', '中国,甘肃省,陇南市,宕昌县', '104.393490000000', '34.047320000000', 'Dangchang');
INSERT INTO `cf_areas` VALUES ('621224', '康县', '621200', '康县', '3', '0939', '746500', '中国,甘肃省,陇南市,康县', '105.607110000000', '33.329120000000', 'Kangxian');
INSERT INTO `cf_areas` VALUES ('621225', '西和县', '621200', '西和', '3', '0939', '742100', '中国,甘肃省,陇南市,西和县', '105.300990000000', '34.014320000000', 'Xihe');
INSERT INTO `cf_areas` VALUES ('621226', '礼县', '621200', '礼县', '3', '0939', '742200', '中国,甘肃省,陇南市,礼县', '105.177850000000', '34.189350000000', 'Lixian');
INSERT INTO `cf_areas` VALUES ('621227', '徽县', '621200', '徽县', '3', '0939', '742300', '中国,甘肃省,陇南市,徽县', '106.085290000000', '33.768980000000', 'Huixian');
INSERT INTO `cf_areas` VALUES ('621228', '两当县', '621200', '两当', '3', '0939', '742400', '中国,甘肃省,陇南市,两当县', '106.304840000000', '33.909600000000', 'Liangdang');
INSERT INTO `cf_areas` VALUES ('622900', '临夏回族自治州', '620000', '临夏', '2', '0930', '731100', '中国,甘肃省,临夏回族自治州', '103.212006000000', '35.599446000000', 'Linxia');
INSERT INTO `cf_areas` VALUES ('622901', '临夏市', '622900', '临夏', '3', '0930', '731100', '中国,甘肃省,临夏回族自治州,临夏市', '103.210000000000', '35.599160000000', 'Linxia');
INSERT INTO `cf_areas` VALUES ('622921', '临夏县', '622900', '临夏', '3', '0930', '731800', '中国,甘肃省,临夏回族自治州,临夏县', '102.993800000000', '35.495190000000', 'Linxia');
INSERT INTO `cf_areas` VALUES ('622922', '康乐县', '622900', '康乐', '3', '0930', '731500', '中国,甘肃省,临夏回族自治州,康乐县', '103.710930000000', '35.372190000000', 'Kangle');
INSERT INTO `cf_areas` VALUES ('622923', '永靖县', '622900', '永靖', '3', '0930', '731600', '中国,甘肃省,临夏回族自治州,永靖县', '103.320430000000', '35.938350000000', 'Yongjing');
INSERT INTO `cf_areas` VALUES ('622924', '广河县', '622900', '广河', '3', '0930', '731300', '中国,甘肃省,临夏回族自治州,广河县', '103.569330000000', '35.480970000000', 'Guanghe');
INSERT INTO `cf_areas` VALUES ('622925', '和政县', '622900', '和政', '3', '0930', '731200', '中国,甘肃省,临夏回族自治州,和政县', '103.349360000000', '35.425920000000', 'Hezheng');
INSERT INTO `cf_areas` VALUES ('622926', '东乡族自治县', '622900', '东乡族', '3', '0930', '731400', '中国,甘肃省,临夏回族自治州,东乡族自治县', '103.394770000000', '35.664710000000', 'Dongxiangzu');
INSERT INTO `cf_areas` VALUES ('622927', '积石山保安族东乡族撒拉族自治县', '622900', '积石山', '3', '0930', '731700', '中国,甘肃省,临夏回族自治州,积石山保安族东乡族撒拉族自治县', '102.873740000000', '35.718200000000', 'Jishishan');
INSERT INTO `cf_areas` VALUES ('623000', '甘南藏族自治州', '620000', '甘南', '2', '0941', '747000', '中国,甘肃省,甘南藏族自治州', '102.911008000000', '34.986354000000', 'Gannan');
INSERT INTO `cf_areas` VALUES ('623001', '合作市', '623000', '合作', '3', '0941', '747000', '中国,甘肃省,甘南藏族自治州,合作市', '102.910820000000', '35.000160000000', 'Hezuo');
INSERT INTO `cf_areas` VALUES ('623021', '临潭县', '623000', '临潭', '3', '0941', '747500', '中国,甘肃省,甘南藏族自治州,临潭县', '103.352870000000', '34.695150000000', 'Lintan');
INSERT INTO `cf_areas` VALUES ('623022', '卓尼县', '623000', '卓尼', '3', '0941', '747600', '中国,甘肃省,甘南藏族自治州,卓尼县', '103.508110000000', '34.589190000000', 'Zhuoni');
INSERT INTO `cf_areas` VALUES ('623023', '舟曲县', '623000', '舟曲', '3', '0941', '746300', '中国,甘肃省,甘南藏族自治州,舟曲县', '104.371550000000', '33.784680000000', 'Zhouqu');
INSERT INTO `cf_areas` VALUES ('623024', '迭部县', '623000', '迭部', '3', '0941', '747400', '中国,甘肃省,甘南藏族自治州,迭部县', '103.222740000000', '34.056230000000', 'Diebu');
INSERT INTO `cf_areas` VALUES ('623025', '玛曲县', '623000', '玛曲', '3', '0941', '747300', '中国,甘肃省,甘南藏族自治州,玛曲县', '102.075400000000', '33.997000000000', 'Maqu');
INSERT INTO `cf_areas` VALUES ('623026', '碌曲县', '623000', '碌曲', '3', '0941', '747200', '中国,甘肃省,甘南藏族自治州,碌曲县', '102.491760000000', '34.588720000000', 'Luqu');
INSERT INTO `cf_areas` VALUES ('623027', '夏河县', '623000', '夏河', '3', '0941', '747100', '中国,甘肃省,甘南藏族自治州,夏河县', '102.522150000000', '35.204870000000', 'Xiahe');
INSERT INTO `cf_areas` VALUES ('630000', '青海省', '100000', '青海', '1', '', '', '中国,青海省', '101.778916000000', '36.623178000000', 'Qinghai');
INSERT INTO `cf_areas` VALUES ('630100', '西宁市', '630000', '西宁', '2', '0971', '810000', '中国,青海省,西宁市', '101.778916000000', '36.623178000000', 'Xining');
INSERT INTO `cf_areas` VALUES ('630102', '城东区', '630100', '城东', '3', '0971', '810007', '中国,青海省,西宁市,城东区', '101.803730000000', '36.599690000000', 'Chengdong');
INSERT INTO `cf_areas` VALUES ('630103', '城中区', '630100', '城中', '3', '0971', '810000', '中国,青海省,西宁市,城中区', '101.783940000000', '36.622790000000', 'Chengzhong');
INSERT INTO `cf_areas` VALUES ('630104', '城西区', '630100', '城西', '3', '0971', '810001', '中国,青海省,西宁市,城西区', '101.765880000000', '36.628280000000', 'Chengxi');
INSERT INTO `cf_areas` VALUES ('630105', '城北区', '630100', '城北', '3', '0971', '810003', '中国,青海省,西宁市,城北区', '101.766200000000', '36.650140000000', 'Chengbei');
INSERT INTO `cf_areas` VALUES ('630121', '大通回族土族自治县', '630100', '大通', '3', '0971', '810100', '中国,青海省,西宁市,大通回族土族自治县', '101.702360000000', '36.934890000000', 'Datong');
INSERT INTO `cf_areas` VALUES ('630122', '湟中县', '630100', '湟中', '3', '0971', '811600', '中国,青海省,西宁市,湟中县', '101.571590000000', '36.500830000000', 'Huangzhong');
INSERT INTO `cf_areas` VALUES ('630123', '湟源县', '630100', '湟源', '3', '0971', '812100', '中国,青海省,西宁市,湟源县', '101.256430000000', '36.682430000000', 'Huangyuan');
INSERT INTO `cf_areas` VALUES ('630200', '海东市', '630000', '海东', '2', '0972', '810700', '中国,青海省,海东市', '102.103270000000', '36.502916000000', 'Haidong');
INSERT INTO `cf_areas` VALUES ('630202', '乐都区', '630200', '乐都', '3', '0972', '810700', '中国,青海省,海东市,乐都区', '102.402431000000', '36.480291000000', 'Ledu');
INSERT INTO `cf_areas` VALUES ('630221', '平安县', '630200', '平安', '3', '0972', '810600', '中国,青海省,海东市,平安县', '102.104295000000', '36.502714000000', 'Ping\'an');
INSERT INTO `cf_areas` VALUES ('630222', '民和回族土族自治县', '630200', '民和', '3', '0972', '810800', '中国,青海省,海东市,民和回族土族自治县', '102.804209000000', '36.329451000000', 'Minhe');
INSERT INTO `cf_areas` VALUES ('630223', '互助土族自治县', '630200', '互助', '3', '0972', '810500', '中国,青海省,海东市,互助土族自治县', '101.956734000000', '36.839940000000', 'Huzhu');
INSERT INTO `cf_areas` VALUES ('630224', '化隆回族自治县', '630200', '化隆', '3', '0972', '810900', '中国,青海省,海东市,化隆回族自治县', '102.262329000000', '36.098322000000', 'Hualong');
INSERT INTO `cf_areas` VALUES ('630225', '循化撒拉族自治县', '630200', '循化', '3', '0972', '811100', '中国,青海省,海东市,循化撒拉族自治县', '102.486534000000', '35.847247000000', 'Xunhua');
INSERT INTO `cf_areas` VALUES ('632200', '海北藏族自治州', '630000', '海北', '2', '0970', '812200', '中国,青海省,海北藏族自治州', '100.901059000000', '36.959435000000', 'Haibei');
INSERT INTO `cf_areas` VALUES ('632221', '门源回族自治县', '632200', '门源', '3', '0970', '810300', '中国,青海省,海北藏族自治州,门源回族自治县', '101.622280000000', '37.376110000000', 'Menyuan');
INSERT INTO `cf_areas` VALUES ('632222', '祁连县', '632200', '祁连', '3', '0970', '810400', '中国,青海省,海北藏族自治州,祁连县', '100.246180000000', '38.179010000000', 'Qilian');
INSERT INTO `cf_areas` VALUES ('632223', '海晏县', '632200', '海晏', '3', '0970', '812200', '中国,青海省,海北藏族自治州,海晏县', '100.992700000000', '36.899020000000', 'Haiyan');
INSERT INTO `cf_areas` VALUES ('632224', '刚察县', '632200', '刚察', '3', '0970', '812300', '中国,青海省,海北藏族自治州,刚察县', '100.146750000000', '37.321610000000', 'Gangcha');
INSERT INTO `cf_areas` VALUES ('632300', '黄南藏族自治州', '630000', '黄南', '2', '0973', '811300', '中国,青海省,黄南藏族自治州', '102.019988000000', '35.517744000000', 'Huangnan');
INSERT INTO `cf_areas` VALUES ('632321', '同仁县', '632300', '同仁', '3', '0973', '811300', '中国,青海省,黄南藏族自治州,同仁县', '102.018400000000', '35.516030000000', 'Tongren');
INSERT INTO `cf_areas` VALUES ('632322', '尖扎县', '632300', '尖扎', '3', '0973', '811200', '中国,青海省,黄南藏族自治州,尖扎县', '102.034110000000', '35.939470000000', 'Jianzha');
INSERT INTO `cf_areas` VALUES ('632323', '泽库县', '632300', '泽库', '3', '0973', '811400', '中国,青海省,黄南藏族自治州,泽库县', '101.464440000000', '35.035190000000', 'Zeku');
INSERT INTO `cf_areas` VALUES ('632324', '河南蒙古族自治县', '632300', '河南', '3', '0973', '811500', '中国,青海省,黄南藏族自治州,河南蒙古族自治县', '101.608640000000', '34.734760000000', 'Henan');
INSERT INTO `cf_areas` VALUES ('632500', '海南藏族自治州', '630000', '海南', '2', '0974', '813000', '中国,青海省,海南藏族自治州', '100.619542000000', '36.280353000000', 'Hainan');
INSERT INTO `cf_areas` VALUES ('632521', '共和县', '632500', '共和', '3', '0974', '813000', '中国,青海省,海南藏族自治州,共和县', '100.620030000000', '36.284100000000', 'Gonghe');
INSERT INTO `cf_areas` VALUES ('632522', '同德县', '632500', '同德', '3', '0974', '813200', '中国,青海省,海南藏族自治州,同德县', '100.571590000000', '35.254880000000', 'Tongde');
INSERT INTO `cf_areas` VALUES ('632523', '贵德县', '632500', '贵德', '3', '0974', '811700', '中国,青海省,海南藏族自治州,贵德县', '101.432000000000', '36.044000000000', 'Guide');
INSERT INTO `cf_areas` VALUES ('632524', '兴海县', '632500', '兴海', '3', '0974', '813300', '中国,青海省,海南藏族自治州,兴海县', '99.988460000000', '35.590310000000', 'Xinghai');
INSERT INTO `cf_areas` VALUES ('632525', '贵南县', '632500', '贵南', '3', '0974', '813100', '中国,青海省,海南藏族自治州,贵南县', '100.747160000000', '35.586670000000', 'Guinan');
INSERT INTO `cf_areas` VALUES ('632600', '果洛藏族自治州', '630000', '果洛', '2', '0975', '814000', '中国,青海省,果洛藏族自治州', '100.242143000000', '34.473600000000', 'Golog');
INSERT INTO `cf_areas` VALUES ('632621', '玛沁县', '632600', '玛沁', '3', '0975', '814000', '中国,青海省,果洛藏族自治州,玛沁县', '100.239010000000', '34.477460000000', 'Maqin');
INSERT INTO `cf_areas` VALUES ('632622', '班玛县', '632600', '班玛', '3', '0975', '814300', '中国,青海省,果洛藏族自治州,班玛县', '100.737450000000', '32.932530000000', 'Banma');
INSERT INTO `cf_areas` VALUES ('632623', '甘德县', '632600', '甘德', '3', '0975', '814100', '中国,青海省,果洛藏族自治州,甘德县', '99.902460000000', '33.968380000000', 'Gande');
INSERT INTO `cf_areas` VALUES ('632624', '达日县', '632600', '达日', '3', '0975', '814200', '中国,青海省,果洛藏族自治州,达日县', '99.651790000000', '33.751930000000', 'Dari');
INSERT INTO `cf_areas` VALUES ('632625', '久治县', '632600', '久治', '3', '0975', '624700', '中国,青海省,果洛藏族自治州,久治县', '101.483420000000', '33.429890000000', 'Jiuzhi');
INSERT INTO `cf_areas` VALUES ('632626', '玛多县', '632600', '玛多', '3', '0975', '813500', '中国,青海省,果洛藏族自治州,玛多县', '98.209960000000', '34.915670000000', 'Maduo');
INSERT INTO `cf_areas` VALUES ('632700', '玉树藏族自治州', '630000', '玉树', '2', '0976', '815000', '中国,青海省,玉树藏族自治州', '97.008522000000', '33.004049000000', 'Yushu');
INSERT INTO `cf_areas` VALUES ('632701', '玉树市', '632700', '玉树', '3', '0976', '815000', '中国,青海省,玉树藏族自治州,玉树市', '97.008762000000', '33.003930000000', 'Yushu');
INSERT INTO `cf_areas` VALUES ('632722', '杂多县', '632700', '杂多', '3', '0976', '815300', '中国,青海省,玉树藏族自治州,杂多县', '95.298640000000', '32.893180000000', 'Zaduo');
INSERT INTO `cf_areas` VALUES ('632723', '称多县', '632700', '称多', '3', '0976', '815100', '中国,青海省,玉树藏族自治州,称多县', '97.107880000000', '33.368990000000', 'Chenduo');
INSERT INTO `cf_areas` VALUES ('632724', '治多县', '632700', '治多', '3', '0976', '815400', '中国,青海省,玉树藏族自治州,治多县', '95.615720000000', '33.852800000000', 'Zhiduo');
INSERT INTO `cf_areas` VALUES ('632725', '囊谦县', '632700', '囊谦', '3', '0976', '815200', '中国,青海省,玉树藏族自治州,囊谦县', '96.477530000000', '32.203590000000', 'Nangqian');
INSERT INTO `cf_areas` VALUES ('632726', '曲麻莱县', '632700', '曲麻莱', '3', '0976', '815500', '中国,青海省,玉树藏族自治州,曲麻莱县', '95.797570000000', '34.126090000000', 'Qumalai');
INSERT INTO `cf_areas` VALUES ('632800', '海西蒙古族藏族自治州', '630000', '海西', '2', '0977', '817000', '中国,青海省,海西蒙古族藏族自治州', '97.370785000000', '37.374663000000', 'Haixi');
INSERT INTO `cf_areas` VALUES ('632801', '格尔木市', '632800', '格尔木', '3', '0977', '816000', '中国,青海省,海西蒙古族藏族自治州,格尔木市', '94.903290000000', '36.402360000000', 'Geermu');
INSERT INTO `cf_areas` VALUES ('632802', '德令哈市', '632800', '德令哈', '3', '0977', '817000', '中国,青海省,海西蒙古族藏族自治州,德令哈市', '97.360840000000', '37.369460000000', 'Delingha');
INSERT INTO `cf_areas` VALUES ('632821', '乌兰县', '632800', '乌兰', '3', '0977', '817100', '中国,青海省,海西蒙古族藏族自治州,乌兰县', '98.481960000000', '36.934710000000', 'Wulan');
INSERT INTO `cf_areas` VALUES ('632822', '都兰县', '632800', '都兰', '3', '0977', '816100', '中国,青海省,海西蒙古族藏族自治州,都兰县', '98.092280000000', '36.301350000000', 'Dulan');
INSERT INTO `cf_areas` VALUES ('632823', '天峻县', '632800', '天峻', '3', '0977', '817200', '中国,青海省,海西蒙古族藏族自治州,天峻县', '99.024530000000', '37.303260000000', 'Tianjun');
INSERT INTO `cf_areas` VALUES ('640000', '宁夏回族自治区', '100000', '宁夏', '1', '', '', '中国,宁夏回族自治区', '106.278179000000', '38.466370000000', 'Ningxia');
INSERT INTO `cf_areas` VALUES ('640100', '银川市', '640000', '银川', '2', '0951', '750004', '中国,宁夏回族自治区,银川市', '106.278179000000', '38.466370000000', 'Yinchuan');
INSERT INTO `cf_areas` VALUES ('640104', '兴庆区', '640100', '兴庆', '3', '0951', '750001', '中国,宁夏回族自治区,银川市,兴庆区', '106.288720000000', '38.473920000000', 'Xingqing');
INSERT INTO `cf_areas` VALUES ('640105', '西夏区', '640100', '西夏', '3', '0951', '750021', '中国,宁夏回族自治区,银川市,西夏区', '106.150230000000', '38.491370000000', 'Xixia');
INSERT INTO `cf_areas` VALUES ('640106', '金凤区', '640100', '金凤', '3', '0951', '750011', '中国,宁夏回族自治区,银川市,金凤区', '106.242610000000', '38.472940000000', 'Jinfeng');
INSERT INTO `cf_areas` VALUES ('640121', '永宁县', '640100', '永宁', '3', '0951', '750100', '中国,宁夏回族自治区,银川市,永宁县', '106.251700000000', '38.275590000000', 'Yongning');
INSERT INTO `cf_areas` VALUES ('640122', '贺兰县', '640100', '贺兰', '3', '0951', '750200', '中国,宁夏回族自治区,银川市,贺兰县', '106.349820000000', '38.554400000000', 'Helan');
INSERT INTO `cf_areas` VALUES ('640181', '灵武市', '640100', '灵武', '3', '0951', '750004', '中国,宁夏回族自治区,银川市,灵武市', '106.339990000000', '38.102660000000', 'Lingwu');
INSERT INTO `cf_areas` VALUES ('640200', '石嘴山市', '640000', '石嘴山', '2', '0952', '753000', '中国,宁夏回族自治区,石嘴山市', '106.376173000000', '39.013330000000', 'Shizuishan');
INSERT INTO `cf_areas` VALUES ('640202', '大武口区', '640200', '大武口', '3', '0952', '753000', '中国,宁夏回族自治区,石嘴山市,大武口区', '106.377170000000', '39.012260000000', 'Dawukou');
INSERT INTO `cf_areas` VALUES ('640205', '惠农区', '640200', '惠农', '3', '0952', '753600', '中国,宁夏回族自治区,石嘴山市,惠农区', '106.711450000000', '39.131930000000', 'Huinong');
INSERT INTO `cf_areas` VALUES ('640221', '平罗县', '640200', '平罗', '3', '0952', '753400', '中国,宁夏回族自治区,石嘴山市,平罗县', '106.545380000000', '38.904290000000', 'Pingluo');
INSERT INTO `cf_areas` VALUES ('640300', '吴忠市', '640000', '吴忠', '2', '0953', '751100', '中国,宁夏回族自治区,吴忠市', '106.199409000000', '37.986165000000', 'Wuzhong');
INSERT INTO `cf_areas` VALUES ('640302', '利通区', '640300', '利通', '3', '0953', '751100', '中国,宁夏回族自治区,吴忠市,利通区', '106.203110000000', '37.985120000000', 'Litong');
INSERT INTO `cf_areas` VALUES ('640303', '红寺堡区', '640300', '红寺堡', '3', '0953', '751900', '中国,宁夏回族自治区,吴忠市,红寺堡区', '106.198220000000', '37.997470000000', 'Hongsibao');
INSERT INTO `cf_areas` VALUES ('640323', '盐池县', '640300', '盐池', '3', '0953', '751500', '中国,宁夏回族自治区,吴忠市,盐池县', '107.407070000000', '37.783300000000', 'Yanchi');
INSERT INTO `cf_areas` VALUES ('640324', '同心县', '640300', '同心', '3', '0953', '751300', '中国,宁夏回族自治区,吴忠市,同心县', '105.914180000000', '36.981160000000', 'Tongxin');
INSERT INTO `cf_areas` VALUES ('640381', '青铜峡市', '640300', '青铜峡', '3', '0953', '751600', '中国,宁夏回族自治区,吴忠市,青铜峡市', '106.074890000000', '38.020040000000', 'Qingtongxia');
INSERT INTO `cf_areas` VALUES ('640400', '固原市', '640000', '固原', '2', '0954', '756000', '中国,宁夏回族自治区,固原市', '106.285241000000', '36.004561000000', 'Guyuan');
INSERT INTO `cf_areas` VALUES ('640402', '原州区', '640400', '原州', '3', '0954', '756000', '中国,宁夏回族自治区,固原市,原州区', '106.287780000000', '36.003740000000', 'Yuanzhou');
INSERT INTO `cf_areas` VALUES ('640422', '西吉县', '640400', '西吉', '3', '0954', '756200', '中国,宁夏回族自治区,固原市,西吉县', '105.731070000000', '35.966160000000', 'Xiji');
INSERT INTO `cf_areas` VALUES ('640423', '隆德县', '640400', '隆德', '3', '0954', '756300', '中国,宁夏回族自治区,固原市,隆德县', '106.124260000000', '35.617180000000', 'Longde');
INSERT INTO `cf_areas` VALUES ('640424', '泾源县', '640400', '泾源', '3', '0954', '756400', '中国,宁夏回族自治区,固原市,泾源县', '106.339020000000', '35.490720000000', 'Jingyuan');
INSERT INTO `cf_areas` VALUES ('640425', '彭阳县', '640400', '彭阳', '3', '0954', '756500', '中国,宁夏回族自治区,固原市,彭阳县', '106.644620000000', '35.850760000000', 'Pengyang');
INSERT INTO `cf_areas` VALUES ('640500', '中卫市', '640000', '中卫', '2', '0955', '751700', '中国,宁夏回族自治区,中卫市', '105.189568000000', '37.514951000000', 'Zhongwei');
INSERT INTO `cf_areas` VALUES ('640502', '沙坡头区', '640500', '沙坡头', '3', '0955', '755000', '中国,宁夏回族自治区,中卫市,沙坡头区', '105.189620000000', '37.510440000000', 'Shapotou');
INSERT INTO `cf_areas` VALUES ('640521', '中宁县', '640500', '中宁', '3', '0955', '751200', '中国,宁夏回族自治区,中卫市,中宁县', '105.685150000000', '37.491490000000', 'Zhongning');
INSERT INTO `cf_areas` VALUES ('640522', '海原县', '640500', '海原', '3', '0955', '751800', '中国,宁夏回族自治区,中卫市,海原县', '105.647120000000', '36.564980000000', 'Haiyuan');
INSERT INTO `cf_areas` VALUES ('650000', '新疆维吾尔自治区', '100000', '新疆', '1', '', '', '中国,新疆维吾尔自治区', '87.617733000000', '43.792818000000', 'Xinjiang');
INSERT INTO `cf_areas` VALUES ('650100', '乌鲁木齐市', '650000', '乌鲁木齐', '2', '0991', '830002', '中国,新疆维吾尔自治区,乌鲁木齐市', '87.617733000000', '43.792818000000', 'Urumqi');
INSERT INTO `cf_areas` VALUES ('650102', '天山区', '650100', '天山', '3', '0991', '830002', '中国,新疆维吾尔自治区,乌鲁木齐市,天山区', '87.631670000000', '43.794390000000', 'Tianshan');
INSERT INTO `cf_areas` VALUES ('650103', '沙依巴克区', '650100', '沙依巴克', '3', '0991', '830000', '中国,新疆维吾尔自治区,乌鲁木齐市,沙依巴克区', '87.597880000000', '43.801180000000', 'Shayibake');
INSERT INTO `cf_areas` VALUES ('650104', '新市区', '650100', '新市', '3', '0991', '830011', '中国,新疆维吾尔自治区,乌鲁木齐市,新市区', '87.574060000000', '43.843480000000', 'Xinshi');
INSERT INTO `cf_areas` VALUES ('650105', '水磨沟区', '650100', '水磨沟', '3', '0991', '830017', '中国,新疆维吾尔自治区,乌鲁木齐市,水磨沟区', '87.642490000000', '43.832470000000', 'Shuimogou');
INSERT INTO `cf_areas` VALUES ('650106', '头屯河区', '650100', '头屯河', '3', '0991', '830022', '中国,新疆维吾尔自治区,乌鲁木齐市,头屯河区', '87.291380000000', '43.854870000000', 'Toutunhe');
INSERT INTO `cf_areas` VALUES ('650107', '达坂城区', '650100', '达坂城', '3', '0991', '830039', '中国,新疆维吾尔自治区,乌鲁木齐市,达坂城区', '88.306970000000', '43.357970000000', 'Dabancheng');
INSERT INTO `cf_areas` VALUES ('650109', '米东区', '650100', '米东', '3', '0991', '830019', '中国,新疆维吾尔自治区,乌鲁木齐市,米东区', '87.685830000000', '43.947390000000', 'Midong');
INSERT INTO `cf_areas` VALUES ('650121', '乌鲁木齐县', '650100', '乌鲁木齐', '3', '0991', '830063', '中国,新疆维吾尔自治区,乌鲁木齐市,乌鲁木齐县', '87.409390000000', '43.471250000000', 'Wulumuqi');
INSERT INTO `cf_areas` VALUES ('650200', '克拉玛依市', '650000', '克拉玛依', '2', '0990', '834000', '中国,新疆维吾尔自治区,克拉玛依市', '84.873946000000', '45.595886000000', 'Karamay');
INSERT INTO `cf_areas` VALUES ('650202', '独山子区', '650200', '独山子', '3', '0992', '834021', '中国,新疆维吾尔自治区,克拉玛依市,独山子区', '84.886710000000', '44.328670000000', 'Dushanzi');
INSERT INTO `cf_areas` VALUES ('650203', '克拉玛依区', '650200', '克拉玛依', '3', '0990', '834000', '中国,新疆维吾尔自治区,克拉玛依市,克拉玛依区', '84.862250000000', '45.590890000000', 'Kelamayi');
INSERT INTO `cf_areas` VALUES ('650204', '白碱滩区', '650200', '白碱滩', '3', '0990', '834008', '中国,新疆维吾尔自治区,克拉玛依市,白碱滩区', '85.132440000000', '45.687680000000', 'Baijiantan');
INSERT INTO `cf_areas` VALUES ('650205', '乌尔禾区', '650200', '乌尔禾', '3', '0990', '834012', '中国,新疆维吾尔自治区,克拉玛依市,乌尔禾区', '85.691430000000', '46.090060000000', 'Wuerhe');
INSERT INTO `cf_areas` VALUES ('652100', '吐鲁番地区', '650000', '吐鲁番', '2', '0995', '838000', '中国,新疆维吾尔自治区,吐鲁番地区', '89.184078000000', '42.947613000000', 'Turpan');
INSERT INTO `cf_areas` VALUES ('652101', '吐鲁番市', '652100', '吐鲁番', '3', '0995', '838000', '中国,新疆维吾尔自治区,吐鲁番地区,吐鲁番市', '89.185790000000', '42.935050000000', 'Tulufan');
INSERT INTO `cf_areas` VALUES ('652122', '鄯善县', '652100', '鄯善', '3', '0995', '838200', '中国,新疆维吾尔自治区,吐鲁番地区,鄯善县', '90.214020000000', '42.863500000000', 'Shanshan');
INSERT INTO `cf_areas` VALUES ('652123', '托克逊县', '652100', '托克逊', '3', '0995', '838100', '中国,新疆维吾尔自治区,吐鲁番地区,托克逊县', '88.658230000000', '42.792310000000', 'Tuokexun');
INSERT INTO `cf_areas` VALUES ('652200', '哈密地区', '650000', '哈密', '2', '0902', '839000', '中国,新疆维吾尔自治区,哈密地区', '93.513160000000', '42.833248000000', 'Hami');
INSERT INTO `cf_areas` VALUES ('652201', '哈密市', '652200', '哈密', '3', '0902', '839000', '中国,新疆维吾尔自治区,哈密地区,哈密市', '93.514520000000', '42.826990000000', 'Hami');
INSERT INTO `cf_areas` VALUES ('652222', '巴里坤哈萨克自治县', '652200', '巴里坤', '3', '0902', '839200', '中国,新疆维吾尔自治区,哈密地区,巴里坤哈萨克自治县', '93.012360000000', '43.599930000000', 'Balikun');
INSERT INTO `cf_areas` VALUES ('652223', '伊吾县', '652200', '伊吾', '3', '0902', '839300', '中国,新疆维吾尔自治区,哈密地区,伊吾县', '94.694030000000', '43.253700000000', 'Yiwu');
INSERT INTO `cf_areas` VALUES ('652300', '昌吉回族自治州', '650000', '昌吉', '2', '0994', '831100', '中国,新疆维吾尔自治区,昌吉回族自治州', '87.304012000000', '44.014577000000', 'Changji');
INSERT INTO `cf_areas` VALUES ('652301', '昌吉市', '652300', '昌吉', '3', '0994', '831100', '中国,新疆维吾尔自治区,昌吉回族自治州,昌吉市', '87.302490000000', '44.012670000000', 'Changji');
INSERT INTO `cf_areas` VALUES ('652302', '阜康市', '652300', '阜康', '3', '0994', '831500', '中国,新疆维吾尔自治区,昌吉回族自治州,阜康市', '87.985290000000', '44.158400000000', 'Fukang');
INSERT INTO `cf_areas` VALUES ('652323', '呼图壁县', '652300', '呼图壁', '3', '0994', '831200', '中国,新疆维吾尔自治区,昌吉回族自治州,呼图壁县', '86.898920000000', '44.189770000000', 'Hutubi');
INSERT INTO `cf_areas` VALUES ('652324', '玛纳斯县', '652300', '玛纳斯', '3', '0994', '832200', '中国,新疆维吾尔自治区,昌吉回族自治州,玛纳斯县', '86.214500000000', '44.304380000000', 'Manasi');
INSERT INTO `cf_areas` VALUES ('652325', '奇台县', '652300', '奇台', '3', '0994', '831800', '中国,新疆维吾尔自治区,昌吉回族自治州,奇台县', '89.593200000000', '44.022210000000', 'Qitai');
INSERT INTO `cf_areas` VALUES ('652327', '吉木萨尔县', '652300', '吉木萨尔', '3', '0994', '831700', '中国,新疆维吾尔自治区,昌吉回族自治州,吉木萨尔县', '89.180780000000', '44.000480000000', 'Jimusaer');
INSERT INTO `cf_areas` VALUES ('652328', '木垒哈萨克自治县', '652300', '木垒', '3', '0994', '831900', '中国,新疆维吾尔自治区,昌吉回族自治州,木垒哈萨克自治县', '90.288970000000', '43.835080000000', 'Mulei');
INSERT INTO `cf_areas` VALUES ('652700', '博尔塔拉蒙古自治州', '650000', '博尔塔拉', '2', '0909', '833400', '中国,新疆维吾尔自治区,博尔塔拉蒙古自治州', '82.074778000000', '44.903258000000', 'Bortala');
INSERT INTO `cf_areas` VALUES ('652701', '博乐市', '652700', '博乐', '3', '0909', '833400', '中国,新疆维吾尔自治区,博尔塔拉蒙古自治州,博乐市', '82.071300000000', '44.900520000000', 'Bole');
INSERT INTO `cf_areas` VALUES ('652702', '阿拉山口市', '652700', '阿拉山口', '3', '0909', '833400', '中国,新疆维吾尔自治区,博尔塔拉蒙古自治州,阿拉山口市', '82.567721000000', '45.170616000000', 'Alashankou');
INSERT INTO `cf_areas` VALUES ('652722', '精河县', '652700', '精河', '3', '0909', '833300', '中国,新疆维吾尔自治区,博尔塔拉蒙古自治州,精河县', '82.894190000000', '44.607740000000', 'Jinghe');
INSERT INTO `cf_areas` VALUES ('652723', '温泉县', '652700', '温泉', '3', '0909', '833500', '中国,新疆维吾尔自治区,博尔塔拉蒙古自治州,温泉县', '81.031340000000', '44.973730000000', 'Wenquan');
INSERT INTO `cf_areas` VALUES ('652800', '巴音郭楞蒙古自治州', '650000', '巴音郭楞', '2', '0996', '841000', '中国,新疆维吾尔自治区,巴音郭楞蒙古自治州', '86.150969000000', '41.768552000000', 'Bayingol');
INSERT INTO `cf_areas` VALUES ('652801', '库尔勒市', '652800', '库尔勒', '3', '0996', '841000', '中国,新疆维吾尔自治区,巴音郭楞蒙古自治州,库尔勒市', '86.155280000000', '41.766020000000', 'Kuerle');
INSERT INTO `cf_areas` VALUES ('652822', '轮台县', '652800', '轮台', '3', '0996', '841600', '中国,新疆维吾尔自治区,巴音郭楞蒙古自治州,轮台县', '84.261010000000', '41.776420000000', 'Luntai');
INSERT INTO `cf_areas` VALUES ('652823', '尉犁县', '652800', '尉犁', '3', '0996', '841500', '中国,新疆维吾尔自治区,巴音郭楞蒙古自治州,尉犁县', '86.259030000000', '41.336320000000', 'Yuli');
INSERT INTO `cf_areas` VALUES ('652824', '若羌县', '652800', '若羌', '3', '0996', '841800', '中国,新疆维吾尔自治区,巴音郭楞蒙古自治州,若羌县', '88.168120000000', '39.017900000000', 'Ruoqiang');
INSERT INTO `cf_areas` VALUES ('652825', '且末县', '652800', '且末', '3', '0996', '841900', '中国,新疆维吾尔自治区,巴音郭楞蒙古自治州,且末县', '85.529750000000', '38.145340000000', 'Qiemo');
INSERT INTO `cf_areas` VALUES ('652826', '焉耆回族自治县', '652800', '焉耆', '3', '0996', '841100', '中国,新疆维吾尔自治区,巴音郭楞蒙古自治州,焉耆回族自治县', '86.574400000000', '42.059000000000', 'Yanqi');
INSERT INTO `cf_areas` VALUES ('652827', '和静县', '652800', '和静', '3', '0996', '841300', '中国,新疆维吾尔自治区,巴音郭楞蒙古自治州,和静县', '86.396110000000', '42.318380000000', 'Hejing');
INSERT INTO `cf_areas` VALUES ('652828', '和硕县', '652800', '和硕', '3', '0996', '841200', '中国,新疆维吾尔自治区,巴音郭楞蒙古自治州,和硕县', '86.863920000000', '42.268140000000', 'Heshuo');
INSERT INTO `cf_areas` VALUES ('652829', '博湖县', '652800', '博湖', '3', '0996', '841400', '中国,新疆维吾尔自治区,巴音郭楞蒙古自治州,博湖县', '86.633330000000', '41.980140000000', 'Bohu');
INSERT INTO `cf_areas` VALUES ('652900', '阿克苏地区', '650000', '阿克苏', '2', '0997', '843000', '中国,新疆维吾尔自治区,阿克苏地区', '80.265068000000', '41.170712000000', 'Aksu');
INSERT INTO `cf_areas` VALUES ('652901', '阿克苏市', '652900', '阿克苏', '3', '0997', '843000', '中国,新疆维吾尔自治区,阿克苏地区,阿克苏市', '80.263380000000', '41.167540000000', 'Akesu');
INSERT INTO `cf_areas` VALUES ('652922', '温宿县', '652900', '温宿', '3', '0997', '843100', '中国,新疆维吾尔自治区,阿克苏地区,温宿县', '80.241730000000', '41.276790000000', 'Wensu');
INSERT INTO `cf_areas` VALUES ('652923', '库车县', '652900', '库车', '3', '0997', '842000', '中国,新疆维吾尔自治区,阿克苏地区,库车县', '82.962090000000', '41.717930000000', 'Kuche');
INSERT INTO `cf_areas` VALUES ('652924', '沙雅县', '652900', '沙雅', '3', '0997', '842200', '中国,新疆维吾尔自治区,阿克苏地区,沙雅县', '82.781310000000', '41.224970000000', 'Shaya');
INSERT INTO `cf_areas` VALUES ('652925', '新和县', '652900', '新和', '3', '0997', '842100', '中国,新疆维吾尔自治区,阿克苏地区,新和县', '82.610530000000', '41.549640000000', 'Xinhe');
INSERT INTO `cf_areas` VALUES ('652926', '拜城县', '652900', '拜城', '3', '0997', '842300', '中国,新疆维吾尔自治区,阿克苏地区,拜城县', '81.875640000000', '41.798010000000', 'Baicheng');
INSERT INTO `cf_areas` VALUES ('652927', '乌什县', '652900', '乌什', '3', '0997', '843400', '中国,新疆维吾尔自治区,阿克苏地区,乌什县', '79.229370000000', '41.215690000000', 'Wushi');
INSERT INTO `cf_areas` VALUES ('652928', '阿瓦提县', '652900', '阿瓦提', '3', '0997', '843200', '中国,新疆维吾尔自治区,阿克苏地区,阿瓦提县', '80.383360000000', '40.639260000000', 'Awati');
INSERT INTO `cf_areas` VALUES ('652929', '柯坪县', '652900', '柯坪', '3', '0997', '843600', '中国,新疆维吾尔自治区,阿克苏地区,柯坪县', '79.047510000000', '40.505850000000', 'Keping');
INSERT INTO `cf_areas` VALUES ('653000', '克孜勒苏柯尔克孜自治州', '650000', '克孜勒苏', '2', '0908', '845350', '中国,新疆维吾尔自治区,克孜勒苏柯尔克孜自治州', '76.172825000000', '39.713431000000', 'Kizilsu');
INSERT INTO `cf_areas` VALUES ('653001', '阿图什市', '653000', '阿图什', '3', '0908', '845350', '中国,新疆维吾尔自治区,克孜勒苏柯尔克孜自治州,阿图什市', '76.168270000000', '39.716150000000', 'Atushi');
INSERT INTO `cf_areas` VALUES ('653022', '阿克陶县', '653000', '阿克陶', '3', '0908', '845550', '中国,新疆维吾尔自治区,克孜勒苏柯尔克孜自治州,阿克陶县', '75.946920000000', '39.148920000000', 'Aketao');
INSERT INTO `cf_areas` VALUES ('653023', '阿合奇县', '653000', '阿合奇', '3', '0997', '843500', '中国,新疆维吾尔自治区,克孜勒苏柯尔克孜自治州,阿合奇县', '78.448480000000', '40.939470000000', 'Aheqi');
INSERT INTO `cf_areas` VALUES ('653024', '乌恰县', '653000', '乌恰', '3', '0908', '845450', '中国,新疆维吾尔自治区,克孜勒苏柯尔克孜自治州,乌恰县', '75.258390000000', '39.719840000000', 'Wuqia');
INSERT INTO `cf_areas` VALUES ('653100', '喀什地区', '650000', '喀什', '2', '0998', '844000', '中国,新疆维吾尔自治区,喀什地区', '75.989138000000', '39.467664000000', 'Kashgar');
INSERT INTO `cf_areas` VALUES ('653101', '喀什市', '653100', '喀什', '3', '0998', '844000', '中国,新疆维吾尔自治区,喀什地区,喀什市', '75.993790000000', '39.467680000000', 'Kashi');
INSERT INTO `cf_areas` VALUES ('653121', '疏附县', '653100', '疏附', '3', '0998', '844100', '中国,新疆维吾尔自治区,喀什地区,疏附县', '75.860290000000', '39.375340000000', 'Shufu');
INSERT INTO `cf_areas` VALUES ('653122', '疏勒县', '653100', '疏勒', '3', '0998', '844200', '中国,新疆维吾尔自治区,喀什地区,疏勒县', '76.053980000000', '39.406250000000', 'Shule');
INSERT INTO `cf_areas` VALUES ('653123', '英吉沙县', '653100', '英吉沙', '3', '0998', '844500', '中国,新疆维吾尔自治区,喀什地区,英吉沙县', '76.175650000000', '38.929680000000', 'Yingjisha');
INSERT INTO `cf_areas` VALUES ('653124', '泽普县', '653100', '泽普', '3', '0998', '844800', '中国,新疆维吾尔自治区,喀什地区,泽普县', '77.271450000000', '38.189350000000', 'Zepu');
INSERT INTO `cf_areas` VALUES ('653125', '莎车县', '653100', '莎车', '3', '0998', '844700', '中国,新疆维吾尔自治区,喀什地区,莎车县', '77.243160000000', '38.416010000000', 'Shache');
INSERT INTO `cf_areas` VALUES ('653126', '叶城县', '653100', '叶城', '3', '0998', '844900', '中国,新疆维吾尔自治区,喀什地区,叶城县', '77.416590000000', '37.883240000000', 'Yecheng');
INSERT INTO `cf_areas` VALUES ('653127', '麦盖提县', '653100', '麦盖提', '3', '0998', '844600', '中国,新疆维吾尔自治区,喀什地区,麦盖提县', '77.642240000000', '38.896620000000', 'Maigaiti');
INSERT INTO `cf_areas` VALUES ('653128', '岳普湖县', '653100', '岳普湖', '3', '0998', '844400', '中国,新疆维吾尔自治区,喀什地区,岳普湖县', '76.772330000000', '39.235610000000', 'Yuepuhu');
INSERT INTO `cf_areas` VALUES ('653129', '伽师县', '653100', '伽师', '3', '0998', '844300', '中国,新疆维吾尔自治区,喀什地区,伽师县', '76.723720000000', '39.488010000000', 'Jiashi');
INSERT INTO `cf_areas` VALUES ('653130', '巴楚县', '653100', '巴楚', '3', '0998', '843800', '中国,新疆维吾尔自治区,喀什地区,巴楚县', '78.548880000000', '39.785500000000', 'Bachu');
INSERT INTO `cf_areas` VALUES ('653131', '塔什库尔干塔吉克自治县', '653100', '塔什库尔干塔吉克', '3', '0998', '845250', '中国,新疆维吾尔自治区,喀什地区,塔什库尔干塔吉克自治县', '75.231960000000', '37.778930000000', 'Tashikuergantajike');
INSERT INTO `cf_areas` VALUES ('653200', '和田地区', '650000', '和田', '2', '0903', '848000', '中国,新疆维吾尔自治区,和田地区', '79.925330000000', '37.110687000000', 'Hotan');
INSERT INTO `cf_areas` VALUES ('653201', '和田市', '653200', '和田市', '3', '0903', '848000', '中国,新疆维吾尔自治区,和田地区,和田市', '79.913530000000', '37.112140000000', 'Hetianshi');
INSERT INTO `cf_areas` VALUES ('653221', '和田县', '653200', '和田县', '3', '0903', '848000', '中国,新疆维吾尔自治区,和田地区,和田县', '79.828740000000', '37.089220000000', 'Hetianxian');
INSERT INTO `cf_areas` VALUES ('653222', '墨玉县', '653200', '墨玉', '3', '0903', '848100', '中国,新疆维吾尔自治区,和田地区,墨玉县', '79.740350000000', '37.272480000000', 'Moyu');
INSERT INTO `cf_areas` VALUES ('653223', '皮山县', '653200', '皮山', '3', '0903', '845150', '中国,新疆维吾尔自治区,和田地区,皮山县', '78.281250000000', '37.620070000000', 'Pishan');
INSERT INTO `cf_areas` VALUES ('653224', '洛浦县', '653200', '洛浦', '3', '0903', '848200', '中国,新疆维吾尔自治区,和田地区,洛浦县', '80.185360000000', '37.073640000000', 'Luopu');
INSERT INTO `cf_areas` VALUES ('653225', '策勒县', '653200', '策勒', '3', '0903', '848300', '中国,新疆维吾尔自治区,和田地区,策勒县', '80.809990000000', '36.998430000000', 'Cele');
INSERT INTO `cf_areas` VALUES ('653226', '于田县', '653200', '于田', '3', '0903', '848400', '中国,新疆维吾尔自治区,和田地区,于田县', '81.667170000000', '36.854000000000', 'Yutian');
INSERT INTO `cf_areas` VALUES ('653227', '民丰县', '653200', '民丰', '3', '0903', '848500', '中国,新疆维吾尔自治区,和田地区,民丰县', '82.684440000000', '37.065770000000', 'Minfeng');
INSERT INTO `cf_areas` VALUES ('654000', '伊犁哈萨克自治州', '650000', '伊犁', '2', '0999', '835100', '中国,新疆维吾尔自治区,伊犁哈萨克自治州', '81.317946000000', '43.921860000000', 'Ili');
INSERT INTO `cf_areas` VALUES ('654002', '伊宁市', '654000', '伊宁', '3', '0999', '835000', '中国,新疆维吾尔自治区,伊犁哈萨克自治州,伊宁市', '81.329320000000', '43.912940000000', 'Yining');
INSERT INTO `cf_areas` VALUES ('654003', '奎屯市', '654000', '奎屯', '3', '0992', '833200', '中国,新疆维吾尔自治区,伊犁哈萨克自治州,奎屯市', '84.902280000000', '44.425000000000', 'Kuitun');
INSERT INTO `cf_areas` VALUES ('654004', '霍尔果斯市', '654000', '霍尔果斯', '3', '0999', '835221', '中国,新疆维吾尔自治区,伊犁哈萨克自治州,霍尔果斯市', '80.418189000000', '44.205778000000', 'Huoerguosi');
INSERT INTO `cf_areas` VALUES ('654021', '伊宁县', '654000', '伊宁', '3', '0999', '835100', '中国,新疆维吾尔自治区,伊犁哈萨克自治州,伊宁县', '81.527640000000', '43.978630000000', 'Yining');
INSERT INTO `cf_areas` VALUES ('654022', '察布查尔锡伯自治县', '654000', '察布查尔锡伯', '3', '0999', '835300', '中国,新疆维吾尔自治区,伊犁哈萨克自治州,察布查尔锡伯自治县', '81.149560000000', '43.840230000000', 'Chabuchaerxibo');
INSERT INTO `cf_areas` VALUES ('654023', '霍城县', '654000', '霍城', '3', '0999', '835200', '中国,新疆维吾尔自治区,伊犁哈萨克自治州,霍城县', '80.878260000000', '44.053300000000', 'Huocheng');
INSERT INTO `cf_areas` VALUES ('654024', '巩留县', '654000', '巩留', '3', '0999', '835400', '中国,新疆维吾尔自治区,伊犁哈萨克自治州,巩留县', '82.228510000000', '43.484290000000', 'Gongliu');
INSERT INTO `cf_areas` VALUES ('654025', '新源县', '654000', '新源', '3', '0999', '835800', '中国,新疆维吾尔自治区,伊犁哈萨克自治州,新源县', '83.260950000000', '43.428400000000', 'Xinyuan');
INSERT INTO `cf_areas` VALUES ('654026', '昭苏县', '654000', '昭苏', '3', '0999', '835600', '中国,新疆维吾尔自治区,伊犁哈萨克自治州,昭苏县', '81.130700000000', '43.158280000000', 'Zhaosu');
INSERT INTO `cf_areas` VALUES ('654027', '特克斯县', '654000', '特克斯', '3', '0999', '835500', '中国,新疆维吾尔自治区,伊犁哈萨克自治州,特克斯县', '81.840050000000', '43.219380000000', 'Tekesi');
INSERT INTO `cf_areas` VALUES ('654028', '尼勒克县', '654000', '尼勒克', '3', '0999', '835700', '中国,新疆维吾尔自治区,伊犁哈萨克自治州,尼勒克县', '82.511840000000', '43.799010000000', 'Nileke');
INSERT INTO `cf_areas` VALUES ('654200', '塔城地区', '650000', '塔城', '2', '0901', '834700', '中国,新疆维吾尔自治区,塔城地区', '82.985732000000', '46.746301000000', 'Qoqek');
INSERT INTO `cf_areas` VALUES ('654201', '塔城市', '654200', '塔城', '3', '0901', '834700', '中国,新疆维吾尔自治区,塔城地区,塔城市', '82.978920000000', '46.748520000000', 'Tacheng');
INSERT INTO `cf_areas` VALUES ('654202', '乌苏市', '654200', '乌苏', '3', '0992', '833000', '中国,新疆维吾尔自治区,塔城地区,乌苏市', '84.682580000000', '44.437290000000', 'Wusu');
INSERT INTO `cf_areas` VALUES ('654221', '额敏县', '654200', '额敏', '3', '0901', '834600', '中国,新疆维吾尔自治区,塔城地区,额敏县', '83.628720000000', '46.528400000000', 'Emin');
INSERT INTO `cf_areas` VALUES ('654223', '沙湾县', '654200', '沙湾', '3', '0993', '832100', '中国,新疆维吾尔自治区,塔城地区,沙湾县', '85.619320000000', '44.331440000000', 'Shawan');
INSERT INTO `cf_areas` VALUES ('654224', '托里县', '654200', '托里', '3', '0901', '834500', '中国,新疆维吾尔自治区,塔城地区,托里县', '83.605920000000', '45.936230000000', 'Tuoli');
INSERT INTO `cf_areas` VALUES ('654225', '裕民县', '654200', '裕民', '3', '0901', '834800', '中国,新疆维吾尔自治区,塔城地区,裕民县', '82.990020000000', '46.203770000000', 'Yumin');
INSERT INTO `cf_areas` VALUES ('654226', '和布克赛尔蒙古自治县', '654200', '和布克赛尔', '3', '0990', '834400', '中国,新疆维吾尔自治区,塔城地区,和布克赛尔蒙古自治县', '85.726620000000', '46.793620000000', 'Hebukesaier');
INSERT INTO `cf_areas` VALUES ('654300', '阿勒泰地区', '650000', '阿勒泰', '2', '0906', '836500', '中国,新疆维吾尔自治区,阿勒泰地区', '88.139630000000', '47.848393000000', 'Altay');
INSERT INTO `cf_areas` VALUES ('654301', '阿勒泰市', '654300', '阿勒泰', '3', '0906', '836500', '中国,新疆维吾尔自治区,阿勒泰地区,阿勒泰市', '88.139130000000', '47.831700000000', 'Aletai');
INSERT INTO `cf_areas` VALUES ('654321', '布尔津县', '654300', '布尔津', '3', '0906', '836600', '中国,新疆维吾尔自治区,阿勒泰地区,布尔津县', '86.857510000000', '47.700620000000', 'Buerjin');
INSERT INTO `cf_areas` VALUES ('654322', '富蕴县', '654300', '富蕴', '3', '0906', '836100', '中国,新疆维吾尔自治区,阿勒泰地区,富蕴县', '89.526790000000', '46.994440000000', 'Fuyun');
INSERT INTO `cf_areas` VALUES ('654323', '福海县', '654300', '福海', '3', '0906', '836400', '中国,新疆维吾尔自治区,阿勒泰地区,福海县', '87.495080000000', '47.110650000000', 'Fuhai');
INSERT INTO `cf_areas` VALUES ('654324', '哈巴河县', '654300', '哈巴河', '3', '0906', '836700', '中国,新疆维吾尔自治区,阿勒泰地区,哈巴河县', '86.420920000000', '48.060460000000', 'Habahe');
INSERT INTO `cf_areas` VALUES ('654325', '青河县', '654300', '青河', '3', '0906', '836200', '中国,新疆维吾尔自治区,阿勒泰地区,青河县', '90.383050000000', '46.673820000000', 'Qinghe');
INSERT INTO `cf_areas` VALUES ('654326', '吉木乃县', '654300', '吉木乃', '3', '0906', '836800', '中国,新疆维吾尔自治区,阿勒泰地区,吉木乃县', '85.878140000000', '47.433590000000', 'Jimunai');
INSERT INTO `cf_areas` VALUES ('659000', '直辖县级', '650000', ' ', '2', '', '', '中国,新疆维吾尔自治区,直辖县级', '91.132212000000', '29.660361000000', '');
INSERT INTO `cf_areas` VALUES ('659001', '石河子市', '659000', '石河子', '3', '0993', '832000', '中国,新疆维吾尔自治区,直辖县级,石河子市', '86.041075000000', '44.305886000000', 'Shihezi');
INSERT INTO `cf_areas` VALUES ('659002', '阿拉尔市', '659000', '阿拉尔', '3', '0997', '843300', '中国,新疆维吾尔自治区,直辖县级,阿拉尔市', '81.285884000000', '40.541914000000', 'Aral');
INSERT INTO `cf_areas` VALUES ('659003', '图木舒克市', '659000', '图木舒克', '3', '0998', '843806', '中国,新疆维吾尔自治区,直辖县级,图木舒克市', '79.077978000000', '39.867316000000', 'Tumxuk');
INSERT INTO `cf_areas` VALUES ('659004', '五家渠市', '659000', '五家渠', '3', '0994', '831300', '中国,新疆维吾尔自治区,直辖县级,五家渠市', '87.526884000000', '44.167401000000', 'Wujiaqu');
INSERT INTO `cf_areas` VALUES ('659005', '北屯市', '659000', '北屯', '3', '0906', '836000', '中国,新疆维吾尔自治区,直辖县级,北屯市', '87.808456000000', '47.362308000000', 'Beitun');
INSERT INTO `cf_areas` VALUES ('659006', '铁门关市', '659000', '铁门关', '3', '0906', '836000', '中国,新疆维吾尔自治区,直辖县级,铁门关市', '86.194687000000', '41.811007000000', 'Tiemenguan');
INSERT INTO `cf_areas` VALUES ('659007', '双河市', '659000', '双河', '3', '0909', '833408', '中国,新疆维吾尔自治区,直辖县级,双河市', '91.132212000000', '29.660361000000', 'Shuanghe');
INSERT INTO `cf_areas` VALUES ('710000', '台湾', '100000', '台湾', '1', '', '', '中国,台湾', '121.509062000000', '25.044332000000', 'Taiwan');
INSERT INTO `cf_areas` VALUES ('710100', '台北市', '710000', '台北', '2', '02', '1', '中国,台湾,台北市', '121.565170000000', '25.037798000000', 'Taipei');
INSERT INTO `cf_areas` VALUES ('710101', '松山区', '710100', '松山', '3', '02', '105', '中国,台湾,台北市,松山区', '121.577206000000', '25.049698000000', 'Songshan');
INSERT INTO `cf_areas` VALUES ('710102', '信义区', '710100', '信义', '3', '02', '110', '中国,台湾,台北市,信义区', '121.751381000000', '25.129407000000', 'Xinyi');
INSERT INTO `cf_areas` VALUES ('710103', '大安区', '710100', '大安', '3', '02', '106', '中国,台湾,台北市,大安区', '121.534648000000', '25.026406000000', 'Da\'an');
INSERT INTO `cf_areas` VALUES ('710104', '中山区', '710100', '中山', '3', '02', '104', '中国,台湾,台北市,中山区', '121.533468000000', '25.064361000000', 'Zhongshan');
INSERT INTO `cf_areas` VALUES ('710105', '中正区', '710100', '中正', '3', '02', '100', '中国,台湾,台北市,中正区', '121.518267000000', '25.032361000000', 'Zhongzheng');
INSERT INTO `cf_areas` VALUES ('710106', '大同区', '710100', '大同', '3', '02', '103', '中国,台湾,台北市,大同区', '121.515514000000', '25.065986000000', 'Datong');
INSERT INTO `cf_areas` VALUES ('710107', '万华区', '710100', '万华', '3', '02', '108', '中国,台湾,台北市,万华区', '121.499332000000', '25.031933000000', 'Wanhua');
INSERT INTO `cf_areas` VALUES ('710108', '文山区', '710100', '文山', '3', '02', '116', '中国,台湾,台北市,文山区', '121.570458000000', '24.989786000000', 'Wenshan');
INSERT INTO `cf_areas` VALUES ('710109', '南港区', '710100', '南港', '3', '02', '115', '中国,台湾,台北市,南港区', '121.606858000000', '25.054656000000', 'Nangang');
INSERT INTO `cf_areas` VALUES ('710110', '内湖区', '710100', '内湖', '3', '02', '114', '中国,台湾,台北市,内湖区', '121.588998000000', '25.069664000000', 'Nahu');
INSERT INTO `cf_areas` VALUES ('710111', '士林区', '710100', '士林', '3', '02', '111', '中国,台湾,台北市,士林区', '121.519874000000', '25.092822000000', 'Shilin');
INSERT INTO `cf_areas` VALUES ('710112', '北投区', '710100', '北投', '3', '02', '112', '中国,台湾,台北市,北投区', '121.501379000000', '25.132419000000', 'Beitou');
INSERT INTO `cf_areas` VALUES ('710200', '高雄市', '710000', '高雄', '2', '07', '8', '中国,台湾,高雄市', '120.311922000000', '22.620856000000', 'Kaohsiung');
INSERT INTO `cf_areas` VALUES ('710201', '盐埕区', '710200', '盐埕', '3', '07', '803', '中国,台湾,高雄市,盐埕区', '120.286795000000', '22.624666000000', 'Yancheng');
INSERT INTO `cf_areas` VALUES ('710202', '鼓山区', '710200', '鼓山', '3', '07', '804', '中国,台湾,高雄市,鼓山区', '120.281154000000', '22.636797000000', 'Gushan');
INSERT INTO `cf_areas` VALUES ('710203', '左营区', '710200', '左营', '3', '07', '813', '中国,台湾,高雄市,左营区', '120.294958000000', '22.690124000000', 'Zuoying');
INSERT INTO `cf_areas` VALUES ('710204', '楠梓区', '710200', '楠梓', '3', '07', '811', '中国,台湾,高雄市,楠梓区', '120.326314000000', '22.728401000000', 'Nanzi');
INSERT INTO `cf_areas` VALUES ('710205', '三民区', '710200', '三民', '3', '07', '807', '中国,台湾,高雄市,三民区', '120.299622000000', '22.647695000000', 'Sanmin');
INSERT INTO `cf_areas` VALUES ('710206', '新兴区', '710200', '新兴', '3', '07', '800', '中国,台湾,高雄市,新兴区', '120.309535000000', '22.631147000000', 'Xinxing');
INSERT INTO `cf_areas` VALUES ('710207', '前金区', '710200', '前金', '3', '07', '801', '中国,台湾,高雄市,前金区', '120.294159000000', '22.627421000000', 'Qianjin');
INSERT INTO `cf_areas` VALUES ('710208', '苓雅区', '710200', '苓雅', '3', '07', '802', '中国,台湾,高雄市,苓雅区', '120.312347000000', '22.621770000000', 'Lingya');
INSERT INTO `cf_areas` VALUES ('710209', '前镇区', '710200', '前镇', '3', '07', '806', '中国,台湾,高雄市,前镇区', '120.318583000000', '22.586425000000', 'Qianzhen');
INSERT INTO `cf_areas` VALUES ('710210', '旗津区', '710200', '旗津', '3', '07', '805', '中国,台湾,高雄市,旗津区', '120.284429000000', '22.590565000000', 'Qijin');
INSERT INTO `cf_areas` VALUES ('710211', '小港区', '710200', '小港', '3', '07', '812', '中国,台湾,高雄市,小港区', '120.337970000000', '22.565354000000', 'Xiaogang');
INSERT INTO `cf_areas` VALUES ('710212', '凤山区', '710200', '凤山', '3', '07', '830', '中国,台湾,高雄市,凤山区', '120.356892000000', '22.626945000000', 'Fengshan');
INSERT INTO `cf_areas` VALUES ('710213', '林园区', '710200', '林园', '3', '07', '832', '中国,台湾,高雄市,林园区', '120.395977000000', '22.501490000000', 'Linyuan');
INSERT INTO `cf_areas` VALUES ('710214', '大寮区', '710200', '大寮', '3', '07', '831', '中国,台湾,高雄市,大寮区', '120.395422000000', '22.605386000000', 'Daliao');
INSERT INTO `cf_areas` VALUES ('710215', '大树区', '710200', '大树', '3', '07', '840', '中国,台湾,高雄市,大树区', '120.433095000000', '22.693394000000', 'Dashu');
INSERT INTO `cf_areas` VALUES ('710216', '大社区', '710200', '大社', '3', '07', '815', '中国,台湾,高雄市,大社区', '120.346635000000', '22.729966000000', 'Dashe');
INSERT INTO `cf_areas` VALUES ('710217', '仁武区', '710200', '仁武', '3', '07', '814', '中国,台湾,高雄市,仁武区', '120.347779000000', '22.701901000000', 'Renwu');
INSERT INTO `cf_areas` VALUES ('710218', '鸟松区', '710200', '鸟松', '3', '07', '833', '中国,台湾,高雄市,鸟松区', '120.364402000000', '22.659340000000', 'Niaosong');
INSERT INTO `cf_areas` VALUES ('710219', '冈山区', '710200', '冈山', '3', '07', '820', '中国,台湾,高雄市,冈山区', '120.295820000000', '22.796762000000', 'Gangshan');
INSERT INTO `cf_areas` VALUES ('710220', '桥头区', '710200', '桥头', '3', '07', '825', '中国,台湾,高雄市,桥头区', '120.305741000000', '22.757501000000', 'Qiaotou');
INSERT INTO `cf_areas` VALUES ('710221', '燕巢区', '710200', '燕巢', '3', '07', '824', '中国,台湾,高雄市,燕巢区', '120.361956000000', '22.793370000000', 'Yanchao');
INSERT INTO `cf_areas` VALUES ('710222', '田寮区', '710200', '田寮', '3', '07', '823', '中国,台湾,高雄市,田寮区', '120.359636000000', '22.869307000000', 'Tianliao');
INSERT INTO `cf_areas` VALUES ('710223', '阿莲区', '710200', '阿莲', '3', '07', '822', '中国,台湾,高雄市,阿莲区', '120.327036000000', '22.883703000000', 'Alian');
INSERT INTO `cf_areas` VALUES ('710224', '路竹区', '710200', '路竹', '3', '07', '821', '中国,台湾,高雄市,路竹区', '120.261828000000', '22.856851000000', 'Luzhu');
INSERT INTO `cf_areas` VALUES ('710225', '湖内区', '710200', '湖内', '3', '07', '829', '中国,台湾,高雄市,湖内区', '120.211530000000', '22.908188000000', 'Huna');
INSERT INTO `cf_areas` VALUES ('710226', '茄萣区', '710200', '茄萣', '3', '07', '852', '中国,台湾,高雄市,茄萣区', '120.182815000000', '22.906556000000', 'Qieding');
INSERT INTO `cf_areas` VALUES ('710227', '永安区', '710200', '永安', '3', '07', '828', '中国,台湾,高雄市,永安区', '120.225308000000', '22.818580000000', 'Yong\'an');
INSERT INTO `cf_areas` VALUES ('710228', '弥陀区', '710200', '弥陀', '3', '07', '827', '中国,台湾,高雄市,弥陀区', '120.247344000000', '22.782879000000', 'Mituo');
INSERT INTO `cf_areas` VALUES ('710229', '梓官区', '710200', '梓官', '3', '07', '826', '中国,台湾,高雄市,梓官区', '120.267322000000', '22.760475000000', 'Ziguan');
INSERT INTO `cf_areas` VALUES ('710230', '旗山区', '710200', '旗山', '3', '07', '842', '中国,台湾,高雄市,旗山区', '120.483550000000', '22.888491000000', 'Qishan');
INSERT INTO `cf_areas` VALUES ('710231', '美浓区', '710200', '美浓', '3', '07', '843', '中国,台湾,高雄市,美浓区', '120.541530000000', '22.897880000000', 'Meinong');
INSERT INTO `cf_areas` VALUES ('710232', '六龟区', '710200', '六龟', '3', '07', '844', '中国,台湾,高雄市,六龟区', '120.633418000000', '22.997914000000', 'Liugui');
INSERT INTO `cf_areas` VALUES ('710233', '甲仙区', '710200', '甲仙', '3', '07', '847', '中国,台湾,高雄市,甲仙区', '120.591185000000', '23.084688000000', 'Jiaxian');
INSERT INTO `cf_areas` VALUES ('710234', '杉林区', '710200', '杉林', '3', '07', '846', '中国,台湾,高雄市,杉林区', '120.538980000000', '22.970712000000', 'Shanlin');
INSERT INTO `cf_areas` VALUES ('710235', '内门区', '710200', '内门', '3', '07', '845', '中国,台湾,高雄市,内门区', '120.462351000000', '22.943437000000', 'Namen');
INSERT INTO `cf_areas` VALUES ('710236', '茂林区', '710200', '茂林', '3', '07', '851', '中国,台湾,高雄市,茂林区', '120.663217000000', '22.886248000000', 'Maolin');
INSERT INTO `cf_areas` VALUES ('710237', '桃源区', '710200', '桃源', '3', '07', '848', '中国,台湾,高雄市,桃源区', '120.760049000000', '23.159137000000', 'Taoyuan');
INSERT INTO `cf_areas` VALUES ('710238', '那玛夏区', '710200', '那玛夏', '3', '07', '849', '中国,台湾,高雄市,那玛夏区', '120.692799000000', '23.216964000000', 'Namaxia');
INSERT INTO `cf_areas` VALUES ('710300', '基隆市', '710000', '基隆', '2', '02', '2', '中国,台湾,基隆市', '121.746248000000', '25.130741000000', 'Keelung');
INSERT INTO `cf_areas` VALUES ('710301', '中正区', '710300', '中正', '3', '02', '202', '中国,台湾,基隆市,中正区', '121.518267000000', '25.032361000000', 'Zhongzheng');
INSERT INTO `cf_areas` VALUES ('710302', '七堵区', '710300', '七堵', '3', '02', '206', '中国,台湾,基隆市,七堵区', '121.713032000000', '25.095739000000', 'Qidu');
INSERT INTO `cf_areas` VALUES ('710303', '暖暖区', '710300', '暖暖', '3', '02', '205', '中国,台湾,基隆市,暖暖区', '121.736102000000', '25.099777000000', 'Nuannuan');
INSERT INTO `cf_areas` VALUES ('710304', '仁爱区', '710300', '仁爱', '3', '02', '200', '中国,台湾,基隆市,仁爱区', '121.740940000000', '25.127526000000', 'Renai');
INSERT INTO `cf_areas` VALUES ('710305', '中山区', '710300', '中山', '3', '02', '203', '中国,台湾,基隆市,中山区', '121.739132000000', '25.133991000000', 'Zhongshan');
INSERT INTO `cf_areas` VALUES ('710306', '安乐区', '710300', '安乐', '3', '02', '204', '中国,台湾,基隆市,安乐区', '121.723203000000', '25.120910000000', 'Anle');
INSERT INTO `cf_areas` VALUES ('710307', '信义区', '710300', '信义', '3', '02', '201', '中国,台湾,基隆市,信义区', '121.751381000000', '25.129407000000', 'Xinyi');
INSERT INTO `cf_areas` VALUES ('710400', '台中市', '710000', '台中', '2', '04', '4', '中国,台湾,台中市', '120.679040000000', '24.138620000000', 'Taichung');
INSERT INTO `cf_areas` VALUES ('710401', '中区', '710400', '中区', '3', '04', '400', '中国,台湾,台中市,中区', '120.679510000000', '24.143830000000', 'Zhongqu');
INSERT INTO `cf_areas` VALUES ('710402', '东区', '710400', '东区', '3', '04', '401', '中国,台湾,台中市,东区', '120.704000000000', '24.136620000000', 'Dongqu');
INSERT INTO `cf_areas` VALUES ('710403', '南区', '710400', '南区', '3', '04', '402', '中国,台湾,台中市,南区', '120.188648000000', '22.960944000000', 'Nanqu');
INSERT INTO `cf_areas` VALUES ('710404', '西区', '710400', '西区', '3', '04', '403', '中国,台湾,台中市,西区', '120.671040000000', '24.141380000000', 'Xiqu');
INSERT INTO `cf_areas` VALUES ('710405', '北区', '710400', '北区', '3', '04', '404', '中国,台湾,台中市,北区', '120.682410000000', '24.166040000000', 'Beiqu');
INSERT INTO `cf_areas` VALUES ('710406', '西屯区', '710400', '西屯', '3', '04', '407', '中国,台湾,台中市,西屯区', '120.639820000000', '24.181340000000', 'Xitun');
INSERT INTO `cf_areas` VALUES ('710407', '南屯区', '710400', '南屯', '3', '04', '408', '中国,台湾,台中市,南屯区', '120.643080000000', '24.138270000000', 'Nantun');
INSERT INTO `cf_areas` VALUES ('710408', '北屯区', '710400', '北屯', '3', '04', '406', '中国,台湾,台中市,北屯区', '120.686250000000', '24.182220000000', 'Beitun');
INSERT INTO `cf_areas` VALUES ('710409', '丰原区', '710400', '丰原', '3', '04', '420', '中国,台湾,台中市,丰原区', '120.718460000000', '24.242190000000', 'Fengyuan');
INSERT INTO `cf_areas` VALUES ('710410', '东势区', '710400', '东势', '3', '04', '423', '中国,台湾,台中市,东势区', '120.827770000000', '24.258610000000', 'Dongshi');
INSERT INTO `cf_areas` VALUES ('710411', '大甲区', '710400', '大甲', '3', '04', '437', '中国,台湾,台中市,大甲区', '120.622390000000', '24.348920000000', 'Dajia');
INSERT INTO `cf_areas` VALUES ('710412', '清水区', '710400', '清水', '3', '04', '436', '中国,台湾,台中市,清水区', '120.559780000000', '24.268650000000', 'Qingshui');
INSERT INTO `cf_areas` VALUES ('710413', '沙鹿区', '710400', '沙鹿', '3', '04', '433', '中国,台湾,台中市,沙鹿区', '120.565700000000', '24.233480000000', 'Shalu');
INSERT INTO `cf_areas` VALUES ('710414', '梧栖区', '710400', '梧栖', '3', '04', '435', '中国,台湾,台中市,梧栖区', '120.531520000000', '24.254960000000', 'Wuqi');
INSERT INTO `cf_areas` VALUES ('710415', '后里区', '710400', '后里', '3', '04', '421', '中国,台湾,台中市,后里区', '120.710710000000', '24.304910000000', 'Houli');
INSERT INTO `cf_areas` VALUES ('710416', '神冈区', '710400', '神冈', '3', '04', '429', '中国,台湾,台中市,神冈区', '120.661550000000', '24.257770000000', 'Shengang');
INSERT INTO `cf_areas` VALUES ('710417', '潭子区', '710400', '潭子', '3', '04', '427', '中国,台湾,台中市,潭子区', '120.705160000000', '24.209530000000', 'Tanzi');
INSERT INTO `cf_areas` VALUES ('710418', '大雅区', '710400', '大雅', '3', '04', '428', '中国,台湾,台中市,大雅区', '120.647780000000', '24.229230000000', 'Daya');
INSERT INTO `cf_areas` VALUES ('710419', '新社区', '710400', '新社', '3', '04', '426', '中国,台湾,台中市,新社区', '120.809500000000', '24.234140000000', 'Xinshe');
INSERT INTO `cf_areas` VALUES ('710420', '石冈区', '710400', '石冈', '3', '04', '422', '中国,台湾,台中市,石冈区', '120.780410000000', '24.274980000000', 'Shigang');
INSERT INTO `cf_areas` VALUES ('710421', '外埔区', '710400', '外埔', '3', '04', '438', '中国,台湾,台中市,外埔区', '120.654370000000', '24.332010000000', 'Waipu');
INSERT INTO `cf_areas` VALUES ('710422', '大安区', '710400', '大安', '3', '04', '439', '中国,台湾,台中市,大安区', '120.586520000000', '24.346070000000', 'Da\'an');
INSERT INTO `cf_areas` VALUES ('710423', '乌日区', '710400', '乌日', '3', '04', '414', '中国,台湾,台中市,乌日区', '120.623810000000', '24.104500000000', 'Wuri');
INSERT INTO `cf_areas` VALUES ('710424', '大肚区', '710400', '大肚', '3', '04', '432', '中国,台湾,台中市,大肚区', '120.540960000000', '24.153660000000', 'Dadu');
INSERT INTO `cf_areas` VALUES ('710425', '龙井区', '710400', '龙井', '3', '04', '434', '中国,台湾,台中市,龙井区', '120.545940000000', '24.192710000000', 'Longjing');
INSERT INTO `cf_areas` VALUES ('710426', '雾峰区', '710400', '雾峰', '3', '04', '413', '中国,台湾,台中市,雾峰区', '120.700200000000', '24.061520000000', 'Wufeng');
INSERT INTO `cf_areas` VALUES ('710427', '太平区', '710400', '太平', '3', '04', '411', '中国,台湾,台中市,太平区', '120.718523000000', '24.126472000000', 'Taiping');
INSERT INTO `cf_areas` VALUES ('710428', '大里区', '710400', '大里', '3', '04', '412', '中国,台湾,台中市,大里区', '120.677860000000', '24.099390000000', 'Dali');
INSERT INTO `cf_areas` VALUES ('710429', '和平区', '710400', '和平', '3', '04', '424', '中国,台湾,台中市,和平区', '120.883490000000', '24.174770000000', 'Heping');
INSERT INTO `cf_areas` VALUES ('710500', '台南市', '710000', '台南', '2', '06', '7', '中国,台湾,台南市', '120.279363000000', '23.172478000000', 'Tainan');
INSERT INTO `cf_areas` VALUES ('710501', '东区', '710500', '东区', '3', '06', '701', '中国,台湾,台南市,东区', '120.224198000000', '22.980072000000', 'Dongqu');
INSERT INTO `cf_areas` VALUES ('710502', '南区', '710500', '南区', '3', '06', '702', '中国,台湾,台南市,南区', '120.188648000000', '22.960944000000', 'Nanqu');
INSERT INTO `cf_areas` VALUES ('710504', '北区', '710500', '北区', '3', '06', '704', '中国,台湾,台南市,北区', '120.682410000000', '24.166040000000', 'Beiqu');
INSERT INTO `cf_areas` VALUES ('710506', '安南区', '710500', '安南', '3', '06', '709', '中国,台湾,台南市,安南区', '120.184617000000', '23.047230000000', 'Annan');
INSERT INTO `cf_areas` VALUES ('710507', '安平区', '710500', '安平', '3', '06', '708', '中国,台湾,台南市,安平区', '120.166810000000', '23.000763000000', 'Anping');
INSERT INTO `cf_areas` VALUES ('710508', '中西区', '710500', '中西', '3', '06', '700', '中国,台湾,台南市,中西区', '120.205957000000', '22.992152000000', 'Zhongxi');
INSERT INTO `cf_areas` VALUES ('710509', '新营区', '710500', '新营', '3', '06', '730', '中国,台湾,台南市,新营区', '120.316698000000', '23.310274000000', 'Xinying');
INSERT INTO `cf_areas` VALUES ('710510', '盐水区', '710500', '盐水', '3', '06', '737', '中国,台湾,台南市,盐水区', '120.266398000000', '23.319828000000', 'Yanshui');
INSERT INTO `cf_areas` VALUES ('710511', '白河区', '710500', '白河', '3', '06', '732', '中国,台湾,台南市,白河区', '120.415810000000', '23.351221000000', 'Baihe');
INSERT INTO `cf_areas` VALUES ('710512', '柳营区', '710500', '柳营', '3', '06', '736', '中国,台湾,台南市,柳营区', '120.311286000000', '23.278133000000', 'Liuying');
INSERT INTO `cf_areas` VALUES ('710513', '后壁区', '710500', '后壁', '3', '06', '731', '中国,台湾,台南市,后壁区', '120.362726000000', '23.366721000000', 'Houbi');
INSERT INTO `cf_areas` VALUES ('710514', '东山区', '710500', '东山', '3', '06', '733', '中国,台湾,台南市,东山区', '120.403984000000', '23.326092000000', 'Dongshan');
INSERT INTO `cf_areas` VALUES ('710515', '麻豆区', '710500', '麻豆', '3', '06', '721', '中国,台湾,台南市,麻豆区', '120.248179000000', '23.181680000000', 'Madou');
INSERT INTO `cf_areas` VALUES ('710516', '下营区', '710500', '下营', '3', '06', '735', '中国,台湾,台南市,下营区', '120.264484000000', '23.235413000000', 'Xiaying');
INSERT INTO `cf_areas` VALUES ('710517', '六甲区', '710500', '六甲', '3', '06', '734', '中国,台湾,台南市,六甲区', '120.347600000000', '23.231931000000', 'Liujia');
INSERT INTO `cf_areas` VALUES ('710518', '官田区', '710500', '官田', '3', '06', '720', '中国,台湾,台南市,官田区', '120.314374000000', '23.194652000000', 'Guantian');
INSERT INTO `cf_areas` VALUES ('710519', '大内区', '710500', '大内', '3', '06', '742', '中国,台湾,台南市,大内区', '120.348853000000', '23.119460000000', 'Dana');
INSERT INTO `cf_areas` VALUES ('710520', '佳里区', '710500', '佳里', '3', '06', '722', '中国,台湾,台南市,佳里区', '120.177211000000', '23.165121000000', 'Jiali');
INSERT INTO `cf_areas` VALUES ('710521', '学甲区', '710500', '学甲', '3', '06', '726', '中国,台湾,台南市,学甲区', '120.180255000000', '23.232348000000', 'Xuejia');
INSERT INTO `cf_areas` VALUES ('710522', '西港区', '710500', '西港', '3', '06', '723', '中国,台湾,台南市,西港区', '120.203618000000', '23.123057000000', 'Xigang');
INSERT INTO `cf_areas` VALUES ('710523', '七股区', '710500', '七股', '3', '06', '724', '中国,台湾,台南市,七股区', '120.140003000000', '23.140545000000', 'Qigu');
INSERT INTO `cf_areas` VALUES ('710524', '将军区', '710500', '将军', '3', '06', '725', '中国,台湾,台南市,将军区', '120.156871000000', '23.199543000000', 'Jiangjun');
INSERT INTO `cf_areas` VALUES ('710525', '北门区', '710500', '北门', '3', '06', '727', '中国,台湾,台南市,北门区', '120.125821000000', '23.267148000000', 'Beimen');
INSERT INTO `cf_areas` VALUES ('710526', '新化区', '710500', '新化', '3', '06', '712', '中国,台湾,台南市,新化区', '120.310807000000', '23.038533000000', 'Xinhua');
INSERT INTO `cf_areas` VALUES ('710527', '善化区', '710500', '善化', '3', '06', '741', '中国,台湾,台南市,善化区', '120.296895000000', '23.132261000000', 'Shanhua');
INSERT INTO `cf_areas` VALUES ('710528', '新市区', '710500', '新市', '3', '06', '744', '中国,台湾,台南市,新市区', '120.295138000000', '23.078970000000', 'Xinshi');
INSERT INTO `cf_areas` VALUES ('710529', '安定区', '710500', '安定', '3', '06', '745', '中国,台湾,台南市,安定区', '120.237083000000', '23.121498000000', 'Anding');
INSERT INTO `cf_areas` VALUES ('710530', '山上区', '710500', '山上', '3', '06', '743', '中国,台湾,台南市,山上区', '120.352908000000', '23.103223000000', 'Shanshang');
INSERT INTO `cf_areas` VALUES ('710531', '玉井区', '710500', '玉井', '3', '06', '714', '中国,台湾,台南市,玉井区', '120.460110000000', '23.123859000000', 'Yujing');
INSERT INTO `cf_areas` VALUES ('710532', '楠西区', '710500', '楠西', '3', '06', '715', '中国,台湾,台南市,楠西区', '120.485396000000', '23.173454000000', 'Nanxi');
INSERT INTO `cf_areas` VALUES ('710533', '南化区', '710500', '南化', '3', '06', '716', '中国,台湾,台南市,南化区', '120.477116000000', '23.042614000000', 'Nanhua');
INSERT INTO `cf_areas` VALUES ('710534', '左镇区', '710500', '左镇', '3', '06', '713', '中国,台湾,台南市,左镇区', '120.407309000000', '23.057955000000', 'Zuozhen');
INSERT INTO `cf_areas` VALUES ('710535', '仁德区', '710500', '仁德', '3', '06', '717', '中国,台湾,台南市,仁德区', '120.251520000000', '22.972212000000', 'Rende');
INSERT INTO `cf_areas` VALUES ('710536', '归仁区', '710500', '归仁', '3', '06', '711', '中国,台湾,台南市,归仁区', '120.293791000000', '22.967081000000', 'Guiren');
INSERT INTO `cf_areas` VALUES ('710537', '关庙区', '710500', '关庙', '3', '06', '718', '中国,台湾,台南市,关庙区', '120.327689000000', '22.962949000000', 'Guanmiao');
INSERT INTO `cf_areas` VALUES ('710538', '龙崎区', '710500', '龙崎', '3', '06', '719', '中国,台湾,台南市,龙崎区', '120.360824000000', '22.965681000000', 'Longqi');
INSERT INTO `cf_areas` VALUES ('710539', '永康区', '710500', '永康', '3', '06', '710', '中国,台湾,台南市,永康区', '120.257069000000', '23.026061000000', 'Yongkang');
INSERT INTO `cf_areas` VALUES ('710600', '新竹市', '710000', '新竹', '2', '03', '3', '中国,台湾,新竹市', '120.968798000000', '24.806738000000', 'Hsinchu');
INSERT INTO `cf_areas` VALUES ('710601', '东区', '710600', '东区', '3', '03', '300', '中国,台湾,新竹市,东区', '120.970239000000', '24.801337000000', 'Dongqu');
INSERT INTO `cf_areas` VALUES ('710602', '北区', '710600', '北区', '3', '03', '', '中国,台湾,新竹市,北区', '120.682410000000', '24.166040000000', 'Beiqu');
INSERT INTO `cf_areas` VALUES ('710603', '香山区', '710600', '香山', '3', '03', '', '中国,台湾,新竹市,香山区', '120.956679000000', '24.768933000000', 'Xiangshan');
INSERT INTO `cf_areas` VALUES ('710700', '嘉义市', '710000', '嘉义', '2', '05', '6', '中国,台湾,嘉义市', '120.452538000000', '23.481568000000', 'Chiayi');
INSERT INTO `cf_areas` VALUES ('710701', '东区', '710700', '东区', '3', '05', '600', '中国,台湾,嘉义市,东区', '120.458009000000', '23.486213000000', 'Dongqu');
INSERT INTO `cf_areas` VALUES ('710702', '西区', '710700', '西区', '3', '05', '600', '中国,台湾,嘉义市,西区', '120.437493000000', '23.473029000000', 'Xiqu');
INSERT INTO `cf_areas` VALUES ('710800', '新北市', '710000', '新北', '2', '02', '2', '中国,台湾,新北市', '121.465746000000', '25.012366000000', 'New Taipei');
INSERT INTO `cf_areas` VALUES ('710801', '板桥区', '710800', '板桥', '3', '02', '220', '中国,台湾,新北市,板桥区', '121.459084000000', '25.009578000000', 'Banqiao');
INSERT INTO `cf_areas` VALUES ('710802', '三重区', '710800', '三重', '3', '02', '241', '中国,台湾,新北市,三重区', '121.488102000000', '25.061486000000', 'Sanzhong');
INSERT INTO `cf_areas` VALUES ('710803', '中和区', '710800', '中和', '3', '02', '235', '中国,台湾,新北市,中和区', '121.498980000000', '24.999397000000', 'Zhonghe');
INSERT INTO `cf_areas` VALUES ('710804', '永和区', '710800', '永和', '3', '02', '234', '中国,台湾,新北市,永和区', '121.513660000000', '25.007802000000', 'Yonghe');
INSERT INTO `cf_areas` VALUES ('710805', '新庄区', '710800', '新庄', '3', '02', '242', '中国,台湾,新北市,新庄区', '121.450413000000', '25.035947000000', 'Xinzhuang');
INSERT INTO `cf_areas` VALUES ('710806', '新店区', '710800', '新店', '3', '02', '231', '中国,台湾,新北市,新店区', '121.541750000000', '24.967558000000', 'Xindian');
INSERT INTO `cf_areas` VALUES ('710807', '树林区', '710800', '树林', '3', '02', '238', '中国,台湾,新北市,树林区', '121.420533000000', '24.990706000000', 'Shulin');
INSERT INTO `cf_areas` VALUES ('710808', '莺歌区', '710800', '莺歌', '3', '02', '239', '中国,台湾,新北市,莺歌区', '121.354573000000', '24.955413000000', 'Yingge');
INSERT INTO `cf_areas` VALUES ('710809', '三峡区', '710800', '三峡', '3', '02', '237', '中国,台湾,新北市,三峡区', '121.368905000000', '24.934339000000', 'Sanxia');
INSERT INTO `cf_areas` VALUES ('710810', '淡水区', '710800', '淡水', '3', '02', '251', '中国,台湾,新北市,淡水区', '121.440915000000', '25.169452000000', 'Danshui');
INSERT INTO `cf_areas` VALUES ('710811', '汐止区', '710800', '汐止', '3', '02', '221', '中国,台湾,新北市,汐止区', '121.629470000000', '25.062999000000', 'Xizhi');
INSERT INTO `cf_areas` VALUES ('710812', '瑞芳区', '710800', '瑞芳', '3', '02', '224', '中国,台湾,新北市,瑞芳区', '121.810061000000', '25.108895000000', 'Ruifang');
INSERT INTO `cf_areas` VALUES ('710813', '土城区', '710800', '土城', '3', '02', '236', '中国,台湾,新北市,土城区', '121.443348000000', '24.972201000000', 'Tucheng');
INSERT INTO `cf_areas` VALUES ('710814', '芦洲区', '710800', '芦洲', '3', '02', '247', '中国,台湾,新北市,芦洲区', '121.473700000000', '25.084923000000', 'Luzhou');
INSERT INTO `cf_areas` VALUES ('710815', '五股区', '710800', '五股', '3', '02', '248', '中国,台湾,新北市,五股区', '121.438156000000', '25.082743000000', 'Wugu');
INSERT INTO `cf_areas` VALUES ('710816', '泰山区', '710800', '泰山', '3', '02', '243', '中国,台湾,新北市,泰山区', '121.430811000000', '25.058864000000', 'Taishan');
INSERT INTO `cf_areas` VALUES ('710817', '林口区', '710800', '林口', '3', '02', '244', '中国,台湾,新北市,林口区', '121.391602000000', '25.077531000000', 'Linkou');
INSERT INTO `cf_areas` VALUES ('710818', '深坑区', '710800', '深坑', '3', '02', '222', '中国,台湾,新北市,深坑区', '121.615670000000', '25.002329000000', 'Shenkeng');
INSERT INTO `cf_areas` VALUES ('710819', '石碇区', '710800', '石碇', '3', '02', '223', '中国,台湾,新北市,石碇区', '121.658567000000', '24.991679000000', 'Shiding');
INSERT INTO `cf_areas` VALUES ('710820', '坪林区', '710800', '坪林', '3', '02', '232', '中国,台湾,新北市,坪林区', '121.711185000000', '24.937388000000', 'Pinglin');
INSERT INTO `cf_areas` VALUES ('710821', '三芝区', '710800', '三芝', '3', '02', '252', '中国,台湾,新北市,三芝区', '121.500866000000', '25.258047000000', 'Sanzhi');
INSERT INTO `cf_areas` VALUES ('710822', '石门区', '710800', '石门', '3', '02', '253', '中国,台湾,新北市,石门区', '121.568491000000', '25.290412000000', 'Shimen');
INSERT INTO `cf_areas` VALUES ('710823', '八里区', '710800', '八里', '3', '02', '249', '中国,台湾,新北市,八里区', '121.398227000000', '25.146680000000', 'Bali');
INSERT INTO `cf_areas` VALUES ('710824', '平溪区', '710800', '平溪', '3', '02', '226', '中国,台湾,新北市,平溪区', '121.738255000000', '25.025725000000', 'Pingxi');
INSERT INTO `cf_areas` VALUES ('710825', '双溪区', '710800', '双溪', '3', '02', '227', '中国,台湾,新北市,双溪区', '121.865676000000', '25.033409000000', 'Shuangxi');
INSERT INTO `cf_areas` VALUES ('710826', '贡寮区', '710800', '贡寮', '3', '02', '228', '中国,台湾,新北市,贡寮区', '121.908185000000', '25.022388000000', 'Gongliao');
INSERT INTO `cf_areas` VALUES ('710827', '金山区', '710800', '金山', '3', '02', '208', '中国,台湾,新北市,金山区', '121.636427000000', '25.221883000000', 'Jinshan');
INSERT INTO `cf_areas` VALUES ('710828', '万里区', '710800', '万里', '3', '02', '207', '中国,台湾,新北市,万里区', '121.688687000000', '25.181234000000', 'Wanli');
INSERT INTO `cf_areas` VALUES ('710829', '乌来区', '710800', '乌来', '3', '02', '233', '中国,台湾,新北市,乌来区', '121.550531000000', '24.865296000000', 'Wulai');
INSERT INTO `cf_areas` VALUES ('712200', '宜兰县', '710000', '宜兰', '2', '03', '2', '中国,台湾,宜兰县', '121.500000000000', '24.600000000000', 'Yilan');
INSERT INTO `cf_areas` VALUES ('712201', '宜兰市', '712200', '宜兰', '3', '03', '260', '中国,台湾,宜兰县,宜兰市', '121.753476000000', '24.751682000000', 'Yilan');
INSERT INTO `cf_areas` VALUES ('712221', '罗东镇', '712200', '罗东', '3', '03', '265', '中国,台湾,宜兰县,罗东镇', '121.766919000000', '24.677033000000', 'Luodong');
INSERT INTO `cf_areas` VALUES ('712222', '苏澳镇', '712200', '苏澳', '3', '03', '270', '中国,台湾,宜兰县,苏澳镇', '121.842656000000', '24.594622000000', 'Suao');
INSERT INTO `cf_areas` VALUES ('712223', '头城镇', '712200', '头城', '3', '03', '261', '中国,台湾,宜兰县,头城镇', '121.823307000000', '24.859217000000', 'Toucheng');
INSERT INTO `cf_areas` VALUES ('712224', '礁溪乡', '712200', '礁溪', '3', '03', '262', '中国,台湾,宜兰县,礁溪乡', '121.766680000000', '24.822345000000', 'Jiaoxi');
INSERT INTO `cf_areas` VALUES ('712225', '壮围乡', '712200', '壮围', '3', '03', '263', '中国,台湾,宜兰县,壮围乡', '121.781619000000', '24.744949000000', 'Zhuangwei');
INSERT INTO `cf_areas` VALUES ('712226', '员山乡', '712200', '员山', '3', '03', '264', '中国,台湾,宜兰县,员山乡', '121.721733000000', '24.741771000000', 'Yuanshan');
INSERT INTO `cf_areas` VALUES ('712227', '冬山乡', '712200', '冬山', '3', '03', '269', '中国,台湾,宜兰县,冬山乡', '121.792280000000', '24.634514000000', 'Dongshan');
INSERT INTO `cf_areas` VALUES ('712228', '五结乡', '712200', '五结', '3', '03', '268', '中国,台湾,宜兰县,五结乡', '121.798297000000', '24.684640000000', 'Wujie');
INSERT INTO `cf_areas` VALUES ('712229', '三星乡', '712200', '三星', '3', '03', '266', '中国,台湾,宜兰县,三星乡', '121.003418000000', '23.775291000000', 'Sanxing');
INSERT INTO `cf_areas` VALUES ('712230', '大同乡', '712200', '大同', '3', '03', '267', '中国,台湾,宜兰县,大同乡', '121.605557000000', '24.675997000000', 'Datong');
INSERT INTO `cf_areas` VALUES ('712231', '南澳乡', '712200', '南澳', '3', '03', '272', '中国,台湾,宜兰县,南澳乡', '121.799810000000', '24.465393000000', 'Nanao');
INSERT INTO `cf_areas` VALUES ('712300', '桃园县', '710000', '桃园', '2', '03', '3', '中国,台湾,桃园县', '121.083000000000', '25.000000000000', 'Taoyuan');
INSERT INTO `cf_areas` VALUES ('712301', '桃园市', '712300', '桃园', '3', '03', '330', '中国,台湾,桃园县,桃园市', '121.301337000000', '24.993777000000', 'Taoyuan');
INSERT INTO `cf_areas` VALUES ('712302', '中坜市', '712300', '中坜', '3', '03', '320', '中国,台湾,桃园县,中坜市', '121.224926000000', '24.965353000000', 'Zhongli');
INSERT INTO `cf_areas` VALUES ('712303', '平镇市', '712300', '平镇', '3', '03', '324', '中国,台湾,桃园县,平镇市', '121.218359000000', '24.945752000000', 'Pingzhen');
INSERT INTO `cf_areas` VALUES ('712304', '八德市', '712300', '八德', '3', '03', '334', '中国,台湾,桃园县,八德市', '121.284655000000', '24.928651000000', 'Bade');
INSERT INTO `cf_areas` VALUES ('712305', '杨梅市', '712300', '杨梅', '3', '03', '326', '中国,台湾,桃园县,杨梅市', '121.145873000000', '24.907575000000', 'Yangmei');
INSERT INTO `cf_areas` VALUES ('712306', '芦竹市', '712300', '芦竹', '3', '03', '338', '中国,台湾,桃园县,芦竹市', '121.292064000000', '25.045392000000', 'Luzhu');
INSERT INTO `cf_areas` VALUES ('712321', '大溪镇', '712300', '大溪', '3', '03', '335', '中国,台湾,桃园县,大溪镇', '121.286962000000', '24.880584000000', 'Daxi');
INSERT INTO `cf_areas` VALUES ('712324', '大园乡', '712300', '大园', '3', '03', '337', '中国,台湾,桃园县,大园乡', '121.196292000000', '25.064471000000', 'Dayuan');
INSERT INTO `cf_areas` VALUES ('712325', '龟山乡', '712300', '龟山', '3', '03', '333', '中国,台湾,桃园县,龟山乡', '121.337767000000', '24.992517000000', 'Guishan');
INSERT INTO `cf_areas` VALUES ('712327', '龙潭乡', '712300', '龙潭', '3', '03', '325', '中国,台湾,桃园县,龙潭乡', '121.216392000000', '24.863851000000', 'Longtan');
INSERT INTO `cf_areas` VALUES ('712329', '新屋乡', '712300', '新屋', '3', '03', '327', '中国,台湾,桃园县,新屋乡', '121.105801000000', '24.972203000000', 'Xinwu');
INSERT INTO `cf_areas` VALUES ('712330', '观音乡', '712300', '观音', '3', '03', '328', '中国,台湾,桃园县,观音乡', '121.077519000000', '25.033303000000', 'Guanyin');
INSERT INTO `cf_areas` VALUES ('712331', '复兴乡', '712300', '复兴', '3', '03', '336', '中国,台湾,桃园县,复兴乡', '121.352613000000', '24.820908000000', 'Fuxing');
INSERT INTO `cf_areas` VALUES ('712400', '新竹县', '710000', '新竹', '2', '03', '3', '中国,台湾,新竹县', '121.160000000000', '24.600000000000', 'Hsinchu');
INSERT INTO `cf_areas` VALUES ('712401', '竹北市', '712400', '竹北', '3', '03', '302', '中国,台湾,新竹县,竹北市', '121.004317000000', '24.839652000000', 'Zhubei');
INSERT INTO `cf_areas` VALUES ('712421', '竹东镇', '712400', '竹东', '3', '03', '310', '中国,台湾,新竹县,竹东镇', '121.086418000000', '24.733601000000', 'Zhudong');
INSERT INTO `cf_areas` VALUES ('712422', '新埔镇', '712400', '新埔', '3', '03', '305', '中国,台湾,新竹县,新埔镇', '121.072804000000', '24.824820000000', 'Xinpu');
INSERT INTO `cf_areas` VALUES ('712423', '关西镇', '712400', '关西', '3', '03', '306', '中国,台湾,新竹县,关西镇', '121.177301000000', '24.788842000000', 'Guanxi');
INSERT INTO `cf_areas` VALUES ('712424', '湖口乡', '712400', '湖口', '3', '03', '303', '中国,台湾,新竹县,湖口乡', '121.043691000000', '24.903943000000', 'Hukou');
INSERT INTO `cf_areas` VALUES ('712425', '新丰乡', '712400', '新丰', '3', '03', '304', '中国,台湾,新竹县,新丰乡', '120.983006000000', '24.899600000000', 'Xinfeng');
INSERT INTO `cf_areas` VALUES ('712426', '芎林乡', '712400', '芎林', '3', '03', '307', '中国,台湾,新竹县,芎林乡', '121.076924000000', '24.774436000000', 'Xionglin');
INSERT INTO `cf_areas` VALUES ('712427', '横山乡', '712400', '横山', '3', '03', '312', '中国,台湾,新竹县,横山乡', '121.116244000000', '24.720807000000', 'Hengshan');
INSERT INTO `cf_areas` VALUES ('712428', '北埔乡', '712400', '北埔', '3', '03', '314', '中国,台湾,新竹县,北埔乡', '121.053156000000', '24.697126000000', 'Beipu');
INSERT INTO `cf_areas` VALUES ('712429', '宝山乡', '712400', '宝山', '3', '03', '308', '中国,台湾,新竹县,宝山乡', '120.985752000000', '24.760975000000', 'Baoshan');
INSERT INTO `cf_areas` VALUES ('712430', '峨眉乡', '712400', '峨眉', '3', '03', '315', '中国,台湾,新竹县,峨眉乡', '121.015291000000', '24.686127000000', 'Emei');
INSERT INTO `cf_areas` VALUES ('712431', '尖石乡', '712400', '尖石', '3', '03', '313', '中国,台湾,新竹县,尖石乡', '121.197802000000', '24.704360000000', 'Jianshi');
INSERT INTO `cf_areas` VALUES ('712432', '五峰乡', '712400', '五峰', '3', '03', '311', '中国,台湾,新竹县,五峰乡', '121.003418000000', '23.775291000000', 'Wufeng');
INSERT INTO `cf_areas` VALUES ('712500', '苗栗县', '710000', '苗栗', '2', '037', '3', '中国,台湾,苗栗县', '120.750000000000', '24.500000000000', 'Miaoli');
INSERT INTO `cf_areas` VALUES ('712501', '苗栗市', '712500', '苗栗', '3', '037', '360', '中国,台湾,苗栗县,苗栗市', '120.818869000000', '24.561472000000', 'Miaoli');
INSERT INTO `cf_areas` VALUES ('712521', '苑里镇', '712500', '苑里', '3', '037', '358', '中国,台湾,苗栗县,苑里镇', '120.648907000000', '24.441750000000', 'Yuanli');
INSERT INTO `cf_areas` VALUES ('712522', '通霄镇', '712500', '通霄', '3', '037', '357', '中国,台湾,苗栗县,通霄镇', '120.676700000000', '24.489087000000', 'Tongxiao');
INSERT INTO `cf_areas` VALUES ('712523', '竹南镇', '712500', '竹南', '3', '037', '350', '中国,台湾,苗栗县,竹南镇', '120.872641000000', '24.685513000000', 'Zhunan');
INSERT INTO `cf_areas` VALUES ('712524', '头份镇', '712500', '头份', '3', '037', '351', '中国,台湾,苗栗县,头份镇', '120.895188000000', '24.687993000000', 'Toufen');
INSERT INTO `cf_areas` VALUES ('712525', '后龙镇', '712500', '后龙', '3', '037', '356', '中国,台湾,苗栗县,后龙镇', '120.786480000000', '24.612617000000', 'Houlong');
INSERT INTO `cf_areas` VALUES ('712526', '卓兰镇', '712500', '卓兰', '3', '037', '369', '中国,台湾,苗栗县,卓兰镇', '120.823441000000', '24.309509000000', 'Zhuolan');
INSERT INTO `cf_areas` VALUES ('712527', '大湖乡', '712500', '大湖', '3', '037', '364', '中国,台湾,苗栗县,大湖乡', '120.863641000000', '24.422547000000', 'Dahu');
INSERT INTO `cf_areas` VALUES ('712528', '公馆乡', '712500', '公馆', '3', '037', '363', '中国,台湾,苗栗县,公馆乡', '120.822983000000', '24.499108000000', 'Gongguan');
INSERT INTO `cf_areas` VALUES ('712529', '铜锣乡', '712500', '铜锣', '3', '037', '366', '中国,台湾,苗栗县,铜锣乡', '121.003418000000', '23.775291000000', 'Tongluo');
INSERT INTO `cf_areas` VALUES ('712530', '南庄乡', '712500', '南庄', '3', '037', '353', '中国,台湾,苗栗县,南庄乡', '120.994957000000', '24.596835000000', 'Nanzhuang');
INSERT INTO `cf_areas` VALUES ('712531', '头屋乡', '712500', '头屋', '3', '037', '362', '中国,台湾,苗栗县,头屋乡', '120.846616000000', '24.574249000000', 'Touwu');
INSERT INTO `cf_areas` VALUES ('712532', '三义乡', '712500', '三义', '3', '037', '367', '中国,台湾,苗栗县,三义乡', '120.742340000000', '24.350270000000', 'Sanyi');
INSERT INTO `cf_areas` VALUES ('712533', '西湖乡', '712500', '西湖', '3', '037', '368', '中国,台湾,苗栗县,西湖乡', '121.003418000000', '23.775291000000', 'Xihu');
INSERT INTO `cf_areas` VALUES ('712534', '造桥乡', '712500', '造桥', '3', '037', '361', '中国,台湾,苗栗县,造桥乡', '120.862399000000', '24.637537000000', 'Zaoqiao');
INSERT INTO `cf_areas` VALUES ('712535', '三湾乡', '712500', '三湾', '3', '037', '352', '中国,台湾,苗栗县,三湾乡', '120.951484000000', '24.651051000000', 'Sanwan');
INSERT INTO `cf_areas` VALUES ('712536', '狮潭乡', '712500', '狮潭', '3', '037', '354', '中国,台湾,苗栗县,狮潭乡', '120.918024000000', '24.540004000000', 'Shitan');
INSERT INTO `cf_areas` VALUES ('712537', '泰安乡', '712500', '泰安', '3', '037', '365', '中国,台湾,苗栗县,泰安乡', '120.904441000000', '24.442600000000', 'Tai\'an');
INSERT INTO `cf_areas` VALUES ('712700', '彰化县', '710000', '彰化', '2', '04', '5', '中国,台湾,彰化县', '120.416000000000', '24.000000000000', 'Changhua');
INSERT INTO `cf_areas` VALUES ('712701', '彰化市', '712700', '彰化市', '3', '04', '500', '中国,台湾,彰化县,彰化市', '120.542294000000', '24.080911000000', 'Zhanghuashi');
INSERT INTO `cf_areas` VALUES ('712721', '鹿港镇', '712700', '鹿港', '3', '04', '505', '中国,台湾,彰化县,鹿港镇', '120.435392000000', '24.056937000000', 'Lugang');
INSERT INTO `cf_areas` VALUES ('712722', '和美镇', '712700', '和美', '3', '04', '508', '中国,台湾,彰化县,和美镇', '120.500265000000', '24.110904000000', 'Hemei');
INSERT INTO `cf_areas` VALUES ('712723', '线西乡', '712700', '线西', '3', '04', '507', '中国,台湾,彰化县,线西乡', '120.465921000000', '24.128653000000', 'Xianxi');
INSERT INTO `cf_areas` VALUES ('712724', '伸港乡', '712700', '伸港', '3', '04', '509', '中国,台湾,彰化县,伸港乡', '120.484224000000', '24.146081000000', 'Shengang');
INSERT INTO `cf_areas` VALUES ('712725', '福兴乡', '712700', '福兴', '3', '04', '506', '中国,台湾,彰化县,福兴乡', '120.443682000000', '24.047883000000', 'Fuxing');
INSERT INTO `cf_areas` VALUES ('712726', '秀水乡', '712700', '秀水', '3', '04', '504', '中国,台湾,彰化县,秀水乡', '120.502658000000', '24.035267000000', 'Xiushui');
INSERT INTO `cf_areas` VALUES ('712727', '花坛乡', '712700', '花坛', '3', '04', '503', '中国,台湾,彰化县,花坛乡', '120.538403000000', '24.029399000000', 'Huatan');
INSERT INTO `cf_areas` VALUES ('712728', '芬园乡', '712700', '芬园', '3', '04', '502', '中国,台湾,彰化县,芬园乡', '120.629024000000', '24.013658000000', 'Fenyuan');
INSERT INTO `cf_areas` VALUES ('712729', '员林镇', '712700', '员林', '3', '04', '510', '中国,台湾,彰化县,员林镇', '120.574625000000', '23.958999000000', 'Yuanlin');
INSERT INTO `cf_areas` VALUES ('712730', '溪湖镇', '712700', '溪湖', '3', '04', '514', '中国,台湾,彰化县,溪湖镇', '120.479144000000', '23.962315000000', 'Xihu');
INSERT INTO `cf_areas` VALUES ('712731', '田中镇', '712700', '田中', '3', '04', '520', '中国,台湾,彰化县,田中镇', '120.580629000000', '23.861718000000', 'Tianzhong');
INSERT INTO `cf_areas` VALUES ('712732', '大村乡', '712700', '大村', '3', '04', '515', '中国,台湾,彰化县,大村乡', '120.540713000000', '23.993726000000', 'Dacun');
INSERT INTO `cf_areas` VALUES ('712733', '埔盐乡', '712700', '埔盐', '3', '04', '516', '中国,台湾,彰化县,埔盐乡', '120.464044000000', '24.000346000000', 'Puyan');
INSERT INTO `cf_areas` VALUES ('712734', '埔心乡', '712700', '埔心', '3', '04', '513', '中国,台湾,彰化县,埔心乡', '120.543568000000', '23.953019000000', 'Puxin');
INSERT INTO `cf_areas` VALUES ('712735', '永靖乡', '712700', '永靖', '3', '04', '512', '中国,台湾,彰化县,永靖乡', '120.547775000000', '23.924703000000', 'Yongjing');
INSERT INTO `cf_areas` VALUES ('712736', '社头乡', '712700', '社头', '3', '04', '511', '中国,台湾,彰化县,社头乡', '120.582681000000', '23.896686000000', 'Shetou');
INSERT INTO `cf_areas` VALUES ('712737', '二水乡', '712700', '二水', '3', '04', '530', '中国,台湾,彰化县,二水乡', '120.618788000000', '23.806995000000', 'Ershui');
INSERT INTO `cf_areas` VALUES ('712738', '北斗镇', '712700', '北斗', '3', '04', '521', '中国,台湾,彰化县,北斗镇', '120.520449000000', '23.870911000000', 'Beidou');
INSERT INTO `cf_areas` VALUES ('712739', '二林镇', '712700', '二林', '3', '04', '526', '中国,台湾,彰化县,二林镇', '120.374468000000', '23.899751000000', 'Erlin');
INSERT INTO `cf_areas` VALUES ('712740', '田尾乡', '712700', '田尾', '3', '04', '522', '中国,台湾,彰化县,田尾乡', '120.524717000000', '23.890735000000', 'Tianwei');
INSERT INTO `cf_areas` VALUES ('712741', '埤头乡', '712700', '埤头', '3', '04', '523', '中国,台湾,彰化县,埤头乡', '120.462599000000', '23.891324000000', 'Pitou');
INSERT INTO `cf_areas` VALUES ('712742', '芳苑乡', '712700', '芳苑', '3', '04', '528', '中国,台湾,彰化县,芳苑乡', '120.320329000000', '23.924222000000', 'Fangyuan');
INSERT INTO `cf_areas` VALUES ('712743', '大城乡', '712700', '大城', '3', '04', '527', '中国,台湾,彰化县,大城乡', '120.320934000000', '23.852382000000', 'Dacheng');
INSERT INTO `cf_areas` VALUES ('712744', '竹塘乡', '712700', '竹塘', '3', '04', '525', '中国,台湾,彰化县,竹塘乡', '120.427499000000', '23.860112000000', 'Zhutang');
INSERT INTO `cf_areas` VALUES ('712745', '溪州乡', '712700', '溪州', '3', '04', '524', '中国,台湾,彰化县,溪州乡', '120.498706000000', '23.851229000000', 'Xizhou');
INSERT INTO `cf_areas` VALUES ('712800', '南投县', '710000', '南投', '2', '049', '5', '中国,台湾,南投县', '120.830000000000', '23.830000000000', 'Nantou');
INSERT INTO `cf_areas` VALUES ('712801', '南投市', '712800', '南投市', '3', '049', '540', '中国,台湾,南投县,南投市', '120.683706000000', '23.909956000000', 'Nantoushi');
INSERT INTO `cf_areas` VALUES ('712821', '埔里镇', '712800', '埔里', '3', '049', '545', '中国,台湾,南投县,埔里镇', '120.964648000000', '23.964789000000', 'Puli');
INSERT INTO `cf_areas` VALUES ('712822', '草屯镇', '712800', '草屯', '3', '049', '542', '中国,台湾,南投县,草屯镇', '120.680343000000', '23.973947000000', 'Caotun');
INSERT INTO `cf_areas` VALUES ('712823', '竹山镇', '712800', '竹山', '3', '049', '557', '中国,台湾,南投县,竹山镇', '120.672007000000', '23.757655000000', 'Zhushan');
INSERT INTO `cf_areas` VALUES ('712824', '集集镇', '712800', '集集', '3', '049', '552', '中国,台湾,南投县,集集镇', '120.783673000000', '23.829013000000', 'Jiji');
INSERT INTO `cf_areas` VALUES ('712825', '名间乡', '712800', '名间', '3', '049', '551', '中国,台湾,南投县,名间乡', '120.702797000000', '23.838427000000', 'Mingjian');
INSERT INTO `cf_areas` VALUES ('712826', '鹿谷乡', '712800', '鹿谷', '3', '049', '558', '中国,台湾,南投县,鹿谷乡', '120.752796000000', '23.744471000000', 'Lugu');
INSERT INTO `cf_areas` VALUES ('712827', '中寮乡', '712800', '中寮', '3', '049', '541', '中国,台湾,南投县,中寮乡', '120.766654000000', '23.878935000000', 'Zhongliao');
INSERT INTO `cf_areas` VALUES ('712828', '鱼池乡', '712800', '鱼池', '3', '049', '555', '中国,台湾,南投县,鱼池乡', '120.936060000000', '23.896356000000', 'Yuchi');
INSERT INTO `cf_areas` VALUES ('712829', '国姓乡', '712800', '国姓', '3', '049', '544', '中国,台湾,南投县,国姓乡', '120.858541000000', '24.042298000000', 'Guoxing');
INSERT INTO `cf_areas` VALUES ('712830', '水里乡', '712800', '水里', '3', '049', '553', '中国,台湾,南投县,水里乡', '120.855912000000', '23.812086000000', 'Shuili');
INSERT INTO `cf_areas` VALUES ('712831', '信义乡', '712800', '信义', '3', '049', '556', '中国,台湾,南投县,信义乡', '120.855257000000', '23.699922000000', 'Xinyi');
INSERT INTO `cf_areas` VALUES ('712832', '仁爱乡', '712800', '仁爱', '3', '049', '546', '中国,台湾,南投县,仁爱乡', '121.133543000000', '24.024429000000', 'Renai');
INSERT INTO `cf_areas` VALUES ('712900', '云林县', '710000', '云林', '2', '05', '6', '中国,台湾,云林县', '120.250000000000', '23.750000000000', 'Yunlin');
INSERT INTO `cf_areas` VALUES ('712901', '斗六市', '712900', '斗六', '3', '05', '640', '中国,台湾,云林县,斗六市', '120.527360000000', '23.697651000000', 'Douliu');
INSERT INTO `cf_areas` VALUES ('712921', '斗南镇', '712900', '斗南', '3', '05', '630', '中国,台湾,云林县,斗南镇', '120.479075000000', '23.679731000000', 'Dounan');
INSERT INTO `cf_areas` VALUES ('712922', '虎尾镇', '712900', '虎尾', '3', '05', '632', '中国,台湾,云林县,虎尾镇', '120.445339000000', '23.708182000000', 'Huwei');
INSERT INTO `cf_areas` VALUES ('712923', '西螺镇', '712900', '西螺', '3', '05', '648', '中国,台湾,云林县,西螺镇', '120.466010000000', '23.797984000000', 'Xiluo');
INSERT INTO `cf_areas` VALUES ('712924', '土库镇', '712900', '土库', '3', '05', '633', '中国,台湾,云林县,土库镇', '120.392572000000', '23.677822000000', 'Tuku');
INSERT INTO `cf_areas` VALUES ('712925', '北港镇', '712900', '北港', '3', '05', '651', '中国,台湾,云林县,北港镇', '120.302393000000', '23.575525000000', 'Beigang');
INSERT INTO `cf_areas` VALUES ('712926', '古坑乡', '712900', '古坑', '3', '05', '646', '中国,台湾,云林县,古坑乡', '120.562043000000', '23.642568000000', 'Gukeng');
INSERT INTO `cf_areas` VALUES ('712927', '大埤乡', '712900', '大埤', '3', '05', '631', '中国,台湾,云林县,大埤乡', '120.430516000000', '23.645908000000', 'Dapi');
INSERT INTO `cf_areas` VALUES ('712928', '莿桐乡', '712900', '莿桐', '3', '05', '647', '中国,台湾,云林县,莿桐乡', '120.502374000000', '23.760784000000', 'Citong');
INSERT INTO `cf_areas` VALUES ('712929', '林内乡', '712900', '林内', '3', '05', '643', '中国,台湾,云林县,林内乡', '120.611365000000', '23.758712000000', 'Linna');
INSERT INTO `cf_areas` VALUES ('712930', '二仑乡', '712900', '二仑', '3', '05', '649', '中国,台湾,云林县,二仑乡', '120.415077000000', '23.771273000000', 'Erlun');
INSERT INTO `cf_areas` VALUES ('712931', '仑背乡', '712900', '仑背', '3', '05', '637', '中国,台湾,云林县,仑背乡', '120.353895000000', '23.758840000000', 'Lunbei');
INSERT INTO `cf_areas` VALUES ('712932', '麦寮乡', '712900', '麦寮', '3', '05', '638', '中国,台湾,云林县,麦寮乡', '120.252043000000', '23.753841000000', 'Mailiao');
INSERT INTO `cf_areas` VALUES ('712933', '东势乡', '712900', '东势', '3', '05', '635', '中国,台湾,云林县,东势乡', '120.252672000000', '23.674679000000', 'Dongshi');
INSERT INTO `cf_areas` VALUES ('712934', '褒忠乡', '712900', '褒忠', '3', '05', '634', '中国,台湾,云林县,褒忠乡', '120.310488000000', '23.694245000000', 'Baozhong');
INSERT INTO `cf_areas` VALUES ('712935', '台西乡', '712900', '台西', '3', '05', '636', '中国,台湾,云林县,台西乡', '120.196141000000', '23.702819000000', 'Taixi');
INSERT INTO `cf_areas` VALUES ('712936', '元长乡', '712900', '元长', '3', '05', '655', '中国,台湾,云林县,元长乡', '120.315124000000', '23.649458000000', 'Yuanchang');
INSERT INTO `cf_areas` VALUES ('712937', '四湖乡', '712900', '四湖', '3', '05', '654', '中国,台湾,云林县,四湖乡', '120.225741000000', '23.637740000000', 'Sihu');
INSERT INTO `cf_areas` VALUES ('712938', '口湖乡', '712900', '口湖', '3', '05', '653', '中国,台湾,云林县,口湖乡', '120.185370000000', '23.582406000000', 'Kouhu');
INSERT INTO `cf_areas` VALUES ('712939', '水林乡', '712900', '水林', '3', '05', '652', '中国,台湾,云林县,水林乡', '120.245948000000', '23.572634000000', 'Shuilin');
INSERT INTO `cf_areas` VALUES ('713000', '嘉义县', '710000', '嘉义', '2', '05', '6', '中国,台湾,嘉义县', '120.300000000000', '23.500000000000', 'Chiayi');
INSERT INTO `cf_areas` VALUES ('713001', '太保市', '713000', '太保', '3', '05', '612', '中国,台湾,嘉义县,太保市', '120.332876000000', '23.459647000000', 'Taibao');
INSERT INTO `cf_areas` VALUES ('713002', '朴子市', '713000', '朴子', '3', '05', '613', '中国,台湾,嘉义县,朴子市', '120.247014000000', '23.464961000000', 'Puzi');
INSERT INTO `cf_areas` VALUES ('713023', '布袋镇', '713000', '布袋', '3', '05', '625', '中国,台湾,嘉义县,布袋镇', '120.166936000000', '23.377979000000', 'Budai');
INSERT INTO `cf_areas` VALUES ('713024', '大林镇', '713000', '大林', '3', '05', '622', '中国,台湾,嘉义县,大林镇', '120.471336000000', '23.603815000000', 'Dalin');
INSERT INTO `cf_areas` VALUES ('713025', '民雄乡', '713000', '民雄', '3', '05', '621', '中国,台湾,嘉义县,民雄乡', '120.428577000000', '23.551456000000', 'Minxiong');
INSERT INTO `cf_areas` VALUES ('713026', '溪口乡', '713000', '溪口', '3', '05', '623', '中国,台湾,嘉义县,溪口乡', '120.393822000000', '23.602223000000', 'Xikou');
INSERT INTO `cf_areas` VALUES ('713027', '新港乡', '713000', '新港', '3', '05', '616', '中国,台湾,嘉义县,新港乡', '120.347647000000', '23.551806000000', 'Xingang');
INSERT INTO `cf_areas` VALUES ('713028', '六脚乡', '713000', '六脚', '3', '05', '615', '中国,台湾,嘉义县,六脚乡', '120.291083000000', '23.493942000000', 'Liujiao');
INSERT INTO `cf_areas` VALUES ('713029', '东石乡', '713000', '东石', '3', '05', '614', '中国,台湾,嘉义县,东石乡', '120.153822000000', '23.459235000000', 'Dongshi');
INSERT INTO `cf_areas` VALUES ('713030', '义竹乡', '713000', '义竹', '3', '05', '624', '中国,台湾,嘉义县,义竹乡', '120.243423000000', '23.336277000000', 'Yizhu');
INSERT INTO `cf_areas` VALUES ('713031', '鹿草乡', '713000', '鹿草', '3', '05', '611', '中国,台湾,嘉义县,鹿草乡', '120.308370000000', '23.410784000000', 'Lucao');
INSERT INTO `cf_areas` VALUES ('713032', '水上乡', '713000', '水上', '3', '05', '608', '中国,台湾,嘉义县,水上乡', '120.397936000000', '23.428104000000', 'Shuishang');
INSERT INTO `cf_areas` VALUES ('713033', '中埔乡', '713000', '中埔', '3', '05', '606', '中国,台湾,嘉义县,中埔乡', '120.522948000000', '23.425148000000', 'Zhongpu');
INSERT INTO `cf_areas` VALUES ('713034', '竹崎乡', '713000', '竹崎', '3', '05', '604', '中国,台湾,嘉义县,竹崎乡', '120.551466000000', '23.523184000000', 'Zhuqi');
INSERT INTO `cf_areas` VALUES ('713035', '梅山乡', '713000', '梅山', '3', '05', '603', '中国,台湾,嘉义县,梅山乡', '120.557192000000', '23.584915000000', 'Meishan');
INSERT INTO `cf_areas` VALUES ('713036', '番路乡', '713000', '番路', '3', '05', '602', '中国,台湾,嘉义县,番路乡', '120.555043000000', '23.465222000000', 'Fanlu');
INSERT INTO `cf_areas` VALUES ('713037', '大埔乡', '713000', '大埔', '3', '05', '607', '中国,台湾,嘉义县,大埔乡', '120.593795000000', '23.296715000000', 'Dapu');
INSERT INTO `cf_areas` VALUES ('713038', '阿里山乡', '713000', '阿里山', '3', '05', '605', '中国,台湾,嘉义县,阿里山乡', '120.732520000000', '23.467950000000', 'Alishan');
INSERT INTO `cf_areas` VALUES ('713300', '屏东县', '710000', '屏东', '2', '08', '9', '中国,台湾,屏东县', '120.487928000000', '22.682802000000', 'Pingtung');
INSERT INTO `cf_areas` VALUES ('713301', '屏东市', '713300', '屏东', '3', '08', '900', '中国,台湾,屏东县,屏东市', '120.488465000000', '22.669723000000', 'Pingdong');
INSERT INTO `cf_areas` VALUES ('713321', '潮州镇', '713300', '潮州', '3', '08', '920', '中国,台湾,屏东县,潮州镇', '120.542854000000', '22.550536000000', 'Chaozhou');
INSERT INTO `cf_areas` VALUES ('713322', '东港镇', '713300', '东港', '3', '08', '928', '中国,台湾,屏东县,东港镇', '120.454489000000', '22.466626000000', 'Donggang');
INSERT INTO `cf_areas` VALUES ('713323', '恒春镇', '713300', '恒春', '3', '08', '946', '中国,台湾,屏东县,恒春镇', '120.745451000000', '22.002373000000', 'Hengchun');
INSERT INTO `cf_areas` VALUES ('713324', '万丹乡', '713300', '万丹', '3', '08', '913', '中国,台湾,屏东县,万丹乡', '120.484533000000', '22.589839000000', 'Wandan');
INSERT INTO `cf_areas` VALUES ('713325', '长治乡', '713300', '长治', '3', '08', '908', '中国,台湾,屏东县,长治乡', '120.527614000000', '22.677062000000', 'Changzhi');
INSERT INTO `cf_areas` VALUES ('713326', '麟洛乡', '713300', '麟洛', '3', '08', '909', '中国,台湾,屏东县,麟洛乡', '120.527283000000', '22.650604000000', 'Linluo');
INSERT INTO `cf_areas` VALUES ('713327', '九如乡', '713300', '九如', '3', '08', '904', '中国,台湾,屏东县,九如乡', '120.490142000000', '22.739778000000', 'Jiuru');
INSERT INTO `cf_areas` VALUES ('713328', '里港乡', '713300', '里港', '3', '08', '905', '中国,台湾,屏东县,里港乡', '120.494490000000', '22.779220000000', 'Ligang');
INSERT INTO `cf_areas` VALUES ('713329', '盐埔乡', '713300', '盐埔', '3', '08', '907', '中国,台湾,屏东县,盐埔乡', '120.572849000000', '22.754783000000', 'Yanpu');
INSERT INTO `cf_areas` VALUES ('713330', '高树乡', '713300', '高树', '3', '08', '906', '中国,台湾,屏东县,高树乡', '120.600214000000', '22.826789000000', 'Gaoshu');
INSERT INTO `cf_areas` VALUES ('713331', '万峦乡', '713300', '万峦', '3', '08', '923', '中国,台湾,屏东县,万峦乡', '120.566477000000', '22.571965000000', 'Wanluan');
INSERT INTO `cf_areas` VALUES ('713332', '内埔乡', '713300', '内埔', '3', '08', '912', '中国,台湾,屏东县,内埔乡', '120.566865000000', '22.611967000000', 'Napu');
INSERT INTO `cf_areas` VALUES ('713333', '竹田乡', '713300', '竹田', '3', '08', '911', '中国,台湾,屏东县,竹田乡', '120.544038000000', '22.584678000000', 'Zhutian');
INSERT INTO `cf_areas` VALUES ('713334', '新埤乡', '713300', '新埤', '3', '08', '925', '中国,台湾,屏东县,新埤乡', '120.549546000000', '22.469976000000', 'Xinpi');
INSERT INTO `cf_areas` VALUES ('713335', '枋寮乡', '713300', '枋寮', '3', '08', '940', '中国,台湾,屏东县,枋寮乡', '120.593438000000', '22.365560000000', 'Fangliao');
INSERT INTO `cf_areas` VALUES ('713336', '新园乡', '713300', '新园', '3', '08', '932', '中国,台湾,屏东县,新园乡', '120.461739000000', '22.543952000000', 'Xinyuan');
INSERT INTO `cf_areas` VALUES ('713337', '崁顶乡', '713300', '崁顶', '3', '08', '924', '中国,台湾,屏东县,崁顶乡', '120.514571000000', '22.514795000000', 'Kanding');
INSERT INTO `cf_areas` VALUES ('713338', '林边乡', '713300', '林边', '3', '08', '927', '中国,台湾,屏东县,林边乡', '120.515091000000', '22.434015000000', 'Linbian');
INSERT INTO `cf_areas` VALUES ('713339', '南州乡', '713300', '南州', '3', '08', '926', '中国,台湾,屏东县,南州乡', '120.509808000000', '22.490192000000', 'Nanzhou');
INSERT INTO `cf_areas` VALUES ('713340', '佳冬乡', '713300', '佳冬', '3', '08', '931', '中国,台湾,屏东县,佳冬乡', '120.551544000000', '22.417653000000', 'Jiadong');
INSERT INTO `cf_areas` VALUES ('713341', '琉球乡', '713300', '琉球', '3', '08', '929', '中国,台湾,屏东县,琉球乡', '120.369020000000', '22.342366000000', 'Liuqiu');
INSERT INTO `cf_areas` VALUES ('713342', '车城乡', '713300', '车城', '3', '08', '944', '中国,台湾,屏东县,车城乡', '120.710979000000', '22.072077000000', 'Checheng');
INSERT INTO `cf_areas` VALUES ('713343', '满州乡', '713300', '满州', '3', '08', '947', '中国,台湾,屏东县,满州乡', '120.838843000000', '22.020853000000', 'Manzhou');
INSERT INTO `cf_areas` VALUES ('713344', '枋山乡', '713300', '枋山', '3', '08', '941', '中国,台湾,屏东县,枋山乡', '120.656356000000', '22.260338000000', 'Fangshan');
INSERT INTO `cf_areas` VALUES ('713345', '三地门乡', '713300', '三地门', '3', '08', '901', '中国,台湾,屏东县,三地门乡', '120.654486000000', '22.713877000000', 'Sandimen');
INSERT INTO `cf_areas` VALUES ('713346', '雾台乡', '713300', '雾台', '3', '08', '902', '中国,台湾,屏东县,雾台乡', '120.732318000000', '22.744877000000', 'Wutai');
INSERT INTO `cf_areas` VALUES ('713347', '玛家乡', '713300', '玛家', '3', '08', '903', '中国,台湾,屏东县,玛家乡', '120.644130000000', '22.706718000000', 'Majia');
INSERT INTO `cf_areas` VALUES ('713348', '泰武乡', '713300', '泰武', '3', '08', '921', '中国,台湾,屏东县,泰武乡', '120.632856000000', '22.591819000000', 'Taiwu');
INSERT INTO `cf_areas` VALUES ('713349', '来义乡', '713300', '来义', '3', '08', '922', '中国,台湾,屏东县,来义乡', '120.633601000000', '22.525866000000', 'Laiyi');
INSERT INTO `cf_areas` VALUES ('713350', '春日乡', '713300', '春日', '3', '08', '942', '中国,台湾,屏东县,春日乡', '120.628793000000', '22.370672000000', 'Chunri');
INSERT INTO `cf_areas` VALUES ('713351', '狮子乡', '713300', '狮子', '3', '08', '943', '中国,台湾,屏东县,狮子乡', '120.704617000000', '22.201917000000', 'Shizi');
INSERT INTO `cf_areas` VALUES ('713352', '牡丹乡', '713300', '牡丹', '3', '08', '945', '中国,台湾,屏东县,牡丹乡', '120.770108000000', '22.125687000000', 'Mudan');
INSERT INTO `cf_areas` VALUES ('713400', '台东县', '710000', '台东', '2', '089', '9', '中国,台湾,台东县', '120.916000000000', '23.000000000000', 'Taitung');
INSERT INTO `cf_areas` VALUES ('713401', '台东市', '713400', '台东', '3', '089', '950', '中国,台湾,台东县,台东市', '121.145654000000', '22.756045000000', 'Taidong');
INSERT INTO `cf_areas` VALUES ('713421', '成功镇', '713400', '成功', '3', '089', '961', '中国,台湾,台东县,成功镇', '121.379571000000', '23.100223000000', 'Chenggong');
INSERT INTO `cf_areas` VALUES ('713422', '关山镇', '713400', '关山', '3', '089', '956', '中国,台湾,台东县,关山镇', '121.163134000000', '23.047450000000', 'Guanshan');
INSERT INTO `cf_areas` VALUES ('713423', '卑南乡', '713400', '卑南', '3', '089', '954', '中国,台湾,台东县,卑南乡', '121.083503000000', '22.786039000000', 'Beinan');
INSERT INTO `cf_areas` VALUES ('713424', '鹿野乡', '713400', '鹿野', '3', '089', '955', '中国,台湾,台东县,鹿野乡', '121.135982000000', '22.913951000000', 'Luye');
INSERT INTO `cf_areas` VALUES ('713425', '池上乡', '713400', '池上', '3', '089', '958', '中国,台湾,台东县,池上乡', '121.215139000000', '23.122393000000', 'Chishang');
INSERT INTO `cf_areas` VALUES ('713426', '东河乡', '713400', '东河', '3', '089', '959', '中国,台湾,台东县,东河乡', '121.300334000000', '22.969934000000', 'Donghe');
INSERT INTO `cf_areas` VALUES ('713427', '长滨乡', '713400', '长滨', '3', '089', '962', '中国,台湾,台东县,长滨乡', '121.451522000000', '23.315041000000', 'Changbin');
INSERT INTO `cf_areas` VALUES ('713428', '太麻里乡', '713400', '太麻里', '3', '089', '963', '中国,台湾,台东县,太麻里乡', '121.007394000000', '22.615383000000', 'Taimali');
INSERT INTO `cf_areas` VALUES ('713429', '大武乡', '713400', '大武', '3', '089', '965', '中国,台湾,台东县,大武乡', '120.889938000000', '22.339919000000', 'Dawu');
INSERT INTO `cf_areas` VALUES ('713430', '绿岛乡', '713400', '绿岛', '3', '089', '951', '中国,台湾,台东县,绿岛乡', '121.492596000000', '22.661676000000', 'Lvdao');
INSERT INTO `cf_areas` VALUES ('713431', '海端乡', '713400', '海端', '3', '089', '957', '中国,台湾,台东县,海端乡', '121.172008000000', '23.101074000000', 'Haiduan');
INSERT INTO `cf_areas` VALUES ('713432', '延平乡', '713400', '延平', '3', '089', '953', '中国,台湾,台东县,延平乡', '121.084499000000', '22.902358000000', 'Yanping');
INSERT INTO `cf_areas` VALUES ('713433', '金峰乡', '713400', '金峰', '3', '089', '964', '中国,台湾,台东县,金峰乡', '120.971292000000', '22.595511000000', 'Jinfeng');
INSERT INTO `cf_areas` VALUES ('713434', '达仁乡', '713400', '达仁', '3', '089', '966', '中国,台湾,台东县,达仁乡', '120.884131000000', '22.294869000000', 'Daren');
INSERT INTO `cf_areas` VALUES ('713435', '兰屿乡', '713400', '兰屿', '3', '089', '952', '中国,台湾,台东县,兰屿乡', '121.532473000000', '22.056736000000', 'Lanyu');
INSERT INTO `cf_areas` VALUES ('713500', '花莲县', '710000', '花莲', '2', '03', '9', '中国,台湾,花莲县', '121.300000000000', '23.830000000000', 'Hualien');
INSERT INTO `cf_areas` VALUES ('713501', '花莲市', '713500', '花莲', '3', '03', '970', '中国,台湾,花莲县,花莲市', '121.606810000000', '23.982074000000', 'Hualian');
INSERT INTO `cf_areas` VALUES ('713521', '凤林镇', '713500', '凤林', '3', '03', '975', '中国,台湾,花莲县,凤林镇', '121.451687000000', '23.744648000000', 'Fenglin');
INSERT INTO `cf_areas` VALUES ('713522', '玉里镇', '713500', '玉里', '3', '03', '981', '中国,台湾,花莲县,玉里镇', '121.316445000000', '23.336509000000', 'Yuli');
INSERT INTO `cf_areas` VALUES ('713523', '新城乡', '713500', '新城', '3', '03', '971', '中国,台湾,花莲县,新城乡', '121.640512000000', '24.128133000000', 'Xincheng');
INSERT INTO `cf_areas` VALUES ('713524', '吉安乡', '713500', '吉安', '3', '03', '973', '中国,台湾,花莲县,吉安乡', '121.568005000000', '23.961635000000', 'Ji\'an');
INSERT INTO `cf_areas` VALUES ('713525', '寿丰乡', '713500', '寿丰', '3', '03', '974', '中国,台湾,花莲县,寿丰乡', '121.508955000000', '23.870680000000', 'Shoufeng');
INSERT INTO `cf_areas` VALUES ('713526', '光复乡', '713500', '光复', '3', '03', '976', '中国,台湾,花莲县,光复乡', '121.423496000000', '23.669084000000', 'Guangfu');
INSERT INTO `cf_areas` VALUES ('713527', '丰滨乡', '713500', '丰滨', '3', '03', '977', '中国,台湾,花莲县,丰滨乡', '121.518639000000', '23.597080000000', 'Fengbin');
INSERT INTO `cf_areas` VALUES ('713528', '瑞穗乡', '713500', '瑞穗', '3', '03', '978', '中国,台湾,花莲县,瑞穗乡', '121.375992000000', '23.496817000000', 'Ruisui');
INSERT INTO `cf_areas` VALUES ('713529', '富里乡', '713500', '富里', '3', '03', '983', '中国,台湾,花莲县,富里乡', '121.250124000000', '23.179984000000', 'Fuli');
INSERT INTO `cf_areas` VALUES ('713530', '秀林乡', '713500', '秀林', '3', '03', '972', '中国,台湾,花莲县,秀林乡', '121.620381000000', '24.116642000000', 'Xiulin');
INSERT INTO `cf_areas` VALUES ('713531', '万荣乡', '713500', '万荣', '3', '03', '979', '中国,台湾,花莲县,万荣乡', '121.407493000000', '23.715346000000', 'Wanrong');
INSERT INTO `cf_areas` VALUES ('713532', '卓溪乡', '713500', '卓溪', '3', '03', '982', '中国,台湾,花莲县,卓溪乡', '121.303422000000', '23.346369000000', 'Zhuoxi');
INSERT INTO `cf_areas` VALUES ('713600', '澎湖县', '710000', '澎湖', '2', '06', '8', '中国,台湾,澎湖县', '119.566417000000', '23.569733000000', 'Penghu');
INSERT INTO `cf_areas` VALUES ('713601', '马公市', '713600', '马公', '3', '06', '880', '中国,台湾,澎湖县,马公市', '119.566499000000', '23.565845000000', 'Magong');
INSERT INTO `cf_areas` VALUES ('713621', '湖西乡', '713600', '湖西', '3', '06', '885', '中国,台湾,澎湖县,湖西乡', '119.659666000000', '23.583358000000', 'Huxi');
INSERT INTO `cf_areas` VALUES ('713622', '白沙乡', '713600', '白沙', '3', '06', '884', '中国,台湾,澎湖县,白沙乡', '119.597919000000', '23.666060000000', 'Baisha');
INSERT INTO `cf_areas` VALUES ('713623', '西屿乡', '713600', '西屿', '3', '06', '881', '中国,台湾,澎湖县,西屿乡', '119.506974000000', '23.600836000000', 'Xiyu');
INSERT INTO `cf_areas` VALUES ('713624', '望安乡', '713600', '望安', '3', '06', '882', '中国,台湾,澎湖县,望安乡', '119.500538000000', '23.357531000000', 'Wang\'an');
INSERT INTO `cf_areas` VALUES ('713625', '七美乡', '713600', '七美', '3', '06', '883', '中国,台湾,澎湖县,七美乡', '119.423929000000', '23.206018000000', 'Qimei');
INSERT INTO `cf_areas` VALUES ('713700', '金门县', '710000', '金门', '2', '082', '8', '中国,台湾,金门县', '118.317089000000', '24.432706000000', 'Jinmen');
INSERT INTO `cf_areas` VALUES ('713701', '金城镇', '713700', '金城', '3', '082', '893', '中国,台湾,金门县,金城镇', '118.316667000000', '24.416667000000', 'Jincheng');
INSERT INTO `cf_areas` VALUES ('713702', '金湖镇', '713700', '金湖', '3', '082', '891', '中国,台湾,金门县,金湖镇', '118.419743000000', '24.438633000000', 'Jinhu');
INSERT INTO `cf_areas` VALUES ('713703', '金沙镇', '713700', '金沙', '3', '082', '890', '中国,台湾,金门县,金沙镇', '118.427993000000', '24.481109000000', 'Jinsha');
INSERT INTO `cf_areas` VALUES ('713704', '金宁乡', '713700', '金宁', '3', '082', '892', '中国,台湾,金门县,金宁乡', '118.334506000000', '24.456720000000', 'Jinning');
INSERT INTO `cf_areas` VALUES ('713705', '烈屿乡', '713700', '烈屿', '3', '082', '894', '中国,台湾,金门县,烈屿乡', '118.247255000000', '24.433102000000', 'Lieyu');
INSERT INTO `cf_areas` VALUES ('713706', '乌丘乡', '713700', '乌丘', '3', '082', '896', '中国,台湾,金门县,乌丘乡', '118.319578000000', '24.435038000000', 'Wuqiu');
INSERT INTO `cf_areas` VALUES ('713800', '连江县', '710000', '连江', '2', '0836', '2', '中国,台湾,连江县', '119.539704000000', '26.197364000000', 'Lienchiang');
INSERT INTO `cf_areas` VALUES ('713801', '南竿乡', '713800', '南竿', '3', '0836', '209', '中国,台湾,连江县,南竿乡', '119.944267000000', '26.144035000000', 'Nangan');
INSERT INTO `cf_areas` VALUES ('713802', '北竿乡', '713800', '北竿', '3', '0836', '210', '中国,台湾,连江县,北竿乡', '120.000572000000', '26.221983000000', 'Beigan');
INSERT INTO `cf_areas` VALUES ('713803', '莒光乡', '713800', '莒光', '3', '0836', '211', '中国,台湾,连江县,莒光乡', '119.940405000000', '25.976256000000', 'Juguang');
INSERT INTO `cf_areas` VALUES ('713804', '东引乡', '713800', '东引', '3', '0836', '212', '中国,台湾,连江县,东引乡', '120.493955000000', '26.366164000000', 'Dongyin');
INSERT INTO `cf_areas` VALUES ('810000', '香港特别行政区', '100000', '香港', '1', '', '', '中国,香港特别行政区', '114.173355000000', '22.320048000000', 'Hong Kong');
INSERT INTO `cf_areas` VALUES ('810100', '香港岛', '810000', '香港岛', '2', '00852', '999077', '中国,香港特别行政区,香港岛', '114.177314000000', '22.266416000000', 'Hong Kong Island');
INSERT INTO `cf_areas` VALUES ('810101', '中西区', '810100', '中西区', '3', '00852', '999077', '中国,香港特别行政区,香港岛,中西区', '114.154374000000', '22.281981000000', 'Central and Western District');
INSERT INTO `cf_areas` VALUES ('810102', '湾仔区', '810100', '湾仔区', '3', '00852', '999077', '中国,香港特别行政区,香港岛,湾仔区', '114.182915000000', '22.276389000000', 'Wan Chai District');
INSERT INTO `cf_areas` VALUES ('810103', '东区', '810100', '东区', '3', '00852', '999077', '中国,香港特别行政区,香港岛,东区', '114.255993000000', '22.262755000000', 'Eastern District');
INSERT INTO `cf_areas` VALUES ('810104', '南区', '810100', '南区', '3', '00852', '999077', '中国,香港特别行政区,香港岛,南区', '114.174134000000', '22.246760000000', 'Southern District');
INSERT INTO `cf_areas` VALUES ('810200', '九龙', '810000', '九龙', '2', '00852', '999077', '中国,香港特别行政区,九龙', '114.174950000000', '22.327115000000', 'Kowloon');
INSERT INTO `cf_areas` VALUES ('810201', '油尖旺区', '810200', '油尖旺', '3', '00852', '999077', '中国,香港特别行政区,九龙,油尖旺区', '114.173332000000', '22.311704000000', 'Yau Tsim Mong');
INSERT INTO `cf_areas` VALUES ('810202', '深水埗区', '810200', '深水埗', '3', '00852', '999077', '中国,香港特别行政区,九龙,深水埗区', '114.167210000000', '22.328171000000', 'Sham Shui Po');
INSERT INTO `cf_areas` VALUES ('810203', '九龙城区', '810200', '九龙城', '3', '00852', '999077', '中国,香港特别行政区,九龙,九龙城区', '114.195053000000', '22.326730000000', 'Jiulongcheng');
INSERT INTO `cf_areas` VALUES ('810204', '黄大仙区', '810200', '黄大仙', '3', '00852', '999077', '中国,香港特别行政区,九龙,黄大仙区', '114.199240000000', '22.336313000000', 'Wong Tai Sin');
INSERT INTO `cf_areas` VALUES ('810205', '观塘区', '810200', '观塘', '3', '00852', '999077', '中国,香港特别行政区,九龙,观塘区', '114.231268000000', '22.309430000000', 'Kwun Tong');
INSERT INTO `cf_areas` VALUES ('810300', '新界', '810000', '新界', '2', '00852', '999077', '中国,香港特别行政区,新界', '114.202408000000', '22.341766000000', 'New Territories');
INSERT INTO `cf_areas` VALUES ('810301', '荃湾区', '810300', '荃湾', '3', '00852', '999077', '中国,香港特别行政区,新界,荃湾区', '114.122952000000', '22.370973000000', 'Tsuen Wan');
INSERT INTO `cf_areas` VALUES ('810302', '屯门区', '810300', '屯门', '3', '00852', '999077', '中国,香港特别行政区,新界,屯门区', '113.977416000000', '22.391047000000', 'Tuen Mun');
INSERT INTO `cf_areas` VALUES ('810303', '元朗区', '810300', '元朗', '3', '00852', '999077', '中国,香港特别行政区,新界,元朗区', '114.039796000000', '22.443342000000', 'Yuen Long');
INSERT INTO `cf_areas` VALUES ('810304', '北区', '810300', '北区', '3', '00852', '999077', '中国,香港特别行政区,新界,北区', '114.148959000000', '22.494086000000', 'North District');
INSERT INTO `cf_areas` VALUES ('810305', '大埔区', '810300', '大埔', '3', '00852', '999077', '中国,香港特别行政区,新界,大埔区', '114.171743000000', '22.445653000000', 'Tai Po');
INSERT INTO `cf_areas` VALUES ('810306', '西贡区', '810300', '西贡', '3', '00852', '999077', '中国,香港特别行政区,新界,西贡区', '114.278540000000', '22.379440000000', 'Sai Kung');
INSERT INTO `cf_areas` VALUES ('810307', '沙田区', '810300', '沙田', '3', '00852', '999077', '中国,香港特别行政区,新界,沙田区', '114.191941000000', '22.379294000000', 'Sha Tin');
INSERT INTO `cf_areas` VALUES ('810308', '葵青区', '810300', '葵青', '3', '00852', '999077', '中国,香港特别行政区,新界,葵青区', '114.139320000000', '22.363877000000', 'Kwai Tsing');
INSERT INTO `cf_areas` VALUES ('810309', '离岛区', '810300', '离岛', '3', '00852', '999077', '中国,香港特别行政区,新界,离岛区', '113.945842000000', '22.281508000000', 'Outlying Islands');
INSERT INTO `cf_areas` VALUES ('820000', '澳门特别行政区', '100000', '澳门', '1', '', '', '中国,澳门特别行政区', '113.549090000000', '22.198951000000', 'Macau');
INSERT INTO `cf_areas` VALUES ('820100', '澳门半岛', '820000', '澳门半岛', '2', '00853', '999078', '中国,澳门特别行政区,澳门半岛', '113.549134000000', '22.198751000000', 'MacauPeninsula');
INSERT INTO `cf_areas` VALUES ('820101', '花地玛堂区', '820100', '花地玛堂区', '3', '00853', '999078', '中国,澳门特别行政区,澳门半岛,花地玛堂区', '113.552284000000', '22.208067000000', 'Nossa Senhora de Fatima');
INSERT INTO `cf_areas` VALUES ('820102', '圣安多尼堂区', '820100', '圣安多尼堂区', '3', '00853', '999078', '中国,澳门特别行政区,澳门半岛,圣安多尼堂区', '113.564301000000', '22.123810000000', 'Santo Antonio');
INSERT INTO `cf_areas` VALUES ('820103', '大堂区', '820100', '大堂', '3', '00853', '999078', '中国,澳门特别行政区,澳门半岛,大堂区', '113.552971000000', '22.188359000000', 'Sé');
INSERT INTO `cf_areas` VALUES ('820104', '望德堂区', '820100', '望德堂区', '3', '00853', '999078', '中国,澳门特别行政区,澳门半岛,望德堂区', '113.550568000000', '22.194081000000', 'Sao Lazaro');
INSERT INTO `cf_areas` VALUES ('820105', '风顺堂区', '820100', '风顺堂区', '3', '00853', '999078', '中国,澳门特别行政区,澳门半岛,风顺堂区', '113.541928000000', '22.187368000000', 'Sao Lourenco');
INSERT INTO `cf_areas` VALUES ('820200', '氹仔岛', '820000', '氹仔岛', '2', '00853', '999078', '中国,澳门特别行政区,氹仔岛', '113.577669000000', '22.156838000000', 'Taipa');
INSERT INTO `cf_areas` VALUES ('820201', '嘉模堂区', '820200', '嘉模堂区', '3', '00853', '999078', '中国,澳门特别行政区,氹仔岛,嘉模堂区', '113.565303000000', '22.149029000000', 'Our Lady Of Carmel\'s Parish');
INSERT INTO `cf_areas` VALUES ('820300', '路环岛', '820000', '路环岛', '2', '00853', '999078', '中国,澳门特别行政区,路环岛', '113.564857000000', '22.116226000000', 'Coloane');
INSERT INTO `cf_areas` VALUES ('820301', '圣方济各堂区', '820300', '圣方济各堂区', '3', '00853', '999078', '中国,澳门特别行政区,路环岛,圣方济各堂区', '113.559954000000', '22.123486000000', 'St Francis Xavier\'s Parish');
INSERT INTO `cf_areas` VALUES ('900000', '钓鱼岛', '100000', '钓鱼岛', '1', '', '', '中国,钓鱼岛', '123.478088000000', '25.742385000000', 'DiaoyuDao');
INSERT INTO `cf_areas` VALUES ('', ' ', '', '', '0', '', '', '', '0.000000000000', '0.000000000000', '');

-- ----------------------------
-- Table structure for `cf_auth`
-- ----------------------------
DROP TABLE IF EXISTS `cf_auth`;
CREATE TABLE `cf_auth` (
  `id` varchar(64) NOT NULL COMMENT '主键',
  `name` varchar(32) NOT NULL COMMENT '权限名称',
  `module` varchar(32) NOT NULL DEFAULT '' COMMENT '模块名称',
  `controller` varchar(64) NOT NULL DEFAULT '' COMMENT '控制器名称',
  `method` varchar(64) NOT NULL DEFAULT '' COMMENT '方法名称',
  `path` varchar(128) NOT NULL DEFAULT '' COMMENT '权限路径',
  `level` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '当前所处层级数',
  `description` varchar(64) NOT NULL DEFAULT '' COMMENT '权限描述',
  PRIMARY KEY (`id`),
  KEY `path` (`path`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='权限表';

-- ----------------------------
-- Records of cf_auth
-- ----------------------------
INSERT INTO `cf_auth` VALUES ('1210805280240931111', '列表', 'ucenter', 'UcenterController', 'selectListByCondition', 'ucenter-UcenterController-selectListByCondition', '2', '高级复杂查询用户列表');
INSERT INTO `cf_auth` VALUES ('1210805280240932222', '用户模块', 'ucenter', '', '', 'ucenter', '0', '');
INSERT INTO `cf_auth` VALUES ('1210805280240933333', '用户基础', 'ucenter', 'UcenterController', '', 'ucenter-UcenterController', '1', '');
INSERT INTO `cf_auth` VALUES ('1210805280240944444', '添加', 'ucenter', 'UcenterController', 'add', 'ucenter-UcenterController-add', '2', '');
INSERT INTO `cf_auth` VALUES ('1250584969034219520', '修改', 'ucenter', 'UcenterController', 'update', 'ucenter-UcenterController-update', '2', '');
INSERT INTO `cf_auth` VALUES ('1250711519507480576', '即时通讯', 'chat', '', '', 'chat', '0', '');
INSERT INTO `cf_auth` VALUES ('1250711627825381376', '好友模块', 'chat', 'friends', '', 'chat-friends', '1', '');
INSERT INTO `cf_auth` VALUES ('1250711838396219392', '好友列表', 'chat', 'friends', 'list', 'chat-friends-list', '2', '');
INSERT INTO `cf_auth` VALUES ('1251499302622777344', '用户权限', 'ucenter', 'AuthSwaggerController', '', 'ucenter-AuthSwaggerController', '1', '');
INSERT INTO `cf_auth` VALUES ('1251499485532180480', '列表', 'ucenter', 'AuthSwaggerController', 'getAuths', 'ucenter-AuthSwaggerController-getAuths', '2', '');
INSERT INTO `cf_auth` VALUES ('1251499959119433728', '添加', 'ucenter', 'AuthSwaggerController', 'addAuth', 'ucenter-AuthSwaggerController-addAuth', '2', '');
INSERT INTO `cf_auth` VALUES ('1251500091617497088', '修改', 'ucenter', 'AuthSwaggerController', 'updateAuth', 'ucenter-AuthSwaggerController-updateAuth', '2', '');
INSERT INTO `cf_auth` VALUES ('1251500153059856384', '删除', 'ucenter', 'AuthSwaggerController', 'deleteAuth', 'ucenter-AuthSwaggerController-deleteAuth', '2', '');
INSERT INTO `cf_auth` VALUES ('1251500888057106432', '用户部门', 'ucenter', 'DepartmentController', '', 'ucenter-DepartmentController', '1', '');
INSERT INTO `cf_auth` VALUES ('1251501100393746432', '列表', 'ucenter', 'DepartmentController', 'list', 'ucenter-DepartmentController-list', '2', '');
INSERT INTO `cf_auth` VALUES ('1251501209764417536', '添加', 'ucenter', 'DepartmentController', 'add', 'ucenter-DepartmentController-add', '2', '');
INSERT INTO `cf_auth` VALUES ('1251507847716065280', '修改', 'ucenter', 'DepartmentController', 'update', 'ucenter-DepartmentController-update', '2', '');
INSERT INTO `cf_auth` VALUES ('1251516984680173568', '删除', 'ucenter', 'DepartmentController', 'delete', 'ucenter-DepartmentController-delete', '2', '');
INSERT INTO `cf_auth` VALUES ('1251685813058174976', '用户角色', 'ucenter', 'RoleController', '', 'ucenter-RoleController', '1', '');
INSERT INTO `cf_auth` VALUES ('1251685916586180608', '列表', 'ucenter', 'RoleController', 'list', 'ucenter-RoleController-list', '2', '');
INSERT INTO `cf_auth` VALUES ('1251686015286542336', '添加', 'ucenter', 'RoleController', 'add', 'ucenter-RoleController-add', '2', '');
INSERT INTO `cf_auth` VALUES ('1251686083754360832', '修改', 'ucenter', 'RoleController', 'update', 'ucenter-RoleController-update', '2', '');
INSERT INTO `cf_auth` VALUES ('1251689653354528768', '删除', 'ucenter', 'RoleController', 'delete', 'ucenter-RoleController-delete', '2', '');
INSERT INTO `cf_auth` VALUES ('1251695582925979648', '详情', 'ucenter', 'UcenterController', 'findById', 'ucenter-UcenterController-findById', '2', '');
INSERT INTO `cf_auth` VALUES ('1279994723565588480', '我的信息', 'ucenter', 'UcenterController', 'getMyInfo', 'ucenter-UcenterController-getMyInfo', '2', '获取当前用户的个人信息');

-- ----------------------------
-- Table structure for `cf_car_park`
-- ----------------------------
DROP TABLE IF EXISTS `cf_car_park`;
CREATE TABLE `cf_car_park` (
  `id` varchar(64) NOT NULL,
  `name` varchar(32) NOT NULL COMMENT '停车场名字',
  `image` varchar(256) NOT NULL DEFAULT '' COMMENT '停车场照片',
  `position_x` decimal(16,12) NOT NULL COMMENT '经度',
  `position_y` decimal(16,12) NOT NULL COMMENT '纬度',
  `start_business_hours` bigint(19) unsigned NOT NULL COMMENT '开始营业时间',
  `end_business_hours` bigint(19) unsigned NOT NULL COMMENT '结束营业时间',
  `parking_space_number` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '车位数',
  `used_parking_space_number` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '已用车位数',
  `address` varchar(64) NOT NULL DEFAULT '' COMMENT '停车场地址',
  `phone` varchar(11) NOT NULL DEFAULT '' COMMENT '手机',
  `landline` varchar(16) NOT NULL DEFAULT '' COMMENT '座机',
  `status` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '状态(0-正常/1-车位已满/2-暂停营业)',
  `country_id` varchar(64) NOT NULL DEFAULT '' COMMENT '国家id',
  `province_id` varchar(64) NOT NULL DEFAULT '' COMMENT '省份id',
  `state_or_city_id` varchar(64) NOT NULL DEFAULT '' COMMENT '州或城市id',
  `zone_or_county_id` varchar(64) NOT NULL DEFAULT '' COMMENT '区或县id',
  `township_id` varchar(64) NOT NULL DEFAULT '' COMMENT '乡镇id',
  `free_time` bigint(19) unsigned NOT NULL DEFAULT '0' COMMENT '免费时长',
  `score` decimal(3,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '评分',
  `number_of_comments` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '评论数',
  `fee_upper_limit` decimal(8,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '单日费用封顶',
  `unit_duration` bigint(19) unsigned NOT NULL COMMENT '单位时长(单位-毫秒)',
  `billing_model` varchar(16) NOT NULL COMMENT '计费模式(static-静态/dynamic-动态)',
  PRIMARY KEY (`id`),
  KEY `start_business_hours` (`start_business_hours`,`end_business_hours`),
  KEY `country_id` (`country_id`,`province_id`,`state_or_city_id`,`zone_or_county_id`,`township_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='停车场表';

-- ----------------------------
-- Records of cf_car_park
-- ----------------------------
INSERT INTO `cf_car_park` VALUES ('1238744452902318080', '停车场(双凤大道)', '', '114.390815000000', '30.879354000000', '0', '0', '320', '0', '双凤大道221号附近', '13525654525', '027-888888', '0', '100000', '420000', '420100', '420111', '0', '900000', '4.00', '0', '90.00', '3600000', '');
INSERT INTO `cf_car_park` VALUES ('1238746181848952832', '东湖绿道白马洲头-停车场', 'group1/M00/00/00/wKgAJF6-sWaAVXReAAF5QOl3iKg276.jpg', '114.432587000000', '30.603544000000', '0', '0', '200', '0', '湖北省武汉市洪山区欢乐大道', '18695896989', '027-888888', '0', '100000', '420000', '420100', '420111', '0', '900000', '0.00', '0', '0.00', '3600000', '');
INSERT INTO `cf_car_park` VALUES ('1238762738750746624', '武汉站-停车场', 'group1/M00/00/00/wKgAJF6-sXCABFVOAAFC2Gci2MU235.jpg', '114.433108000000', '30.614781000000', '0', '0', '370', '45', '武汉市洪山区武汉站东一路', '13656965895', '027-888888', '0', '100000', '420000', '420100', '420111', '0', '900000', '0.00', '0', '0.00', '3600000', '');
INSERT INTO `cf_car_park` VALUES ('1238793260756689527', '江汉大学停车场', 'group1/M00/00/00/wKgAJF6-sYWADvSPAAF1JCv7Dnc953.jpg', '114.166697000000', '30.520853000000', '0', '0', '200', '0', '湖北省武汉市蔡甸区三角湖路8号', '13625687458', '027-888888', '0', '100000', '420000', '420100', '420105', '', '900000', '0.00', '0', '0.00', '3600000', '');
INSERT INTO `cf_car_park` VALUES ('1238793260759674880', '金地自在城-停车场', 'group1/M00/00/00/wKgAJF6-sbqAQ-nRAACYUf501KM021.jpg', '114.393220000000', '30.610443000000', '0', '0', '200', '0', '仁和路地铁站D口西200米', '13656965895', '027-888888', '2', '100000', '420000', '420100', '420105', '0', '900000', '0.00', '0', '0.00', '3600000', '');
INSERT INTO `cf_car_park` VALUES ('1238793260759695681', '武汉库玛华中珠宝交易中心', '', '114.290816000000', '30.579796000000', '0', '0', '100', '37', '清芬一路63号附近', '13845745692', '027-888888', '0', '100000', '420000', '420100', '420105', '', '900000', '0.00', '0', '60.00', '3600000', '1');

-- ----------------------------
-- Table structure for `cf_car_park_car`
-- ----------------------------
DROP TABLE IF EXISTS `cf_car_park_car`;
CREATE TABLE `cf_car_park_car` (
  `id` varchar(64) NOT NULL,
  `number_plate` varchar(16) NOT NULL COMMENT '车牌号',
  `uid` varchar(64) NOT NULL COMMENT '汽车主人id',
  `image` varchar(128) NOT NULL DEFAULT '' COMMENT '图片',
  `brand` varchar(32) NOT NULL DEFAULT '' COMMENT '汽车品牌(缩写关键字)',
  `model` varchar(32) NOT NULL DEFAULT '' COMMENT '型号',
  `purchase_time` bigint(19) unsigned NOT NULL DEFAULT '0' COMMENT '购买时间',
  `price` decimal(10,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '购买价格',
  `create_time` bigint(19) unsigned NOT NULL COMMENT '创建时间',
  `update_time` bigint(19) unsigned NOT NULL COMMENT '更新时间',
  `status` tinyint(3) unsigned NOT NULL COMMENT '状态(0-已删除/1-审核中/2-正常)',
  `identity_image` varchar(128) NOT NULL DEFAULT '' COMMENT '证件照',
  `identity_number` varchar(32) NOT NULL DEFAULT '' COMMENT '证件号',
  PRIMARY KEY (`id`),
  KEY `number_plate` (`number_plate`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='车辆表';

-- ----------------------------
-- Records of cf_car_park_car
-- ----------------------------
INSERT INTO `cf_car_park_car` VALUES ('1264132874521202688', '苏AUP678', '1210805280240930816', '', '', '', '0', '0.00', '1590227737428', '1590227737428', '1', '', '');
INSERT INTO `cf_car_park_car` VALUES ('1265960904713854976', '京A88888', '1255734318609801216', '', '', '', '0', '0.00', '1590663574750', '1590663574750', '1', '', '');
INSERT INTO `cf_car_park_car` VALUES ('1266362522777198592', '苏AUP678', '1255734318609801216', '', '', '', '0', '0.00', '1590759327960', '1590759327960', '1', '', '');
INSERT INTO `cf_car_park_car` VALUES ('1271635660742103040', '京A88888', '1210805280240930816', '', '', '', '0', '0.00', '1592016542021', '1592016542021', '1', '', '');
INSERT INTO `cf_car_park_car` VALUES ('1272702550751088640', 'A858888', '1210805280240930816', '', '', '', '0', '0.00', '1592270908410', '1592270908410', '1', '', '');

-- ----------------------------
-- Table structure for `cf_car_park_car_type`
-- ----------------------------
DROP TABLE IF EXISTS `cf_car_park_car_type`;
CREATE TABLE `cf_car_park_car_type` (
  `id` varchar(64) NOT NULL,
  `name` varchar(32) NOT NULL COMMENT '名字',
  `flag_key` varchar(32) NOT NULL COMMENT '关键字',
  `image` varchar(128) NOT NULL DEFAULT '',
  `description` varchar(64) NOT NULL DEFAULT '' COMMENT '描述',
  `sort_index` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '排序',
  PRIMARY KEY (`id`),
  UNIQUE KEY `flag_key` (`flag_key`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='停车场车辆类型表';

-- ----------------------------
-- Records of cf_car_park_car_type
-- ----------------------------
INSERT INTO `cf_car_park_car_type` VALUES ('1238762738750742635', '临时车', 'temporary', 'group1/M00/00/01/wKgAJF7TNI6ADFNNAAA8Roc8RPE886.jpg', '无套餐', '0');
INSERT INTO `cf_car_park_car_type` VALUES ('1266950661262184448', '周卡', 'week_card', 'group1/M00/00/01/wKgAJF7TMsiAKkKOAAAX9_YuVkQ002.png', '7天周卡', '0');
INSERT INTO `cf_car_park_car_type` VALUES ('1279368671692681216', '月卡', 'moonth_card', '', '包月卡', '0');

-- ----------------------------
-- Table structure for `cf_car_park_charging_rules`
-- ----------------------------
DROP TABLE IF EXISTS `cf_car_park_charging_rules`;
CREATE TABLE `cf_car_park_charging_rules` (
  `id` varchar(64) NOT NULL,
  `car_park_id` varchar(64) NOT NULL COMMENT '停车场id',
  `start_time` bigint(19) unsigned NOT NULL COMMENT '开始时间',
  `end_time` bigint(19) unsigned NOT NULL COMMENT '结束时间',
  `fee` decimal(10,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '实时单价',
  `create_time` bigint(19) unsigned NOT NULL COMMENT '创建时间',
  `update_time` bigint(19) unsigned NOT NULL COMMENT '更新时间',
  `status` tinyint(3) unsigned NOT NULL DEFAULT '1' COMMENT '状态(0-弃用/1-启用)',
  PRIMARY KEY (`id`),
  KEY `car_park_id` (`car_park_id`,`start_time`,`end_time`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='停车场计费规则表';

-- ----------------------------
-- Records of cf_car_park_charging_rules
-- ----------------------------
INSERT INTO `cf_car_park_charging_rules` VALUES ('1261604187691229184', '1238744452902318080', '0', '25200000', '5.00', '1589624852474', '1589672857088', '1');
INSERT INTO `cf_car_park_charging_rules` VALUES ('1261803917788573696', '1238744452902318080', '25201000', '43200000', '10.00', '1589672471840', '1589674991737', '1');
INSERT INTO `cf_car_park_charging_rules` VALUES ('1261805101433745408', '1238744452902318080', '43201000', '68400000', '8.00', '1589672754043', '1589673579571', '1');
INSERT INTO `cf_car_park_charging_rules` VALUES ('1261814919322071040', '1238744452902318080', '68401000', '86399000', '5.50', '1589675094810', '1589675094810', '1');
INSERT INTO `cf_car_park_charging_rules` VALUES ('1271640255132372992', '1238793260756689527', '0', '40026000', '5.00', '1592017637414', '1592017637414', '1');
INSERT INTO `cf_car_park_charging_rules` VALUES ('1278604358908473344', '1238744452902318080', '58801000', '58803000', '0.00', '1593678009141', '1593678009141', '1');

-- ----------------------------
-- Table structure for `cf_car_park_checkpoint`
-- ----------------------------
DROP TABLE IF EXISTS `cf_car_park_checkpoint`;
CREATE TABLE `cf_car_park_checkpoint` (
  `id` varchar(64) NOT NULL,
  `name` varchar(32) NOT NULL COMMENT '(关卡/出入口)名称',
  `car_park_id` varchar(64) NOT NULL COMMENT '停车场id',
  `position_x` decimal(16,12) NOT NULL COMMENT '卡点位置经度',
  `position_y` decimal(16,12) NOT NULL COMMENT '卡点位置纬度',
  `position_describe` varchar(64) NOT NULL DEFAULT '' COMMENT '位置描述',
  `floor` tinyint(3) NOT NULL COMMENT '所在楼层',
  `mode` tinyint(2) unsigned NOT NULL COMMENT '模式(0-完全无人值守/1-半自动/2-完全人工值守)',
  `status` tinyint(2) unsigned NOT NULL DEFAULT '0' COMMENT '卡点状态(0-正常/1-关闭通行)',
  PRIMARY KEY (`id`),
  KEY `car_park_id` (`car_park_id`),
  KEY `position_x` (`position_x`,`position_y`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of cf_car_park_checkpoint
-- ----------------------------
INSERT INTO `cf_car_park_checkpoint` VALUES ('1255802550716786582', '西B出口', '1238744452902318080', '0.000000000000', '0.000000000000', '', '1', '0', '0');
INSERT INTO `cf_car_park_checkpoint` VALUES ('1255802550716787777', '南一入口', '1238744452902318080', '0.000000000000', '0.000000000000', '', '1', '0', '0');
INSERT INTO `cf_car_park_checkpoint` VALUES ('1264361759313629184', '东南岗亭', '1238746181848952832', '0.000000000000', '0.000000000000', '东南角要点一蜡烛', '0', '0', '0');
INSERT INTO `cf_car_park_checkpoint` VALUES ('1271614164107825152', '二号门入口', '1238793260756689527', '0.000000000000', '0.000000000000', '江汉大学大门入口', '0', '0', '0');
INSERT INTO `cf_car_park_checkpoint` VALUES ('1273546282689982464', '', '1238793260759674880', '0.000000000000', '0.000000000000', '', '0', '0', '0');
INSERT INTO `cf_car_park_checkpoint` VALUES ('1277488761378267136', '', '1238746181848952832', '0.000000000000', '0.000000000000', '', '0', '0', '0');

-- ----------------------------
-- Table structure for `cf_car_park_device`
-- ----------------------------
DROP TABLE IF EXISTS `cf_car_park_device`;
CREATE TABLE `cf_car_park_device` (
  `id` varchar(64) NOT NULL,
  `car_park_id` varchar(64) NOT NULL COMMENT '停车场id',
  `bar_code` varchar(64) NOT NULL DEFAULT '' COMMENT '设备条形码',
  `brand` varchar(32) NOT NULL COMMENT '品牌',
  `model` varchar(64) NOT NULL COMMENT '型号',
  `status` tinyint(2) unsigned NOT NULL DEFAULT '1' COMMENT '0-已下线/1-正常/2-故障维护',
  `last_online_time` bigint(19) unsigned NOT NULL COMMENT '最近上线时间',
  `link_mode` varchar(32) NOT NULL COMMENT '连接模式(poll-轮询/socket-长连接)',
  `type` tinyint(2) unsigned NOT NULL COMMENT '1-匝道/2-相机',
  `checkpoint_id` varchar(64) NOT NULL COMMENT '关卡(出入口)id',
  `product_id` varchar(64) NOT NULL DEFAULT '' COMMENT '产品id',
  `direction` varchar(32) NOT NULL COMMENT '方向',
  PRIMARY KEY (`id`),
  KEY `car_park_id` (`car_park_id`),
  KEY `bar_code` (`bar_code`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='停车场设备表';

-- ----------------------------
-- Records of cf_car_park_device
-- ----------------------------
INSERT INTO `cf_car_park_device` VALUES ('1271614637158207488', '1238793260756689527', '40962d12-63d8b8ee', 'zhen_shi', '300万高清车牌识别一体机', '1', '1592011514000', 'poll', '2', '1271614164107825152', '', 'in');

-- ----------------------------
-- Table structure for `cf_car_park_device_brand`
-- ----------------------------
DROP TABLE IF EXISTS `cf_car_park_device_brand`;
CREATE TABLE `cf_car_park_device_brand` (
  `id` varchar(64) NOT NULL,
  `name` varchar(32) NOT NULL COMMENT '设备品牌名称',
  `image` varchar(64) NOT NULL DEFAULT '' COMMENT '封面/logo',
  `sort_index` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '排序',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='设备品牌表';

-- ----------------------------
-- Records of cf_car_park_device_brand
-- ----------------------------

-- ----------------------------
-- Table structure for `cf_car_park_device_vendor`
-- ----------------------------
DROP TABLE IF EXISTS `cf_car_park_device_vendor`;
CREATE TABLE `cf_car_park_device_vendor` (
  `id` varchar(64) NOT NULL,
  `name` varchar(32) NOT NULL COMMENT '厂商名称',
  `country_id` varchar(64) NOT NULL COMMENT '所在国家',
  `province_id` varchar(64) NOT NULL DEFAULT '' COMMENT '省份id',
  `state_or_city_id` varchar(64) NOT NULL COMMENT '州或市id',
  `county_id` varchar(64) NOT NULL DEFAULT '' COMMENT '县id',
  `position_x` decimal(16,12) NOT NULL COMMENT '厂商位置经度',
  `position_y` decimal(16,12) NOT NULL COMMENT '厂商位置纬度',
  `address` varchar(64) NOT NULL,
  `introduction` text NOT NULL COMMENT '厂商简介',
  PRIMARY KEY (`id`),
  KEY `position_x` (`position_x`,`position_y`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='停车场设备厂商表';

-- ----------------------------
-- Records of cf_car_park_device_vendor
-- ----------------------------

-- ----------------------------
-- Table structure for `cf_car_park_link_user`
-- ----------------------------
DROP TABLE IF EXISTS `cf_car_park_link_user`;
CREATE TABLE `cf_car_park_link_user` (
  `id` varchar(64) NOT NULL,
  `car_park_id` varchar(64) NOT NULL COMMENT '停车场id',
  `uid` varchar(64) NOT NULL COMMENT '用户id',
  PRIMARY KEY (`id`),
  KEY `uid` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='停车场与用户关联表';

-- ----------------------------
-- Records of cf_car_park_link_user
-- ----------------------------

-- ----------------------------
-- Table structure for `cf_car_park_package`
-- ----------------------------
DROP TABLE IF EXISTS `cf_car_park_package`;
CREATE TABLE `cf_car_park_package` (
  `id` varchar(64) NOT NULL,
  `car_park_id` varchar(64) NOT NULL COMMENT '停车场id',
  `type_key` varchar(32) NOT NULL COMMENT '车辆类型',
  `start_time` bigint(19) unsigned NOT NULL COMMENT '套餐开始时间',
  `end_time` bigint(19) unsigned NOT NULL COMMENT '套餐结束时间',
  `create_time` bigint(19) unsigned NOT NULL COMMENT '创建时间',
  `uid` varchar(64) NOT NULL COMMENT '用户id',
  `number_plate` varchar(16) NOT NULL COMMENT '车牌号',
  PRIMARY KEY (`id`),
  KEY `uid` (`uid`),
  KEY `car_park_id` (`car_park_id`),
  KEY `number_plate` (`number_plate`),
  KEY `start_time` (`start_time`),
  KEY `end_time` (`end_time`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='车辆对应车场套餐表';

-- ----------------------------
-- Records of cf_car_park_package
-- ----------------------------
INSERT INTO `cf_car_park_package` VALUES ('1238793260757812658', '1238793260756689527', 'month_card', '1589806510000', '1590843310000', '1590238510639', '1210805280240930816', '苏AUP678');

-- ----------------------------
-- Table structure for `cf_car_park_package_price`
-- ----------------------------
DROP TABLE IF EXISTS `cf_car_park_package_price`;
CREATE TABLE `cf_car_park_package_price` (
  `id` varchar(64) NOT NULL,
  `title` varchar(32) NOT NULL COMMENT '标题(名称)',
  `subtitle` varchar(32) NOT NULL COMMENT '副标题',
  `image` varchar(128) NOT NULL DEFAULT '' COMMENT '图标',
  `flag_key` varchar(32) NOT NULL COMMENT '套餐类型关键字',
  `car_park_id` varchar(64) NOT NULL COMMENT '停车场id',
  `original_price` decimal(10,2) unsigned NOT NULL COMMENT '原价',
  `current_price` decimal(10,2) NOT NULL COMMENT '现价',
  `time_quota` bigint(19) unsigned NOT NULL COMMENT '时间额度，购买后套餐增加的时间值',
  `sort_index` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '排序',
  PRIMARY KEY (`id`),
  UNIQUE KEY `car_park_id` (`car_park_id`,`flag_key`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='停车场套餐费用表';

-- ----------------------------
-- Records of cf_car_park_package_price
-- ----------------------------
INSERT INTO `cf_car_park_package_price` VALUES ('1264709841209456238', '清爽一夏包月卡', '三角湖畔微风抚爱车', 'group1/M00/00/01/wKgAJF7TMYaAL20iAABkDRQWSRM637.jpg', 'month_card', '1238793260756689527', '1200.00', '1150.00', '0', '0');

-- ----------------------------
-- Table structure for `cf_car_park_payment_agency`
-- ----------------------------
DROP TABLE IF EXISTS `cf_car_park_payment_agency`;
CREATE TABLE `cf_car_park_payment_agency` (
  `id` varchar(64) NOT NULL,
  `car_park_id` varchar(64) NOT NULL COMMENT '停车场id',
  `user_payment_agency` varchar(64) NOT NULL COMMENT '用户与支付机构的关联表id',
  `sort_index` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '排序值',
  PRIMARY KEY (`id`),
  KEY `car_park_id` (`car_park_id`,`user_payment_agency`,`sort_index`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='停车场支付机构关联表';

-- ----------------------------
-- Records of cf_car_park_payment_agency
-- ----------------------------
INSERT INTO `cf_car_park_payment_agency` VALUES ('2', '1238793260756689527', '1273037779370796524', '0');
INSERT INTO `cf_car_park_payment_agency` VALUES ('1', '1238793260756689527', '9865543545', '0');

-- ----------------------------
-- Table structure for `cf_car_park_release_log`
-- ----------------------------
DROP TABLE IF EXISTS `cf_car_park_release_log`;
CREATE TABLE `cf_car_park_release_log` (
  `id` varchar(64) NOT NULL,
  `carpark_id` varchar(64) NOT NULL COMMENT '停车场id',
  `carpark_use_log_id` varchar(64) NOT NULL DEFAULT '' COMMENT '停车记录id',
  `number_plate` varchar(16) NOT NULL DEFAULT '' COMMENT '车牌号',
  `uid` varchar(64) NOT NULL COMMENT '申请人',
  `device_serial_number` varchar(128) NOT NULL COMMENT '序列号',
  `application_time` bigint(19) unsigned NOT NULL COMMENT '申请时间',
  `application_reason` tinytext NOT NULL COMMENT '申请原因',
  `execution_time` bigint(19) unsigned NOT NULL DEFAULT '0' COMMENT '执行时间',
  `status` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '状态(0-待执行/1-执行成功/2-执行失败)',
  PRIMARY KEY (`id`),
  KEY `device_serial_number` (`device_serial_number`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='停车场放行记录表';

-- ----------------------------
-- Records of cf_car_park_release_log
-- ----------------------------
INSERT INTO `cf_car_park_release_log` VALUES ('1277511203629629440', '1238793260756689527', '1271631068969771008', '京A88888', '1210805280240930816', '40962d12-63d8b8ee', '1593417380612', '测试放行', '1593417228000', '1');

-- ----------------------------
-- Table structure for `cf_car_park_use_log`
-- ----------------------------
DROP TABLE IF EXISTS `cf_car_park_use_log`;
CREATE TABLE `cf_car_park_use_log` (
  `id` varchar(64) NOT NULL,
  `number_plate` varchar(16) NOT NULL COMMENT '车牌号',
  `uid` varchar(64) NOT NULL DEFAULT '' COMMENT '用户id(使用场景:申请临时通行时会标记用户)',
  `in_small_image` varchar(128) NOT NULL DEFAULT '' COMMENT '进场小图',
  `out_small_image` varchar(128) NOT NULL DEFAULT '' COMMENT '出场小图',
  `in_big_image` varchar(128) NOT NULL DEFAULT '' COMMENT '进场大图',
  `out_big_image` varchar(128) NOT NULL DEFAULT '' COMMENT '出场大图',
  `car_park_id` varchar(64) NOT NULL COMMENT '停车场id',
  `in_time` bigint(19) unsigned NOT NULL COMMENT '进场时间',
  `out_time` bigint(19) unsigned NOT NULL DEFAULT '0' COMMENT '出场时间',
  `in_release_type` tinyint(2) unsigned NOT NULL COMMENT '入场放行方式(0-未知/1-自动抬杆/2-人工抬杆/3-手机放行，断电断网时)',
  `out_release_type` tinyint(2) unsigned NOT NULL COMMENT '出场放行方式(0-未知/1-自动抬杆/2-人工抬杆/3-手机放行，断电断网时)',
  `in_check_point_id` varchar(64) NOT NULL COMMENT '入口id',
  `out_check_point_id` varchar(64) NOT NULL DEFAULT '' COMMENT '出口id',
  `create_position` varchar(16) NOT NULL COMMENT '产生该停车记录的位置(out-外场/in-内场)',
  `pay_time` bigint(19) unsigned NOT NULL DEFAULT '0' COMMENT '支付时间',
  `create_time` bigint(19) unsigned NOT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `number_plate` (`number_plate`),
  KEY `car_park_id` (`car_park_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='车辆出入记录';

-- ----------------------------
-- Records of cf_car_park_use_log
-- ----------------------------
INSERT INTO `cf_car_park_use_log` VALUES ('1271631068969771008', '京A88888', '', '', '', '', '', '1238793260756689527', '1592015443000', '1592017094000', '1', '0', '1271614164107825152', '1271614164107825152', 'out', '0', '1592015447262');
INSERT INTO `cf_car_park_use_log` VALUES ('1272060188996354048', '京A88888', '', '', '', '', '', '1238793260756689527', '1592117755000', '0', '1', '0', '1271614164107825152', '', 'out', '1592118081289', '1592117757449');
INSERT INTO `cf_car_park_use_log` VALUES ('1272112111317389312', '京A88888', '', '', '', '', '', '1238793260756689527', '1592118121000', '0', '1', '0', '1271614164107825152', '', 'out', '0', '1592130136695');
INSERT INTO `cf_car_park_use_log` VALUES ('1272112120582606848', '京A88888', '', '', '', '', '', '1238793260756689527', '1592130134000', '0', '1', '0', '1271614164107825152', '', 'out', '0', '1592130138904');
INSERT INTO `cf_car_park_use_log` VALUES ('1272315632331427840', '京A88888', '', '', '', '', '', '1238793260756689527', '1592178655000', '0', '1', '0', '1271614164107825152', '', 'out', '0', '1592178659886');

-- ----------------------------
-- Table structure for `cf_coupon`
-- ----------------------------
DROP TABLE IF EXISTS `cf_coupon`;
CREATE TABLE `cf_coupon` (
  `id` varchar(64) NOT NULL,
  `to_uid` varchar(64) NOT NULL COMMENT '受赠用户id',
  `from_uid` varchar(19) NOT NULL COMMENT '发放者id',
  `scenes` tinyint(2) unsigned NOT NULL COMMENT '使用场景(0-通用/1-停车场/2-传统商城)',
  `shop_id` varchar(64) NOT NULL DEFAULT '' COMMENT '店铺id(为空时表示不限店铺使用)',
  `goods_id` varchar(64) NOT NULL DEFAULT '' COMMENT '商品id(留空这表示不限商品)',
  `denomination` decimal(10,2) unsigned NOT NULL COMMENT '优惠券面额',
  `effective_time` bigint(19) unsigned NOT NULL COMMENT '生效时间',
  `expire_time` bigint(19) unsigned NOT NULL COMMENT '失效时间',
  `status` tinyint(3) unsigned NOT NULL COMMENT '状态(0-已使用/1-未使用/2-锁定)',
  `create_time` bigint(19) unsigned NOT NULL COMMENT '创建时间',
  `use_time` bigint(19) unsigned NOT NULL COMMENT '使用时间',
  PRIMARY KEY (`id`),
  KEY `to_uid` (`to_uid`,`effective_time`,`expire_time`,`scenes`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='优惠券表';

-- ----------------------------
-- Records of cf_coupon
-- ----------------------------
INSERT INTO `cf_coupon` VALUES ('1246616172413770776', '1255734318609801216', '0', '1', '', '', '15.00', '1590007994000', '1590057994000', '1', '1580007994000', '1591535987848');
INSERT INTO `cf_coupon` VALUES ('1246616172413771776', '1255734318609801216', '0', '1', '', '', '15.00', '1590047931000', '1592726331000', '1', '1590047978584', '0');
INSERT INTO `cf_coupon` VALUES ('1246616172413771786', '1255734318609801216', '0', '1', '', '', '15.00', '1590047931000', '1592726331000', '1', '1590047978584', '0');
INSERT INTO `cf_coupon` VALUES ('1246616172413779776', '1255734318609801216', '0', '1', '', '', '15.00', '1590047931000', '1592726331000', '0', '1590047978584', '0');
INSERT INTO `cf_coupon` VALUES ('1246616172413795276', '1210805280240930816', '0', '1', '', '', '920.00', '1590047931000', '1592726331000', '0', '1590047978584', '0');

-- ----------------------------
-- Table structure for `cf_department`
-- ----------------------------
DROP TABLE IF EXISTS `cf_department`;
CREATE TABLE `cf_department` (
  `id` varchar(64) NOT NULL COMMENT '主键',
  `name` varchar(32) NOT NULL COMMENT '部门名称',
  `icon` varchar(128) NOT NULL DEFAULT '' COMMENT '部门图标',
  `sort_index` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '顺序序号',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='部门表';

-- ----------------------------
-- Records of cf_department
-- ----------------------------
INSERT INTO `cf_department` VALUES ('1210805280240930800', '技术部', '', '0');
INSERT INTO `cf_department` VALUES ('1247725634432159744', '产品部', '', '1');
INSERT INTO `cf_department` VALUES ('1247865899398656000', '市场部', '', '0');

-- ----------------------------
-- Table structure for `cf_order`
-- ----------------------------
DROP TABLE IF EXISTS `cf_order`;
CREATE TABLE `cf_order` (
  `id` varchar(128) NOT NULL,
  `uid` varchar(64) NOT NULL DEFAULT '' COMMENT '用户id',
  `goods_name` varchar(128) NOT NULL COMMENT '商品名称(快照)',
  `goods_id` varchar(128) NOT NULL COMMENT '商品id',
  `goods_image` varchar(128) NOT NULL DEFAULT '' COMMENT '商品图(快照)',
  `goods_type` tinyint(3) unsigned NOT NULL COMMENT '商品类型(1-停车/2-充值或提现/3-商城/4-转账或收款)',
  `amounts_payable` decimal(10,2) unsigned NOT NULL COMMENT '应付金额',
  `amount_actually_paid` decimal(10,2) unsigned NOT NULL COMMENT '实付金额',
  `refund_amount` decimal(10,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '退款金额',
  `coupon_id` varchar(128) NOT NULL DEFAULT '' COMMENT '优惠券id',
  `status` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '订单状态(0-待支付/1-已支付/2-已发货/3-已取消/4-一退款中/5-已退款/6-退货中/7-已退货/8-交易成功/9-售后中/10-售后已结束)',
  `create_time` bigint(19) unsigned NOT NULL COMMENT '创建时间',
  `pay_time` bigint(19) unsigned NOT NULL DEFAULT '0' COMMENT '支付时间',
  `refund_time` bigint(19) unsigned NOT NULL DEFAULT '0' COMMENT '退款时间',
  `cancel_time` bigint(19) unsigned NOT NULL DEFAULT '0' COMMENT '取消时间',
  `payment_agency_short_name` varchar(64) NOT NULL DEFAULT '' COMMENT '支付机构(缩写之类的)',
  `third_party_order_id` varchar(64) NOT NULL DEFAULT '' COMMENT '第三方订单id',
  `effect_object` varchar(128) NOT NULL DEFAULT '' COMMENT '使用(作用)对象',
  PRIMARY KEY (`id`),
  KEY `goods_id` (`goods_id`,`goods_type`),
  KEY `uid` (`uid`,`goods_type`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='订单表';

-- ----------------------------
-- Records of cf_order
-- ----------------------------
INSERT INTO `cf_order` VALUES ('1271631069271687168', '1210805280240930816', '停车缴费:京A88888', '1271631068969771008', '', '1', '5.00', '0.00', '0.00', '', '0', '1592015447334', '1592016946780', '1592016946782', '1592016946783', '', '', '京A88888');
INSERT INTO `cf_order` VALUES ('1271631069271698527', '1210805280240930816', '停车缴费:鄂A88888', '1271631068969771008', '', '1', '0.00', '0.00', '0.00', '', '1', '1592015447334', '1592016946780', '1592016946782', '1592016946783', '', '', '京A88888');
INSERT INTO `cf_order` VALUES ('1272060194297954304', '', '停车缴费:京A88888', '1272060188996354048', '', '1', '0.00', '0.00', '0.00', '', '0', '1592117758713', '0', '0', '0', '', '', '京A88888');
INSERT INTO `cf_order` VALUES ('1272060789784264704', '', '停车缴费:Test', '1272060789348057088', 'group1/M00/00/01/wKgAJF7wXx2AJ2CiAAB-HeckRoY466.jpg', '1', '0.00', '0.00', '0.00', '', '1', '1592117900688', '1592811298812', '1592811298812', '1592811298812', '', '', 'Test');
INSERT INTO `cf_order` VALUES ('1272112117545844736', '', '停车缴费:京A88888', '1272112111317389312', '', '1', '0.00', '0.00', '0.00', '', '1', '1592130138180', '1592317221000', '1592317223195', '1592317223195', '', '', '京A88888');
INSERT INTO `cf_order` VALUES ('1272112120901287936', '', '停车缴费:京A88888', '1272112120582606848', '', '1', '0.00', '0.00', '0.00', '', '1', '1592130138980', '0', '0', '0', '', '', '京A88888');
INSERT INTO `cf_order` VALUES ('1272315658705281024', '', '停车缴费:京A88888', '1272315632331427840', '', '1', '0.00', '0.00', '0.00', '', '0', '1592178666174', '0', '0', '0', '', '', '京A88888');

-- ----------------------------
-- Table structure for `cf_payment_agency`
-- ----------------------------
DROP TABLE IF EXISTS `cf_payment_agency`;
CREATE TABLE `cf_payment_agency` (
  `id` varchar(64) NOT NULL,
  `name` varchar(64) NOT NULL COMMENT '名称',
  `short_name` varchar(32) NOT NULL COMMENT '简称(唯一标识符)',
  `image` varchar(128) NOT NULL DEFAULT '' COMMENT '图片',
  `sort_index` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '排序值',
  `score_type` varchar(32) NOT NULL COMMENT '积分类型',
  PRIMARY KEY (`id`),
  UNIQUE KEY `short_name` (`short_name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='支付机构表';

-- ----------------------------
-- Records of cf_payment_agency
-- ----------------------------
INSERT INTO `cf_payment_agency` VALUES ('1269765966015365121', '免费', 'system_free_time', '', '0', 'cny');
INSERT INTO `cf_payment_agency` VALUES ('1269765966015365122', '中国银行', 'bank_of_china_cny', '', '0', 'cny');
INSERT INTO `cf_payment_agency` VALUES ('1269765966015365123', '微信', 'wei_xin_pay_cny', '', '0', 'cny');
INSERT INTO `cf_payment_agency` VALUES ('1269765966015365124', '支付宝', 'ali_pay_cny', '', '0', 'cny');
INSERT INTO `cf_payment_agency` VALUES ('1269765966015365125', '优惠券', 'coupon', '', '0', 'cny');
INSERT INTO `cf_payment_agency` VALUES ('1269765966015365126', '套餐', 'package', '', '0', 'cny');
INSERT INTO `cf_payment_agency` VALUES ('1269765966015365127', '微信网页', 'wei_xin_web_pay_cny', '', '0', 'cny');

-- ----------------------------
-- Table structure for `cf_role`
-- ----------------------------
DROP TABLE IF EXISTS `cf_role`;
CREATE TABLE `cf_role` (
  `id` varchar(64) NOT NULL COMMENT '主键',
  `name` varchar(32) NOT NULL COMMENT '角色名称',
  `flag_key` varchar(32) NOT NULL COMMENT '角色关键字(英文名)',
  `department_id` varchar(64) NOT NULL COMMENT '所属部门(组)',
  `role_level` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '权限水平(用于同等角色或者不同角色具有相同权限时是否操作对方信息)',
  `icon` varchar(128) NOT NULL DEFAULT '' COMMENT '角色图标',
  `description` varchar(64) NOT NULL DEFAULT '' COMMENT '角色描述',
  PRIMARY KEY (`id`),
  KEY `department_id` (`department_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='角色表';

-- ----------------------------
-- Records of cf_role
-- ----------------------------
INSERT INTO `cf_role` VALUES ('1210805280240955556', '管理员', 'admin', '1210805280240930800', '0', '', '超级无敌');
INSERT INTO `cf_role` VALUES ('1251695120545910784', '普通用户', 'common_user', '1247865899398656000', '0', '', '');

-- ----------------------------
-- Table structure for `cf_role_auth`
-- ----------------------------
DROP TABLE IF EXISTS `cf_role_auth`;
CREATE TABLE `cf_role_auth` (
  `id` varchar(64) NOT NULL COMMENT '主键',
  `role_id` varchar(64) NOT NULL COMMENT ' 角色id',
  `auth_id` varchar(64) NOT NULL COMMENT '权限id',
  PRIMARY KEY (`id`),
  KEY `role_id` (`role_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='角色权限表';

-- ----------------------------
-- Records of cf_role_auth
-- ----------------------------
INSERT INTO `cf_role_auth` VALUES ('1251695715642150912', '1210805280240955556', '1210805280240932222');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150913', '1210805280240955556', '1210805280240933333');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150914', '1210805280240955556', '1210805280240931111');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150915', '1210805280240955556', '1210805280240944444');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150916', '1210805280240955556', '1250584969034219520');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150917', '1210805280240955556', '1251695582925979648');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150918', '1210805280240955556', '1251499302622777344');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150919', '1210805280240955556', '1251499485532180480');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150920', '1210805280240955556', '1251499959119433728');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150921', '1210805280240955556', '1251500091617497088');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150922', '1210805280240955556', '1251500153059856384');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150923', '1210805280240955556', '1251500888057106432');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150924', '1210805280240955556', '1251501100393746432');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150925', '1210805280240955556', '1251501209764417536');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150926', '1210805280240955556', '1251507847716065280');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150927', '1210805280240955556', '1251516984680173568');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150928', '1210805280240955556', '1251685813058174976');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150929', '1210805280240955556', '1251685916586180608');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150930', '1210805280240955556', '1251686015286542336');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150931', '1210805280240955556', '1251686083754360832');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150932', '1210805280240955556', '1251689653354528768');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150933', '1210805280240955556', '1250711519507480576');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150934', '1210805280240955556', '1250711627825381376');
INSERT INTO `cf_role_auth` VALUES ('1251695715642150935', '1210805280240955556', '1250711838396219392');
INSERT INTO `cf_role_auth` VALUES ('1251697647479853056', '1251695120545910784', '1210805280240931111');
INSERT INTO `cf_role_auth` VALUES ('1251697647479853057', '1251695120545910784', '1251695582925979648');
INSERT INTO `cf_role_auth` VALUES ('1251697647479853058', '1251695120545910784', '1251499485532180480');
INSERT INTO `cf_role_auth` VALUES ('1251697647479853059', '1251695120545910784', '1251501100393746432');
INSERT INTO `cf_role_auth` VALUES ('1251697647479853060', '1251695120545910784', '1251685916586180608');
INSERT INTO `cf_role_auth` VALUES ('1251697647479853061', '1251695120545910784', '1210805280240932222');
INSERT INTO `cf_role_auth` VALUES ('1251697647479853062', '1251695120545910784', '1210805280240933333');
INSERT INTO `cf_role_auth` VALUES ('1251697647479853063', '1251695120545910784', '1251499302622777344');
INSERT INTO `cf_role_auth` VALUES ('1251697647479853064', '1251695120545910784', '1251500888057106432');
INSERT INTO `cf_role_auth` VALUES ('1251697647479853065', '1251695120545910784', '1251685813058174976');

-- ----------------------------
-- Table structure for `cf_score_type`
-- ----------------------------
DROP TABLE IF EXISTS `cf_score_type`;
CREATE TABLE `cf_score_type` (
  `id` varchar(64) NOT NULL,
  `name` varchar(32) NOT NULL COMMENT '积分名称',
  `key_flag` varchar(32) NOT NULL COMMENT '标识符',
  `image` varchar(128) NOT NULL DEFAULT '' COMMENT '图片',
  `currency_unit` varchar(32) NOT NULL COMMENT '货币单位',
  PRIMARY KEY (`id`),
  UNIQUE KEY `key_flag` (`key_flag`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='积分类型表';

-- ----------------------------
-- Records of cf_score_type
-- ----------------------------

-- ----------------------------
-- Table structure for `cf_sms`
-- ----------------------------
DROP TABLE IF EXISTS `cf_sms`;
CREATE TABLE `cf_sms` (
  `id` varchar(64) NOT NULL,
  `phone` varchar(11) NOT NULL,
  `code` varchar(16) NOT NULL,
  `type` tinyint(3) unsigned NOT NULL COMMENT '短信类型(1-注册/2-身份验证/3-通知)',
  `status` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '0-未使用/1-已使用',
  `create_time` bigint(19) unsigned NOT NULL COMMENT '创建时间',
  `expire_time` bigint(19) unsigned NOT NULL COMMENT '过期时间',
  PRIMARY KEY (`id`),
  KEY `phone` (`phone`,`expire_time`),
  KEY `phone_2` (`phone`,`code`,`create_time`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='短信发送记录表';

-- ----------------------------
-- Records of cf_sms
-- ----------------------------
INSERT INTO `cf_sms` VALUES ('1210802880796995584', '18086495676', '307401', '1', '1', '1577512877068', '1577513177068');
INSERT INTO `cf_sms` VALUES ('1210804250845425664', '18086495676', '876732', '1', '1', '1577513203713', '1577513503713');
INSERT INTO `cf_sms` VALUES ('1210804974962651136', '18086495676', '478740', '1', '1', '1577513376356', '1577513676356');
INSERT INTO `cf_sms` VALUES ('1210805229389131776', '18086495676', '909360', '1', '1', '1577513437016', '1577513737016');
INSERT INTO `cf_sms` VALUES ('1210828949734338560', '13628621937', '119928', '1', '1', '1577519092387', '1577519392387');
INSERT INTO `cf_sms` VALUES ('1211097038868004864', '13652587858', '194401', '1', '0', '1577583009818', '1577583309818');
INSERT INTO `cf_sms` VALUES ('1211097038985445376', '13652587858', '775359', '1', '0', '1577583009846', '1577583309846');
INSERT INTO `cf_sms` VALUES ('1211103281808490496', '13652587858', '844889', '1', '1', '1577584498251', '1577584798251');
INSERT INTO `cf_sms` VALUES ('1213631256038809600', '13526585698', '833375', '2', '0', '1578187214275', '1578187514275');
INSERT INTO `cf_sms` VALUES ('1213631397642706944', '13526585698', '440568', '1', '1', '1578187248036', '1578187548036');
INSERT INTO `cf_sms` VALUES ('1213650123188412416', '13696369636', '326727', '1', '1', '1578191712554', '1578192012554');
INSERT INTO `cf_sms` VALUES ('1241550670469423104', '13628621937', '732424', '1', '0', '1584843721392', '1584844021392');
INSERT INTO `cf_sms` VALUES ('1241554155923877888', '13628621937', '640052', '1', '0', '1584844552390', '1584844852390');
INSERT INTO `cf_sms` VALUES ('1241634944078360576', '18671489599', '327162', '1', '0', '1584863813787', '1584864113787');
INSERT INTO `cf_sms` VALUES ('1242138204308549632', '18671489599', '620589', '1', '0', '1584983800376', '1584984100376');
INSERT INTO `cf_sms` VALUES ('1242642926861856768', '18086495676', '948299', '1', '0', '1585104135610', '1585104435610');
INSERT INTO `cf_sms` VALUES ('1242818620673769472', '18086495676', '971581', '1', '0', '1585146024279', '1585146324279');
INSERT INTO `cf_sms` VALUES ('1242818866153799680', '13628621937', '307641', '1', '0', '1585146082806', '1585146382806');
INSERT INTO `cf_sms` VALUES ('1243043501046419456', '13628621937', '902704', '1', '0', '1585199639937', '1585199939937');
INSERT INTO `cf_sms` VALUES ('1243223866227048448', '18671489599', '429694', '1', '0', '1585242642348', '1585242942348');
INSERT INTO `cf_sms` VALUES ('1243228175350120448', '18671489599', '224991', '1', '0', '1585243669723', '1585243969723');
INSERT INTO `cf_sms` VALUES ('1243942944361168896', '18671489599', '733201', '1', '1', '1585414083935', '1585414383935');
INSERT INTO `cf_sms` VALUES ('1243946666751442944', '18671489599', '398105', '1', '0', '1585414971422', '1585415271422');
INSERT INTO `cf_sms` VALUES ('1243949373562306560', '18671489599', '238615', '1', '0', '1585415616776', '1585415916776');
INSERT INTO `cf_sms` VALUES ('1243949883002470400', '18671489599', '249234', '1', '0', '1585415738236', '1585416038236');
INSERT INTO `cf_sms` VALUES ('1243950446654013440', '18671489599', '180886', '1', '0', '1585415872621', '1585416172621');
INSERT INTO `cf_sms` VALUES ('1244244446585831424', '18671489599', '928934', '1', '0', '1585485967667', '1585486267667');
INSERT INTO `cf_sms` VALUES ('1244245435535605760', '18671489599', '865613', '1', '0', '1585486203451', '1585486503451');
INSERT INTO `cf_sms` VALUES ('1244246060780503040', '18671489599', '554074', '1', '0', '1585486352521', '1585486652521');
INSERT INTO `cf_sms` VALUES ('1244590485989769216', '18671489599', '783916', '1', '0', '1585568469890', '1585568769890');
INSERT INTO `cf_sms` VALUES ('1244664345057574912', '18671489599', '647976', '1', '0', '1585586079264', '1585586379264');
INSERT INTO `cf_sms` VALUES ('1244668045146734592', '18671489599', '116043', '1', '0', '1585586961434', '1585587261434');
INSERT INTO `cf_sms` VALUES ('1244669884349038592', '18671489599', '878229', '1', '0', '1585587399934', '1585587699934');
INSERT INTO `cf_sms` VALUES ('1244984799563730944', '18671489599', '145964', '2', '0', '1585662481572', '1585662781572');
INSERT INTO `cf_sms` VALUES ('1255423813131239424', '18086495676', '964154', '1', '0', '1588151336354', '1588151636354');
INSERT INTO `cf_sms` VALUES ('1255471295177490432', '15727010541', '327745', '1', '0', '1588162656956', '1588162956956');
INSERT INTO `cf_sms` VALUES ('1255471930711015424', '18565639479', '219974', '1', '0', '1588162808479', '1588163108479');
INSERT INTO `cf_sms` VALUES ('1255472191022104576', '18565639479', '341590', '1', '0', '1588162870542', '1588163170542');
INSERT INTO `cf_sms` VALUES ('1255472543956008960', '18565699479', '583362', '1', '1', '1588162954688', '1588163254688');
INSERT INTO `cf_sms` VALUES ('1255691951609491456', '18565699479', '393099', '1', '0', '1588215265549', '1588215565549');
INSERT INTO `cf_sms` VALUES ('1255706984074719232', '18565699479', '937292', '1', '0', '1588218849568', '1588219149568');
INSERT INTO `cf_sms` VALUES ('1255707757261107200', '18565699479', '520618', '1', '0', '1588219033910', '1588219333910');
INSERT INTO `cf_sms` VALUES ('1255708019816148992', '18565699474', '585333', '1', '0', '1588219096508', '1588219396508');
INSERT INTO `cf_sms` VALUES ('1255708300436058112', '18565699411', '237521', '1', '0', '1588219163413', '1588219463413');
INSERT INTO `cf_sms` VALUES ('1255708429746450432', '18565699443', '195355', '1', '0', '1588219194243', '1588219494243');
INSERT INTO `cf_sms` VALUES ('1255708517973635072', '18565699473', '321937', '1', '0', '1588219215278', '1588219515278');
INSERT INTO `cf_sms` VALUES ('1255733688105185280', '18565699479', '604171', '1', '1', '1588225216305', '1588225516305');
INSERT INTO `cf_sms` VALUES ('1255779871162904576', '15727010541', '732028', '1', '0', '1588236227204', '1588236527204');
INSERT INTO `cf_sms` VALUES ('1255817089881485312', '18565699479', '591440', '1', '0', '1588245100838', '1588245400838');
INSERT INTO `cf_sms` VALUES ('1258953182227316736', '18086495676', '682474', '1', '0', '1588992803519', '1588993103519');
INSERT INTO `cf_sms` VALUES ('1258953431012458496', '13628621937', '231587', '1', '0', '1588992862834', '1588993162834');
INSERT INTO `cf_sms` VALUES ('1260213899886247936', '18086495676', '788781', '2', '1', '1589293382031', '1589293682031');
INSERT INTO `cf_sms` VALUES ('1260224888450981888', '18086495676', '259851', '2', '1', '1589296001909', '1589296301909');
INSERT INTO `cf_sms` VALUES ('1260953747966713856', '18086495676', '400801', '1', '0', '1589469775560', '1589470075560');
INSERT INTO `cf_sms` VALUES ('1261118749637926912', '18565699479', '357305', '2', '1', '1589509115024', '1589509415024');
INSERT INTO `cf_sms` VALUES ('1261120064736780288', '18565699479', '261844', '2', '1', '1589509428568', '1589509728568');
INSERT INTO `cf_sms` VALUES ('1261122649237544960', '18565699479', '537050', '2', '1', '1589510044761', '1589510344761');
INSERT INTO `cf_sms` VALUES ('1261123272871829504', '18565699479', '672089', '2', '1', '1589510193447', '1589510493447');
INSERT INTO `cf_sms` VALUES ('1261126585583460352', '18565699479', '781905', '2', '1', '1589510983259', '1589511283259');
INSERT INTO `cf_sms` VALUES ('1261175740339118080', '18865699479', '438283', '2', '0', '1589522702666', '1589523002666');
INSERT INTO `cf_sms` VALUES ('1261176328477007872', '18565699479', '263430', '2', '0', '1589522842889', '1589523142889');
INSERT INTO `cf_sms` VALUES ('1261176758464471040', '18565699479', '321515', '2', '0', '1589522945406', '1589523245406');
INSERT INTO `cf_sms` VALUES ('1261177152670326784', '18565699479', '903784', '2', '1', '1589523039392', '1589523339392');
INSERT INTO `cf_sms` VALUES ('1262338339344801792', '18565699479', '527532', '2', '0', '1589799887869', '1589800187869');
INSERT INTO `cf_sms` VALUES ('1262340730492346368', '18565699479', '936518', '2', '0', '1589800457963', '1589800757963');
INSERT INTO `cf_sms` VALUES ('1262341548549398528', '18565699479', '501020', '2', '0', '1589800653003', '1589800953003');
INSERT INTO `cf_sms` VALUES ('1263661702478618624', '18565699444', '614785', '1', '0', '1590115402227', '1590115702227');
INSERT INTO `cf_sms` VALUES ('1263664316188516352', '18086495676', '333444', '1', '0', '1590116025384', '1590116325384');
INSERT INTO `cf_sms` VALUES ('1263664408168345600', '13628621937', '166658', '1', '0', '1590116047313', '1590116347313');
INSERT INTO `cf_sms` VALUES ('1263676277617963008', '18086495676', '818346', '1', '0', '1590118877211', '1590119177211');
INSERT INTO `cf_sms` VALUES ('1263721517166960640', '18565699479', '636803', '2', '0', '1590129663160', '1590129963160');
INSERT INTO `cf_sms` VALUES ('1269247980725096448', '18086495676', '365591', '2', '0', '1591447274749', '1591447574749');
INSERT INTO `cf_sms` VALUES ('1271256875941302272', '17674022714', '447968', '1', '0', '1591926232692', '1591926532692');
INSERT INTO `cf_sms` VALUES ('1271256875941396582', '18086495676', '965247', '2', '1', '1592378730000', '1592379630000');
INSERT INTO `cf_sms` VALUES ('1273161237445742592', '18086495676', '226833', '2', '1', '1592380267856', '1592380567856');
INSERT INTO `cf_sms` VALUES ('1273163245816909824', '18086495676', '675665', '2', '1', '1592380918000', '1592381758000');
INSERT INTO `cf_sms` VALUES ('1273164718558679040', '18565699479', '856232', '2', '1', '1592381097818', '1592381397818');
INSERT INTO `cf_sms` VALUES ('1273223734009794560', '18086495676', '996533', '2', '1', '1592395168198', '1592395468198');
INSERT INTO `cf_sms` VALUES ('1273512257443074048', '13867980203', '157943', '1', '0', '1592463957545', '1592464257545');
INSERT INTO `cf_sms` VALUES ('1273512524691542016', '13867980203', '222164', '2', '0', '1592464021262', '1592464321262');

-- ----------------------------
-- Table structure for `cf_third_party_login`
-- ----------------------------
DROP TABLE IF EXISTS `cf_third_party_login`;
CREATE TABLE `cf_third_party_login` (
  `id` varchar(64) NOT NULL,
  `uid` varchar(64) NOT NULL COMMENT '用户id',
  `openid` varchar(64) NOT NULL DEFAULT '',
  `unionid` varchar(64) NOT NULL DEFAULT '',
  `platform` varchar(32) NOT NULL COMMENT '平台(wxmp-微信小程序/wxwb-微信公众号/wxapp-微信app/toutiao-今日头条)',
  `create_time` bigint(19) unsigned NOT NULL COMMENT '创建时间',
  `main_body_id` varchar(64) NOT NULL DEFAULT '' COMMENT '主体id(每个主体账号id，例如在自己平台管理中的公众号id)',
  PRIMARY KEY (`id`),
  KEY `uid` (`uid`,`platform`),
  KEY `platform` (`platform`,`unionid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='第三方用户认证记录';

-- ----------------------------
-- Records of cf_third_party_login
-- ----------------------------
INSERT INTO `cf_third_party_login` VALUES ('1275000894113284096', '1275000893463166976', 'oh_r1wHLT0s-dkEzTRLNcIh5qBi4', '', 'wxwb', '1592818876184', '');

-- ----------------------------
-- Table structure for `cf_transfer_log`
-- ----------------------------
DROP TABLE IF EXISTS `cf_transfer_log`;
CREATE TABLE `cf_transfer_log` (
  `id` varchar(64) NOT NULL,
  `from_uid` varchar(64) NOT NULL COMMENT '转账用户id',
  `to_uid` varchar(64) NOT NULL COMMENT '收款用户id',
  `value` decimal(10,2) NOT NULL COMMENT '金额',
  `status` tinyint(2) unsigned NOT NULL COMMENT '状态(0-已取消/1-进行中/2-已完成/3-已取消/4-失败)',
  `create_time` bigint(19) unsigned NOT NULL COMMENT '产生时间',
  PRIMARY KEY (`id`),
  KEY `from_uid` (`from_uid`),
  KEY `to_uid` (`to_uid`),
  KEY `create_time` (`create_time`,`value`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='转账记录表';

-- ----------------------------
-- Records of cf_transfer_log
-- ----------------------------

-- ----------------------------
-- Table structure for `cf_user`
-- ----------------------------
DROP TABLE IF EXISTS `cf_user`;
CREATE TABLE `cf_user` (
  `id` varchar(64) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '用户主键id',
  `user_name` varchar(32) CHARACTER SET utf8 NOT NULL COMMENT '用户名',
  `password` varchar(128) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '用户密码',
  `avatar` varchar(255) CHARACTER SET utf8 NOT NULL DEFAULT '' COMMENT '用户头像',
  `type` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '用户类型',
  `nick_name` varchar(32) NOT NULL DEFAULT '' COMMENT '用户昵称',
  `true_name` varchar(32) NOT NULL DEFAULT '' COMMENT '用户真实姓名',
  `phone` varchar(11) NOT NULL COMMENT '手机号',
  `email` varchar(64) DEFAULT '' COMMENT '邮箱',
  `birthday` bigint(19) unsigned NOT NULL DEFAULT '0' COMMENT '生日，用户计算年龄',
  `sex` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '性别(0-保密/1-男/2-女)',
  `sign` varchar(64) NOT NULL DEFAULT '' COMMENT '个性签名',
  `create_time` bigint(19) unsigned NOT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `user_name` (`user_name`),
  KEY `email` (`email`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COMMENT='用户表';

-- ----------------------------
-- Records of cf_user
-- ----------------------------
INSERT INTO `cf_user` VALUES ('1210805280240930816', 'laowang', '$2a$10$FUXulkiYgzz.y3IgEInTiOZgYRslN2a2SeMvs9BB8CgmFddfipsGq', 'group1/M00/00/01/wKgAJF7QzquAEDXJAAYTUbE0h0M665.jpg', '0', '阿育王子', '王大diao', '18086495676', '666666@66.com', '0', '1', '老大爷', '1577513449217');
INSERT INTO `cf_user` VALUES ('1210829201413599232', 'xiaowang', '$2a$10$AnKTTu8vFvO/zi/tfcnEMembTngecQ1wfUKowzBXyii9jBjB94u7i', 'group1/M00/00/00/wKgAJF6aekaALoGZAAAX9_YuVkQ462.png', '1', '才风728538', '', '13628621937', '', '0', '0', '永不言弃', '1577519152476');
INSERT INTO `cf_user` VALUES ('1211103400092053504', 'keaigouzi', '$2a$10$PeyXj9VobvkYEkS7zubJDOBP0mKZwyjsGRbOndFxWINs9Lq4vbnwm', 'group1/M00/00/00/wKgAJF6aeq6AEbftAAAJA4uTmyI584.jpg', '0', '才风372610', '', '13652587858', '', '0', '0', '', '1577584526560');
INSERT INTO `cf_user` VALUES ('1213631458904682496', 'ximenchuixue', '$2a$10$myeuJSlWKoGFoDQGaO872erCCMFi/BIc7EMLxxVGTD6dSfBFXjaae', '', '0', '西门吹雪', '', '13526585698', '', '0', '0', '', '1578187262752');
INSERT INTO `cf_user` VALUES ('1213650207548420096', 'shashengwan', '$2a$10$fAOCP3cyijyEzHIbNvFgEONNyMDQ4d1msedE3RPVtXlqlKutJFgbS', 'group1/M00/00/00/wKgAJF6F8bSASbyKAABkDRQWSRM512.jpg', '1', '杀生丸', '', '13696369636', '', '694540800000', '1', '', '1578191732775');
INSERT INTO `cf_user` VALUES ('1243943452220190720', 'panjiangtian', '$2a$10$PLrZxgZSu7/AvQD01TgF9egwcQ/sUFEmHXHYQDq1zw1GhDU4GG0ZG', '', '0', '19940408pjt', '', '18671489599', '', '0', '0', '', '1585414205119');
INSERT INTO `cf_user` VALUES ('1245889360691896320', '卖片的123', '$2a$10$Hjj.bjaOpPUMHIZo0i0ys.cl7.1wOos/Gapet.hsR3MJpjoB1Hov.', '', '0', '专业售卖小电影', '奸商', '13666666666', '888888@qq.com', '1585878130000', '0', '专业卖片，副业招P', '1585878145873');
INSERT INTO `cf_user` VALUES ('1246616172413771776', 'admin', '$2a$10$sGzH0VPrxykr4HJa/QBZr.WnPuuHzU.UpchMhx.4OC68oKZBRm/8a', '', '4', '管理员大大', '', '', '', '1586051419000', '0', '天下无敌', '1586051431281');
INSERT INTO `cf_user` VALUES ('1255734318609801216', 'a123456', '$2a$10$hWq23h6vwZfLFeVn4SzbVu9IEgr/FncJ4hmIZj2yPl4NGjFBP6OD6', 'group1/M00/00/01/wKgAJF7LMq2AYXP8AAFhJLrI_T8007.jpg', '0', '李小冉', '', '18565699479', '', '0', '1', '', '1588225366710');
INSERT INTO `cf_user` VALUES ('1275000893463166976', '', '$2a$10$9eeJEX/l5VUmdptsBmEBvO/K58DhvEsNlu6B3.gjGSAf738KIL7Pe', 'http://thirdwx.qlogo.cn/mmopen/vi_32/Q0j4TwGTfTLcY22ibSPI77MSnLDKpa8AiaZichTTicnPlxfyqje0bp7VHOEJLIB8zTW5Hk7hSnJmVKlbtVuDLaPEyQ/132', '0', '啧啧啧', '', '', '', '0', '1', '', '1592818876137');

-- ----------------------------
-- Table structure for `cf_user_auth`
-- ----------------------------
DROP TABLE IF EXISTS `cf_user_auth`;
CREATE TABLE `cf_user_auth` (
  `id` varchar(64) NOT NULL COMMENT '主键',
  `uid` varchar(64) NOT NULL COMMENT '管理员id',
  `auth_id` varchar(64) NOT NULL COMMENT '权限id',
  PRIMARY KEY (`id`),
  KEY `uid` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='管理员权限表';

-- ----------------------------
-- Records of cf_user_auth
-- ----------------------------
INSERT INTO `cf_user_auth` VALUES ('1210805280240934351', '1210805280240930816', '1210805280240931111');
INSERT INTO `cf_user_auth` VALUES ('1210805280240934352', '1210805280240930816', '1210805280240932222');
INSERT INTO `cf_user_auth` VALUES ('1210805280240934353', '1210805280240930816', '1210805280240933333');

-- ----------------------------
-- Table structure for `cf_user_friend`
-- ----------------------------
DROP TABLE IF EXISTS `cf_user_friend`;
CREATE TABLE `cf_user_friend` (
  `id` varchar(64) NOT NULL,
  `uid` varchar(64) NOT NULL COMMENT '用户id',
  `friend_id` varchar(64) NOT NULL COMMENT '朋友id',
  `create_time` bigint(19) unsigned NOT NULL COMMENT '添加时间',
  PRIMARY KEY (`id`),
  KEY `uid` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='用户好友表';

-- ----------------------------
-- Records of cf_user_friend
-- ----------------------------
INSERT INTO `cf_user_friend` VALUES ('1210833846156464128', '1210829201413599232', '1210805280240930816', '1577520259818');
INSERT INTO `cf_user_friend` VALUES ('1210833846508785664', '1210805280240930816', '1210829201413599232', '1577520259896');
INSERT INTO `cf_user_friend` VALUES ('1210833846508785665', '1213631458904682496', '1210805280240930816', '1577520259996');
INSERT INTO `cf_user_friend` VALUES ('1210833846508785666', '1210805280240930816', '1213631458904682496', '1577520359996');
INSERT INTO `cf_user_friend` VALUES ('1218726741904789504', '1213650207548420096', '1210805280240930816', '1579402072843');
INSERT INTO `cf_user_friend` VALUES ('1218726747210584064', '1210805280240930816', '1213650207548420096', '1579402074113');

-- ----------------------------
-- Table structure for `cf_user_friend_add_log`
-- ----------------------------
DROP TABLE IF EXISTS `cf_user_friend_add_log`;
CREATE TABLE `cf_user_friend_add_log` (
  `id` varchar(64) NOT NULL,
  `from_uid` varchar(64) NOT NULL COMMENT ' 申请者记录',
  `to_uid` varchar(64) NOT NULL DEFAULT '' COMMENT '目标用户id',
  `group_id` varchar(64) NOT NULL DEFAULT '' COMMENT '群id',
  `create_time` bigint(19) unsigned NOT NULL,
  `status` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '状态(0-等待处理/1-已通过/2-已拒绝3-已忽略)',
  `remark` varchar(32) NOT NULL DEFAULT '' COMMENT '添加备注',
  `type` tinyint(1) unsigned NOT NULL COMMENT '记录类型(1-主动申请/2-邀请)',
  PRIMARY KEY (`id`),
  KEY `from_uid` (`from_uid`,`to_uid`,`create_time`),
  KEY `from_uid_2` (`from_uid`,`group_id`,`create_time`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='好友(群)申请记录表';

-- ----------------------------
-- Records of cf_user_friend_add_log
-- ----------------------------
INSERT INTO `cf_user_friend_add_log` VALUES ('1210833509873946624', '1210805280240930816', '1210829201413599232', '', '1577520179609', '1', '请求添加', '1');
INSERT INTO `cf_user_friend_add_log` VALUES ('1210942683833458688', '1210829201413599232', '', '1210841303356366848', '1577546208711', '0', '求大佬通过', '1');
INSERT INTO `cf_user_friend_add_log` VALUES ('1210942684198363136', '1210829201413599232', '1210805280240930816', '1210841303356366848', '1577546209460', '1', '求大佬通过', '1');
INSERT INTO `cf_user_friend_add_log` VALUES ('1211103943254421504', '1211103400092053504', '1210805280240930816', '1210841303356366848', '1577584667063', '1', '求大佬通过', '1');
INSERT INTO `cf_user_friend_add_log` VALUES ('1216258969094389760', '1210805280240930816', '1213631458904682496', '', '1578813709888', '0', '', '1');
INSERT INTO `cf_user_friend_add_log` VALUES ('1218726514535763968', '1210805280240930816', '1213650207548420096', '', '1579402022359', '1', '', '1');

-- ----------------------------
-- Table structure for `cf_user_group`
-- ----------------------------
DROP TABLE IF EXISTS `cf_user_group`;
CREATE TABLE `cf_user_group` (
  `id` varchar(64) NOT NULL,
  `name` varchar(32) NOT NULL COMMENT '群名称',
  `avatar` varchar(128) NOT NULL DEFAULT '' COMMENT '群头像',
  `announcement` text NOT NULL COMMENT '群公告或描述',
  `people` smallint(5) unsigned NOT NULL DEFAULT '0' COMMENT '群人数',
  `people_cap` smallint(5) unsigned NOT NULL DEFAULT '500' COMMENT '群成员上限',
  `level` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '群等级(星级)',
  `status` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '群状态(0-正常/1-存在违规内容/2-封群)',
  `creater_id` varchar(64) NOT NULL COMMENT '创建者uid',
  `create_time` bigint(19) unsigned NOT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='聊天群';

-- ----------------------------
-- Records of cf_user_group
-- ----------------------------
INSERT INTO `cf_user_group` VALUES ('1210841303356366848', '技术群', '', '', '0', '500', '0', '0', '1210805280240930816', '1577522037721');

-- ----------------------------
-- Table structure for `cf_user_group_member`
-- ----------------------------
DROP TABLE IF EXISTS `cf_user_group_member`;
CREATE TABLE `cf_user_group_member` (
  `id` varchar(64) NOT NULL,
  `group_id` varchar(64) NOT NULL COMMENT '群组id',
  `uid` varchar(64) NOT NULL COMMENT '用户id',
  `level` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '群内等级/职位(0-普通成员/1-管理员/2-群主)',
  `nick_name` varchar(32) CHARACTER SET utf8mb4 NOT NULL COMMENT '群昵称',
  `join_type` tinyint(1) unsigned NOT NULL COMMENT '入群方式(0-创建者自动入驻/1-主动申请/2-邀请)',
  `join_time` bigint(19) unsigned NOT NULL COMMENT '入群时间',
  `status` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '状态(1-正常/2-已退群/3-被踢出群)',
  `muted_deadline` bigint(19) NOT NULL DEFAULT '0' COMMENT '禁言截止时间',
  PRIMARY KEY (`id`),
  KEY `group_id` (`group_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='群成员表';

-- ----------------------------
-- Records of cf_user_group_member
-- ----------------------------
INSERT INTO `cf_user_group_member` VALUES ('1210841303893258240', '1210841303356366848', '1210805280240930816', '2', '', '0', '1577522037848', '1', '0');
INSERT INTO `cf_user_group_member` VALUES ('1211289093581852672', '1210841303356366848', '1211103400092053504', '0', '', '1', '1577628799230', '1', '0');
INSERT INTO `cf_user_group_member` VALUES ('1216377728652058624', '1210841303356366848', '1210829201413599232', '0', '', '1', '1578842024373', '1', '0');

-- ----------------------------
-- Table structure for `cf_user_message`
-- ----------------------------
DROP TABLE IF EXISTS `cf_user_message`;
CREATE TABLE `cf_user_message` (
  `id` varchar(64) NOT NULL,
  `from_uid` varchar(64) NOT NULL COMMENT '发送者',
  `to_uid` varchar(64) NOT NULL COMMENT '接收者id',
  `group_id` varchar(64) NOT NULL DEFAULT '' COMMENT '组id',
  `status` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '状态(0-未读/1-已读/2-已撤回/3-违规消息)',
  `contents` varchar(256) NOT NULL COMMENT '消息内容',
  `type` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '消息类型(0-文本/1-文件/2-视频/3-链接)',
  `client` tinyint(1) unsigned NOT NULL COMMENT '客户端类型(0-app/1-PC/2-PC浏览器/3-手机web)',
  `ip` varchar(128) NOT NULL DEFAULT '' COMMENT '发送ip',
  `create_time` int(11) NOT NULL COMMENT '创建时间',
  `receive_time` int(11) NOT NULL COMMENT '接收的时间',
  PRIMARY KEY (`id`),
  KEY `from_uid` (`from_uid`,`to_uid`,`status`,`create_time`),
  KEY `group_id` (`group_id`,`status`,`create_time`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='消息表';

-- ----------------------------
-- Records of cf_user_message
-- ----------------------------

-- ----------------------------
-- Table structure for `cf_user_payment_agency`
-- ----------------------------
DROP TABLE IF EXISTS `cf_user_payment_agency`;
CREATE TABLE `cf_user_payment_agency` (
  `id` varchar(64) NOT NULL,
  `name` varchar(32) NOT NULL COMMENT ' 机构名称',
  `uid` varchar(64) NOT NULL COMMENT '用户id',
  `payment_agency_short_name` varchar(64) NOT NULL COMMENT '机构缩写',
  `pay_key` varchar(128) NOT NULL DEFAULT '' COMMENT 'key私钥',
  `secret` varchar(128) NOT NULL DEFAULT '',
  `appid` varchar(128) NOT NULL DEFAULT '',
  `account_number_note` tinytext NOT NULL COMMENT '账号备注',
  `mch_id` varchar(64) NOT NULL DEFAULT '' COMMENT '商户号',
  `cert_path` varchar(64) NOT NULL DEFAULT '' COMMENT '证书路径',
  `pay_notify_url` varchar(128) NOT NULL COMMENT '支付通知地址',
  `refund_pay_notify_url` varchar(128) NOT NULL COMMENT '支付退款通知地址',
  `use_scenes` varchar(32) NOT NULL DEFAULT '' COMMENT '使用场景(wx_web微信网页/app/ali_web阿里网页/web-网页通用)',
  PRIMARY KEY (`id`),
  UNIQUE KEY `uid` (`uid`,`payment_agency_short_name`,`use_scenes`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='用户支付机构表';

-- ----------------------------
-- Records of cf_user_payment_agency
-- ----------------------------
INSERT INTO `cf_user_payment_agency` VALUES ('1273036987683270656', '海丰集团支付宝app支付', '5477678654565567', 'ali_pay_cny', 'UYftnewizbejq97ebnehreer', 'Hjrjs93hfzkled8jfskdhBJ3udkw', '145475545456', '带免密支付(无感支付)', 'mch6574945656', '', '', '', 'app');
INSERT INTO `cf_user_payment_agency` VALUES ('1273037779370733568', '百海办公中心', '89786655666565', 'bank_of_china_cny', 'YvNGh7QlCr5LAWsF', 'kX86KP74RxIrIxkh', 'X8nOk6Q9WySLNDag', '银联', 'FvgNYnrFoi87IzwS', '', '', '', 'app');
INSERT INTO `cf_user_payment_agency` VALUES ('1273037779370765248', '嘉州艺术学院微信网页支付', '1210829201413599232', 'wei_xin_pay_cny', '28dasdks1jn031king', '3bccbfcff1e4ba97cf716', 'wx66834d8fb', '仅限微信公众号支付', '1531703551', '/test.pem', 'test/notify', 'test/notify', 'wx_web');
INSERT INTO `cf_user_payment_agency` VALUES ('1273037779370796524', '测试支付', '1210805280240930816', 'wei_xin_pay_cny', '28dasdkle29s1jn0310fdlvsm', '3bccbfcff1e5fd4ba4c4bc620', 'wx86163003ab30', '微信公众号支付', '1531703551', '/test.pem', '1', '1', 'wx_web');

-- ----------------------------
-- Table structure for `cf_user_role`
-- ----------------------------
DROP TABLE IF EXISTS `cf_user_role`;
CREATE TABLE `cf_user_role` (
  `id` varchar(64) NOT NULL COMMENT '主键',
  `uid` varchar(64) NOT NULL COMMENT '管理员id',
  `role_id` varchar(64) NOT NULL COMMENT '角色id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='管理员角色表';

-- ----------------------------
-- Records of cf_user_role
-- ----------------------------
INSERT INTO `cf_user_role` VALUES ('1251696434789126144', '1246616172413771776', '1251695120545910784');
INSERT INTO `cf_user_role` VALUES ('1273068691749974016', '1210805280240930816', '1210805280240955556');

-- ----------------------------
-- Table structure for `oauth_access_token`
-- ----------------------------
DROP TABLE IF EXISTS `oauth_access_token`;
CREATE TABLE `oauth_access_token` (
  `token_id` varchar(256) DEFAULT NULL,
  `token` blob,
  `authentication_id` varchar(48) NOT NULL,
  `user_name` varchar(256) DEFAULT NULL,
  `client_id` varchar(256) DEFAULT NULL,
  `authentication` blob,
  `refresh_token` varchar(256) DEFAULT NULL,
  PRIMARY KEY (`authentication_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oauth_access_token
-- ----------------------------

-- ----------------------------
-- Table structure for `oauth_approvals`
-- ----------------------------
DROP TABLE IF EXISTS `oauth_approvals`;
CREATE TABLE `oauth_approvals` (
  `userId` varchar(256) DEFAULT NULL,
  `clientId` varchar(256) DEFAULT NULL,
  `scope` varchar(256) DEFAULT NULL,
  `status` varchar(10) DEFAULT NULL,
  `expiresAt` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `lastModifiedAt` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oauth_approvals
-- ----------------------------

-- ----------------------------
-- Table structure for `oauth_client_details`
-- ----------------------------
DROP TABLE IF EXISTS `oauth_client_details`;
CREATE TABLE `oauth_client_details` (
  `client_id` varchar(48) NOT NULL,
  `resource_ids` varchar(256) DEFAULT NULL,
  `client_secret` varchar(256) DEFAULT NULL,
  `scope` varchar(256) DEFAULT NULL,
  `authorized_grant_types` varchar(256) DEFAULT NULL,
  `web_server_redirect_uri` varchar(256) DEFAULT NULL,
  `authorities` varchar(256) DEFAULT NULL,
  `access_token_validity` int(11) DEFAULT NULL,
  `refresh_token_validity` int(11) DEFAULT NULL,
  `additional_information` varchar(4096) DEFAULT NULL,
  `autoapprove` varchar(256) DEFAULT NULL,
  PRIMARY KEY (`client_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oauth_client_details
-- ----------------------------
INSERT INTO `oauth_client_details` VALUES ('app', null, 'app', 'app', 'password,refresh_token', null, null, null, null, null, null);
INSERT INTO `oauth_client_details` VALUES ('XcWebApp', null, '$2a$10$9bEpZ/hWRQxyr5hn5wHUj.jxFpIrnOmBcWlE/g/0Zp3uNxt9QTh/S', 'app', 'authorization_code,password,refresh_token,client_credentials,sms', null, null, '2592000', '2592000', null, null);

-- ----------------------------
-- Table structure for `oauth_client_token`
-- ----------------------------
DROP TABLE IF EXISTS `oauth_client_token`;
CREATE TABLE `oauth_client_token` (
  `token_id` varchar(256) DEFAULT NULL,
  `token` blob,
  `authentication_id` varchar(48) NOT NULL,
  `user_name` varchar(256) DEFAULT NULL,
  `client_id` varchar(256) DEFAULT NULL,
  PRIMARY KEY (`authentication_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oauth_client_token
-- ----------------------------

-- ----------------------------
-- Table structure for `oauth_code`
-- ----------------------------
DROP TABLE IF EXISTS `oauth_code`;
CREATE TABLE `oauth_code` (
  `code` varchar(256) DEFAULT NULL,
  `authentication` blob
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oauth_code
-- ----------------------------

-- ----------------------------
-- Table structure for `oauth_refresh_token`
-- ----------------------------
DROP TABLE IF EXISTS `oauth_refresh_token`;
CREATE TABLE `oauth_refresh_token` (
  `token_id` varchar(256) DEFAULT NULL,
  `token` blob,
  `authentication` blob
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oauth_refresh_token
-- ----------------------------
INSERT INTO `oauth_refresh_token` VALUES ('b96e057b4e1c4920428e833db48d4c15', 0xEFBFBDEFBFBD00057372004C6F72672E737072696E676672616D65776F726B2E73656375726974792E6F61757468322E636F6D6D6F6E2E44656661756C744578706972696E674F417574683252656672657368546F6B656E2FEFBFBD4763EFBFBDEFBFBDC9B70200014C000A65787069726174696F6E7400104C6A6176612F7574696C2F446174653B787200446F72672E737072696E676672616D65776F726B2E73656375726974792E6F61757468322E636F6D6D6F6E2E44656661756C744F417574683252656672657368546F6B656E73EFBFBD0E0A6354EFBFBD5E0200014C000576616C75657400124C6A6176612F6C616E672F537472696E673B787074002462303132643438372D613930382D343361662D613865662D3533633533393963386264367372000E6A6176612E7574696C2E44617465686AEFBFBD014B59741903000078707708000001613B74C98E78, 0xEFBFBDEFBFBD0005737200416F72672E737072696E676672616D65776F726B2E73656375726974792E6F61757468322E70726F76696465722E4F417574683241757468656E7469636174696F6EEFBFBD400B02166252130200024C000D73746F7265645265717565737474003C4C6F72672F737072696E676672616D65776F726B2F73656375726974792F6F61757468322F70726F76696465722F4F4175746832526571756573743B4C00127573657241757468656E7469636174696F6E7400324C6F72672F737072696E676672616D65776F726B2F73656375726974792F636F72652F41757468656E7469636174696F6E3B787200476F72672E737072696E676672616D65776F726B2E73656375726974792E61757468656E7469636174696F6E2E416273747261637441757468656E7469636174696F6E546F6B656ED3AA287E6E47640E0200035A000D61757468656E746963617465644C000B617574686F7269746965737400164C6A6176612F7574696C2F436F6C6C656374696F6E3B4C000764657461696C737400124C6A6176612F6C616E672F4F626A6563743B787000737200266A6176612E7574696C2E436F6C6C656374696F6E7324556E6D6F6469666961626C654C697374EFBFBD0F2531EFBFBDEFBFBD100200014C00046C6973747400104C6A6176612F7574696C2F4C6973743B7872002C6A6176612E7574696C2E436F6C6C656374696F6E7324556E6D6F6469666961626C65436F6C6C656374696F6E194200EFBFBDEFBFBD5EEFBFBD1E0200014C00016371007E00047870737200136A6176612E7574696C2E41727261794C69737478EFBFBDEFBFBD1DEFBFBDEFBFBD61EFBFBD03000149000473697A65787000000009770400000009737200426F72672E737072696E676672616D65776F726B2E73656375726974792E636F72652E617574686F726974792E53696D706C654772616E746564417574686F7269747900000000000001EFBFBD0200014C0004726F6C657400124C6A6176612F6C616E672F537472696E673B787074000A524F4C455F61646D696E7371007E000D740006617069646F637371007E000D74000C64617461626173652F6C6F677371007E000D74000673797374656D7371007E000D740008757365722F6164647371007E000D74000B757365722F64656C6574657371007E000D740009757365722F656469747371007E000D740009757365722F766965777371007E000D740008757365724C6973747871007E000C707372003A6F72672E737072696E676672616D65776F726B2E73656375726974792E6F61757468322E70726F76696465722E4F41757468325265717565737400000000000000010200075A0008617070726F7665644C000B617574686F72697469657371007E00044C000A657874656E73696F6E7374000F4C6A6176612F7574696C2F4D61703B4C000B726564697265637455726971007E000E4C00077265667265736874003B4C6F72672F737072696E676672616D65776F726B2F73656375726974792F6F61757468322F70726F76696465722F546F6B656E526571756573743B4C000B7265736F7572636549647374000F4C6A6176612F7574696C2F5365743B4C000D726573706F6E7365547970657371007E0024787200386F72672E737072696E676672616D65776F726B2E73656375726974792E6F61757468322E70726F76696465722E426173655265717565737436287A3EEFBFBD7169EFBFBD0200034C0008636C69656E74496471007E000E4C001172657175657374506172616D657465727371007E00224C000573636F706571007E00247870740006776562417070737200256A6176612E7574696C2E436F6C6C656374696F6E7324556E6D6F6469666961626C654D6170EFBFBDEFBFBD74EFBFBD07420200014C00016D71007E00227870737200116A6176612E7574696C2E486173684D61700507EFBFBDEFBFBDEFBFBD1660EFBFBD03000246000A6C6F6164466163746F724900097468726573686F6C6478703F400000000000037708000000040000000274000A6772616E745F7479706574000870617373776F7264740008757365726E616D6574000561646D696E78737200256A6176612E7574696C2E436F6C6C656374696F6E7324556E6D6F6469666961626C65536574EFBFBD1DEFBFBDD18FEFBFBDEFBFBD550200007871007E0009737200176A6176612E7574696C2E4C696E6B656448617368536574EFBFBD6CEFBFBD5AEFBFBDEFBFBD2A1E020000787200116A6176612E7574696C2E48617368536574EFBFBD44EFBFBDEFBFBDEFBFBDEFBFBDEFBFBD340300007870770C000000103F4000000000000174000361707078017371007E0033770C000000103F40000000000000787371007E002A3F40000000000000770800000010000000007870707371007E0033770C000000103F40000000000000787371007E0033770C000000103F40000000000000787372004F6F72672E737072696E676672616D65776F726B2E73656375726974792E61757468656E7469636174696F6E2E557365726E616D6550617373776F726441757468656E7469636174696F6E546F6B656E00000000000001EFBFBD0200024C000B63726564656E7469616C7371007E00054C00097072696E636970616C71007E00057871007E0003017371007E00077371007E000B0000000977040000000971007E000F71007E001171007E001371007E001571007E001771007E001971007E001B71007E001D71007E001F7871007E003D737200176A6176612E7574696C2E4C696E6B6564486173684D617034EFBFBD4E5C106CEFBFBDEFBFBD0200015A000B6163636573734F726465727871007E002A3F400000000000067708000000080000000271007E002C71007E002D71007E002E71007E002F780070737200326F72672E737072696E676672616D65776F726B2E73656375726974792E636F72652E7573657264657461696C732E5573657200000000000001EFBFBD0200075A00116163636F756E744E6F6E457870697265645A00106163636F756E744E6F6E4C6F636B65645A001563726564656E7469616C734E6F6E457870697265645A0007656E61626C65644C000B617574686F72697469657371007E00244C000870617373776F726471007E000E4C0008757365726E616D6571007E000E7870010101017371007E0030737200116A6176612E7574696C2E54726565536574DD9850EFBFBDEFBFBDEFBFBD5B0300007870737200466F72672E737072696E676672616D65776F726B2E73656375726974792E636F72652E7573657264657461696C732E5573657224417574686F72697479436F6D70617261746F7200000000000001EFBFBD020000787077040000000971007E000F71007E001171007E001371007E001571007E001771007E001971007E001B71007E001D71007E001F787074000561646D696E);
